<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE TEI.2 PUBLIC "-//TEI P4//DTD Main DTD Driver File//EN" "http://www.ucc.ie/celt/dtds/p4x/teicelt.dtd" [
<!ENTITY % TEIbase "TEI.prose">
]>
<TEI.2 id="G800011B">
 <teiHeader creator="Beatrix F&auml;rber" status="update" date.created="2005-04-11" date.updated="2011-02-01">
<fileDesc>
<titleStmt>
<title type="uniform">Book of Leinster, formerly Lebar na Núachongb&aacute;la</title>
<title type="supplementary">Vol. 2</title>
<title type="gmd">an electronic edition</title>
<editor id="BBE">R. I. Best and Osborn Bergin</editor>
<respStmt>
<resp>Electronic edition compiled by</resp>
<name id="BH">Benjamin Hazard</name>
</respStmt>
<respStmt>
<resp>proof corrections by</resp>
<name>Caoimh&iacute;n &Oacute; Domhnaill</name>
</respStmt>
<funder>University College, Cork</funder>
<funder>The HEA via the LDT Project</funder>
</titleStmt>
<editionStmt>
<edition n="2">Second draft.</edition>
</editionStmt>
<extent><measure type="words">32520</measure></extent>
<publicationStmt>
<publisher>CELT: Corpus of Electronic Texts: a Project of University College, Cork</publisher>
<address>
<addrLine>College Road, Cork, Ireland&mdash;http://www.ucc.ie/celt</addrLine>
</address>
<date>2006</date>
<date>2011</date>
<distributor>CELT online at University College, Cork, Ireland.</distributor>
<idno type="celt">G800011B</idno>
<availability status="restricted">
<p>Available with prior consent of the CELT programme for purposes of academic research and teaching only.</p>
<p>Copyright for the printed edition rests with the School of Celtic Studies, Dublin Institute for Advanced Studies, Dublin. The electronic edition was compiled with the kind permission of the copyright owner.</p>
 </availability>
</publicationStmt>
<sourceDesc>
 <listBibl>
<head>Manuscript source</head>
<bibl n="1">Dublin, Trinity College Library, MS 1339 (H 2.18, Book of Leinster) T. K. Abbott and E. J. Gwynn (eds.) Catalogue of Irish Manuscripts in the Library of Trinity College Dublin (Dublin 1921) 158&ndash;161.</bibl>
</listBibl>
<listBibl>
<head>Editions</head>
<bibl n="1">Robert Atkinson (ed.) The Book of Leinster sometime called the Book of Glendalough with introduction, analysis of contents, and index (Dublin 1880).</bibl>
<bibl n="2">R. I. Best, Osborn Bergin, M. A. O'Brien and Anne O'Sullivan (eds.) The book of Leinster, formerly Lebar na N&uacute;achongb&aacute;la (6 volumes) (Dublin Institute for Advanced Studies 1954&ndash;1983).</bibl>
</listBibl>
<listBibl>
<head>Editions and translations of individual LL texts</head>
<bibl n="1">Charles O'Conor (ed.) Rerum hibernicarum scriptores veteres (Buckingham 1814) vol. 1, xxxi&ndash;xlii.</bibl>
<bibl n="2">John O'Donovan (ed. &amp; trans.) The enumeration of the House of Tara, in: George Petrie, On the history and antiquities of Tara Hill, Transactions of the Royal Irish Academy 18, pt. 2 (Dublin 1837) 188&ndash;93.</bibl>
<bibl n="3">John O'Donovan (ed. &amp; trans.) Suidigud Taigi Midchuardda, in: George Petrie, On the history and antiquities of Tara Hill, Transactions of the Royal Irish Academy 18, pt. 2 (Dublin 1837) 199&ndash;204.</bibl>
<bibl n="4">James Henthorn Todd (ed. &amp; trans.) Can a mbunadas na &ndot;Gaedel, in: idem (ed.) Leabhar breathnach annso sis: the Irish version of the Historia Britonum by Nennius (Dublin 1848) 220&ndash;287.</bibl>
<bibl n="5">Eugene O'Curry (ed. &amp; trans.) Lectures on the manuscript materials of ancient Irish history (Dublin 1861) 476&ndash;494, 501, 583, 637&ndash;642.</bibl>
<bibl n="6">Whitley Stokes (ed.) Fragment of Cormac's Glossary, in: Three Irish Glossaries (London 1862) 44.</bibl>
<bibl n="7">James Henthorn Todd (ed. &amp; trans.) Cogadh Gaedhel re Gallaibh: The war of the Gaedhil with the Gaill (London 1867).</bibl>
<bibl n="8">William M. Hennessy (ed. &amp; trans.) Noenden Ulad  &ampersir; Emuin Macha, in: Samuel Ferguson, Congal, a poem (Dublin 1873) </bibl>
<bibl n="9">Eugene O'Curry (trans.) Il&iacute;an casli&oacute;ir Solman, in: idem, On the manners and customs of the ancient Irish (Dublin 1873) vol. 3, 14.</bibl>
<bibl n="10">W. K. Sullivan (ed. &amp; trans.) The fight of Ferdiad and Cuchulaind: an episode from the ancient tale of the T&aacute;in B&oacute; Chuailnge, or the Cattle Prey of Cooley, in Eugene O'Curry, On the manners and customs of the ancient Irish (Dublin 1873) vol. 3, 413&ndash;463.</bibl>
<bibl n="11">J. O'Beirne Crowe (ed. &amp; trans.) The Dind-shenchus of Eriu, in Royal Historical and Archaeological Association of Ireland Journal 4 Ser. II (1874) 170&ndash;77.</bibl>
<bibl n="12">Brian O'Looney (ed. &amp; trans.) Suidigud Taigi Midchuardda, in: John T. Gilbert (ed.) Account of facsimiles of National Manuscripts of Ireland (London 1878) pt. 2, 53.</bibl>
<bibl n="13">Whitley Stokes (ed. &amp; trans.) Eclais D&eacute; b&iacute;, in: idem (ed.) On the calendar of Oengus (Dublin 1880) iv.</bibl>
<bibl n="14">Ernst Windisch (ed.) Longes mac n-Uislenn, Irische Texte mit W&ouml;rterbuch (Leipzig 1880) 67&ndash;82.</bibl>
<bibl n="15">Ernst Windisch (ed.) Sc&eacute;la Mucce meic Datho, Irische Texte mit W&ouml;rterbuch (Leipzig 1880) 93&ndash;112.</bibl>
<bibl n="16">Whitley Stokes (ed. &amp; trans.) The Destruction of Troy (Calcutta 1881).</bibl>
<bibl n="17">Thomas Olden (trans.) On the geography of Ros Ailither, in Proceedings of the Royal Irish Academy, 3 Ser. (1884) 219&ndash;252.</bibl>
<bibl n="18">Ernst Windisch (ed.) Die irische Sage Noiden Ulad, Berichte der K&ouml;nigl. s&auml;chsischen Gesellschaft der Wissenschaften 36 (1884) 336&ndash;347.</bibl>
<bibl n="19">Ernst Windisch (ed.) Ein mittelirisches Kunstgedicht &uuml;ber die Geburt des K&ouml;nigs Aed Sl&aacute;ne, Berichte der K&ouml;nigl. s&auml;chsischen Gesellschaft der Wissenschaften 36 (1884) 191&ndash;243.</bibl>
<bibl n="20">Whitley Stokes (ed. &amp; trans.) Find and the phantoms, Revue Celtique 26 (1886) 289&ndash;307.</bibl>
<bibl n="21">Henri d'Arbois de Jubainville (ed. &amp; trans.) Ind ingen colach, Revue Celtique 8 (1887) 150&ndash;156, 403.</bibl>
<bibl n="22">Whitley Stokes (ed. &amp; trans.) Incipit do &fdot;lathiusaib Herend, in: idem (ed.) Tripartite Life of Patrick, App. 18 (London 1887) 512.</bibl>
<bibl n="23">Whitley Stokes (ed. &amp; trans.) Annalad anall uile, in: idem (ed.) Tripartite Life of Patrick, vol. 2 (London 1887) 530&ndash;541.</bibl>
<bibl n="24">Whitley Stokes (ed.) The Siege of Howth, Revue Celtique 8 (1887) 47&ndash;64.</bibl>
<bibl n="25">Whitley Stokes (ed.) Annals from the Book of Leinster, A.D. 457&ndash;1189, with a translation of the Irish, in the Tripartite Life of Patrick (Rerum Britannicarum medii aevi scriptores, 89) (1887) 512&ndash;29.</bibl>
<bibl n="26">Ernst Windisch (ed.) T&aacute;in B&oacute; Flidais, Irische Texte, Ser. II. 2 (Leipzig 1887) 206&ndash;23.</bibl>
<bibl n="27">Henri Gaidoz (trans.) Les trois clercs et le chat, M&eacute;lusine 4 (1888) 6&ndash;11.</bibl>
<bibl n="28">Heinrich Zimmer (ed. &amp; trans.) Aided Derb Fhorgaill, Zeitschrift f&uuml;r deutsches Alterthum 32 (1888) 217&ndash;219.</bibl>
<bibl n="29">Heinrich Zimmer (ed. &amp; trans.) Keltische Beitr&auml;ge 1, Zeitschrift f&uuml;r deutsches Alterthum 32 (1888) 220&ndash;228.</bibl>
<bibl n="30">William. M. Hennessy (ed. &amp; trans.) Mesca Ulad, Todd Lecture Series 1 (Dublin 1889).</bibl>
<bibl n="31">Ernst Windisch (ed.) De Chophur in d&aacute; muccida, Irische Texte, Ser. III.1 (Leipzig 1891) 230&ndash;77.</bibl>
<bibl n="32">Rudolf Thurneysen (ed.) Mittelirische Verslehren, in Irische Texte Ser. III. (Leipzig 1891) 32&ndash;33, 35&ndash;36, 57&ndash;59, 61&ndash;63, 70&ndash;71.</bibl>
<bibl n="33">Bartholomew MacCarthy (ed. &amp; trans.) H&eacute;riu ard inis na rr&iacute;g, in: Codex Palatino-Vaticanus, Todd Lecture Series 3 (Dublin 1892) 142&ndash;213.</bibl>
<bibl n="34">Edmund Hogan (ed. &amp; trans.) Cath Ruis na R&iacute;g for B&oacute;inn, Todd Lecture Series 4 (Dublin 1892) 1&ndash;59.</bibl>
<bibl n="35">Standish Hayes O'Grady (ed.) The Boroma, in: idem (ed.) Silva Gadelica, vol. 1 (London 1892) 359&ndash;90.</bibl>
<bibl n="36">Standish Hayes O'Grady (ed.) Silva Gadelica, vol. 2 (London 1892) 467&ndash;468, 471, 477, 478&ndash;482, 485&ndash;486, 490, 513, 516, 523&ndash;534, 539 [Prose dindshenchas].</bibl>
<bibl n="37">Kuno Meyer (ed.) Fingal R&oacute;n&aacute;in, Revue Celtique 13 (1892) 368&ndash;97.</bibl>
<bibl n="38">Whitley Stokes (ed.) The Boroma, Revue Celtique 13 (1892) 32&ndash;124.</bibl>
<bibl n="39">Whitley Stokes (ed.) The Battle of Mag Mucrime, Revue Celtique 13 (1892) 426&ndash;74.</bibl>
<bibl n="40">Whitley Stokes (ed.) The Violent Deaths of Goll and Garb, Revue Celtique 14 (1893) 396&ndash;449.</bibl>
<bibl n="41">E&oacute;in Mac Neill (ed. &amp; trans.), Three poems relating to the Battle of Mucrama, in Proceedings of the Royal Irish Academy, 3 Ser. (1895) 540&ndash;553.</bibl>
<bibl n="42">Ernst Windisch (ed.) Tochmarc Ferbe, Irische Texte, Ser. III.2 (Leipzig 1897) 445&ndash;548.</bibl>
<bibl n="43">Eleanor Hull (ed.) The intoxication of the Ultonians, in: idem (ed.) The Cuchullin Saga in Irish literature (London 1898).</bibl>
<bibl n="44">Kuno Meyer (ed. &amp; trans.) The song of the sword of Cerball, Revue Celtique 20 (1899) 7&ndash;12.</bibl>
<bibl n="45">Georges Dottin (ed. &amp; trans.) Les deux chagrins du royaume du ciel Revue Celtique 21 (1900) 349&ndash;387.</bibl>
<bibl n="46">T. O. Russell (ed.) An bhoramha Laighean, or, The Leinster tribute (Dublin 1901).</bibl>
<bibl n="47">Whitley Stokes (ed.) The Destruction of Dind R&iacute;g, Zeitschrift f&uuml;r Celtische Philologie 3 (1901) 1&ndash;14.</bibl>
<bibl n="48">A. H. Leahy (trans.) The Courtship of Ferb: an old Irish romance transcribed in the twelfth Century into the Book of Leinster translated into English prose and verse (London 1902).</bibl>
<bibl n="49">Whitley Stokes (ed. &amp; trans.) On the deaths of some Irish heroes, Revue Celtique 23 (1902) 303&ndash;48, 438; 27 (1906) 202.</bibl>
<bibl n="50">Whitley Stokes (ed.) The Songs of Buchet's House, Revue Celtique 25 (1904) 18&ndash;39.</bibl>
<bibl n="51">Ernst Windisch (ed.) Die altirische Heldensage T&aacute;in B&oacute; C&uacute;alnge nach dem Buch von Leinster, Gedruckt mit Unterst&uuml;tzung der K&ouml;nigl. s&auml;chsischen Gesellschaft der Wissenschaften (Leipzig 1905).</bibl>
<bibl n="52">Whitley Stokes (ed.) The Colloquy of the Two Sages, Revue Celtique 26 (1905) 4&ndash;64.</bibl>
<bibl n="53">Kuno Meyer (ed.) The Death&ndash;Tales of the Ulster Heroes (Dublin 1906 repr. 1993) 24&ndash;31.</bibl>
<bibl n="54">Kuno Meyer (ed. &amp; trans.) A poem by Dall&aacute;n mc More, Revue Celtique 29 (1908) 210&ndash;214.</bibl>
<bibl n="55">Whitley Stokes (ed.) Tidings of Conchobar mac Nessa, &Eacute;riu 4 (1908) 1&ndash;38.</bibl>
<bibl n="56">Kuno Meyer (ed. &amp; trans.) Tecosca Cormaic: The instructions of Cormac Mac Airt, Todd Lecture Series 15 (Dublin 1909)</bibl>
<bibl n="57">Kuno Meyer (ed. &amp; trans.) Fianaigecht, Todd Lecture Series 16 (Dublin 1910) 46&ndash;51. Available on CELT: G303018 (edition) and T303018 (English translation).</bibl>
<bibl n="58">Carl Marstrander (ed.) The deaths of Lugaid and Derbforgaill, &Eacute;riu 5 (1911) 201&ndash;18.</bibl>
<bibl n="59">Lucius Gwynn (ed.) De Maccaib Conaire, &Eacute;riu 6 (1912) 144&ndash;53.</bibl>
<bibl n="60">Kuno Meyer (ed. &amp; trans.) Hail Brigit, Zeitschrift f&uuml;r Celtische Philologie 8 (1912) 612.</bibl>
<bibl n="61">Tadhg O'Donoghue (ed. &amp; trans.) The O'Conor Don MS, in: Osborn Bergin and Carl Marstrander (eds.) Miscellany presented to Kuno Meyer by some of his friends and pupils on the occasion of his appointment to the chair of Celtic philology in the University of Berlin (Halle 1912) 258&ndash;277.</bibl>
<bibl n="62">T. P. O'Nolan (ed.) M&oacute;r of Munster and the tragic fate of Cuanu son of Cailchin, in Proceedings of the Royal Irish Academy 30, section C (1912&ndash;13) 261&ndash;82.</bibl>
<bibl n="63">E&oacute;in Mac Neill (ed. &amp; trans.) Poems attributed to Flann Mainistrech, Archivium Hibernicum 2 (1913) 48&ndash;99.</bibl>
<bibl n="64">Joseph Dunn (trans.) The ancient epic tale T&aacute;in B&oacute; C&uacute;alnge, the C&uacute;alnge Cattle-raid (London 1914).</bibl>
<bibl n="65">Kuno Meyer (ed.) The Guesting of Athirne, &Eacute;riu 7 (1914) 1&ndash;9.</bibl>
<bibl n="66">W. R. Owen (ed. &amp; trans.) Tuathal Techtmar ocus r&iacute;ge na h&Eacute;ireann, Ivernian Society Journal 7 (1915) 147&ndash;155.</bibl>
<bibl n="67">Paul Walsh (ed. &amp; trans.) A poem on Ireland, &Eacute;riu 8 (1915) 64&ndash;74.</bibl>
<bibl n="68">Kuno Meyer (ed. &amp; trans.) Masu de chlaind Echdach aird, Zeitschrift f&uuml;r Celtische Philologie 11 (1916) 107&ndash;113.</bibl>
<bibl n="69">Tom Peete Cross (ed. &amp; trans.) Laegaire mac Crimthann's visit to Fairyland, Modern Philology 13 (1916) 731&ndash;9.</bibl>
<bibl n="70">Rudolf Thurneysen (ed. &amp; trans.) Morands F&uuml;rstenspiegel, Zeitschrift f&uuml;r Celtische Philologie 11 (1916&ndash;17) 56&ndash;106, 212, 308.</bibl>
<bibl n="71">George Calder (ed.) Auraicept na n-&Eacute;ces: the scholars' primer [includes text of the Trefhocul from LL] (Edinburgh 1917) 258&ndash;269.</bibl>
<bibl n="72">Kuno Meyer (ed.) Mitteilungen, Zeitschrift f&uuml;r Celtische Philologie 12 (1918) 377&ndash;379.</bibl>
<bibl n="73">Kuno Meyer (ed. &amp; trans.) C&uacute; Chorb and Echu Find F&uacute;ath nAirt, Zeitschrift f&uuml;r Celtische Philologie 12 (1918) 435&ndash;8.</bibl>
<bibl n="74">Rudolf Thurneysen (ed. &amp; trans.) Zeitschrift f&uuml;r Celtische Philologie 12 (1918) 271&ndash;280.</bibl>
<bibl n="75">Rudolf Thurneysen (ed. &amp; trans.) Morand und sein 's&iacute;n', Zur keltischen Literatur und Grammatik, Zeitschrift f&uuml;r Celtische Philologie 12 (1918) 271&ndash;280.</bibl>
<bibl n="76">Tadhg O'Donoghue (ed. &amp; trans.) Advice to a prince, &Eacute;riu 9 (1921) 43&ndash;54.</bibl>
<bibl n="77">Rudolf Thurneysen, Ailiu &iacute;ath nhErend, Zeitschrift f&uuml;r Celtische Philologie 17 (1928) 270.</bibl>
<bibl n="78">Rudolf Thurneysen, Zu Auraicept na n-&Eacute;ces, Zeitschrift f&uuml;r Celtische Philologie 17 (1928) 290&ndash;303; 19 (1932) 128.</bibl>
<bibl n="79">Margaret E. Dobbs (ed. &amp; trans.) The Ban-shenchus, Revue Celtique 67 (1930) 282&ndash;339. </bibl>
<bibl n="80">Vernam Hull (ed.) The cause of the Exile of Fergus mac Roig, Zeitschrift f&uuml;r Celtische Philologie 18 (1930) 293&ndash;8.</bibl>
<bibl n="81">Richard Irvine Best and Hugh Jackson Lawlor (eds. and trans.) The Martyrology of Tallaght: from the Book of Leinster and MS. 5100&ndash;4 in the Royal Library, Brussels, with introduction, translations, notes and indices (London 1931).</bibl>
<bibl n="82">Vernam Hull (ed.) De Gab&aacute;il in t-S&iacute;da, Zeitschrift f&uuml;r Celtische Philologie 19 (1931) 53&ndash;8.</bibl>
<bibl n="83">Mary E. Byrne and Myles Dillon (eds.) T&aacute;in B&oacute; Fraich (Dublin 1933).</bibl>
<bibl n="84">Rudolf Thurneysen (ed.) Sc&eacute;la Mucce meic Dath&oacute; (Dublin 1935, repr. 1975).</bibl>
<bibl n="85">Paul Grosjean (ed.) Hagiographica celtica, Analecta Bollandiana 55 (1937) 96&ndash;108, 284&ndash;99.</bibl>
<bibl n="86">J. Carmichael Watson (trans.) Mesca Ulad, Scottish Gaelic Studies 5 (1938) 1&ndash;34.</bibl>
<bibl n="87">Vernam Hull (ed.) Aided Meidbe: The violent death of Medb, Speculum 13 (1938) 52&ndash;61.</bibl>
<bibl n="88">R. A. S. Macalister (ed. &amp; trans.) Leb&oacute;r Gab&aacute;la: The Book of the Taking of Ireland (Dublin: ITS 1938&ndash;41) Part I&ndash;IV.</bibl>
<bibl n="89">Vernam Hull (ed.) The Exile of Conall Corc, Publications of the Modern Language Association of America 56 (1941) 937&ndash;50.</bibl>
<bibl n="90">Kenneth Jackson (ed. &amp; trans.) The Adventure of Laeghaire mac Crimthainn, Speculum 17 (1942) 377&ndash;89. </bibl>
<bibl n="91">Myles Dillon (ed. &amp; trans.) The Yew of the disputing sons, &Eacute;riu 14 (1946) 154&ndash;65.</bibl>
<bibl n="92">Margaret E. Dobbs (ed.) Agallamh Leborchaim, &Eacute;tudes Celtiques 5 (1949/51) 154&ndash;61. </bibl>
<bibl n="93">Vernam Hull (ed. &amp; trans.) Longes mac nUislenn: The Exile of the sons of Uisliu (London 1949).</bibl>
<bibl n="94">T. F. O'Rahilly (ed.) C&uacute;&aacute;n Ua Lothch&aacute;in and Corcr&aacute;n Cl&eacute;rech, Celtica 1 (1950) 313&ndash;7. </bibl>
<bibl n="95">Margaret E. Dobbs (ed. &amp; trans.) On the graves of Leinster men, Zeitschrift f&uuml;r Celtische Philologie 24 (1954) 139&ndash;53.</bibl>
<bibl n="96">David Greene (ed.) Fingal R&oacute;n&aacute;in, in: idem (ed.) Fingal R&oacute;n&aacute;in and other stories (Dublin: D.I.A.S. 1955) 1&ndash;15.</bibl>
<bibl n="97">David Greene (ed.) Orgain Denna R&iacute;g, in: idem (ed.) Fingal R&oacute;n&aacute;in and other stories (Dublin: D.I.A.S. 1955) 16&ndash;26.</bibl>
<bibl n="98">David Greene (ed.) Esnada tige Buchet, in: idem (ed.) Fingal R&oacute;n&aacute;in and other stories (Dublin: D.I.A.S. 1955) 27&ndash;44.</bibl>
<bibl n="99">Gerard Murphy (ed. &amp; trans.) A ben, bennacht fort&mdash;n&aacute; r&aacute;id! By Dani&eacute;l ua L&iacute;athaiti, in: Early Irish lyrics: eighth to twelfth century (Oxford 1956) 6&ndash;9. </bibl>
<bibl n="100">Christian J. Guyonvarc'h (trans.) La Mort violente de Celtchar fils d'Uthechar, Ogam 10 (1958) 371&ndash;80.</bibl>
<bibl n="101">Christian J. Guyonvarc'h (trans.) Le Meurtre de Conchobar, Ogam 10 (1958) 129&ndash;38.</bibl>
<bibl n="102">Christian J. Guyonvarc'h (trans.) La Naissance de Conchobar. Version A, Ogam 11 (1959) 56&ndash;65. </bibl>
<bibl n="103">Christian J. Guyonvarc'h (trans.) Les exploits d'enfance de Cuchulainn, d'apr&egrave;s la version du T&aacute;in b&oacute; Cualnge du Livre de Leinster, Ogam 11 (1959) 206&ndash;15, 325&ndash;35.</bibl>
<bibl n="104">Paul Grosjean (ed. &amp; trans.) Deux textes in&eacute;dits sur S. Ibar, Analecta Bollandiana 77 (1959) 426&ndash;50.</bibl>
<bibl n="105">Christian J. Guyonvarc'h (trans.) L'ivresse des Ulates, Ogam 12 (1960) 487&ndash;506; 13 (1961) 343&ndash;360.</bibl>
<bibl n="106">Myles Dillon (ed. &amp; trans.) Lebor na cert: The Book of rights (Dublin 1962 ITS vol. 46).</bibl>
<bibl n="107">M. A. O'Brien (ed.) Corpus genealogiarium Hiberniae, vol. 1 (Dublin: D.I.A.S. 1962).</bibl>
<bibl n="108">Se&aacute;n S. &Oacute; Conghaile (ed.) Is &oacute;r nglan, is n&eacute;m im gr&eacute;in, in: idem (ed.) R&iacute; na n-uile: Liric&iacute; diaga a cumadh idir an 9&uacute; agus an 12&uacute; c&eacute;ad (Baile &Aacute;tha Cliath 1964) 64&ndash;7.</bibl>
<bibl n="109">M&aacute;ir&iacute;n O'Daly (ed. &amp; trans.) Beir mo sc&iacute;ath, sceo fri &uacute;ath, &Eacute;riu 20 (1966) 191&ndash;201.</bibl>
<bibl n="110">David Greene and Frank O'Connor (eds. and trans.) R&aacute;ithe f&oacute; foiss fogamar, in: A golden treasury of Irish poetry, A.D. 600 to 1200 (London 1967) 140&ndash;3.</bibl>
<bibl n="111">David Greene and Frank O'Connor (eds. and trans.) Cluiche c&aacute;ch, ca&iacute;ne c&aacute;ch, in: A golden treasury of Irish poetry, A.D. 600 to 1200 (London 1967) 174&ndash;175.</bibl>
<bibl n="112">David Greene and Frank O'Connor (eds. and trans.) Men and women, in: A golden treasury of Irish poetry, A.D. 600 to 1200 (London 1967) 202&ndash;204.</bibl>
<bibl n="113">Gear&oacute;id S. Mac Eoin (ed.) Ein Text von Togail Tro&iacute;, Zeitschrift f&uuml;r Celtische Philologie 30 (1967) 42&ndash;70.</bibl>
<bibl n="114">Wolfgang Meid (ed.) T&aacute;in b&oacute; Fra&iacute;ch (Dublin: D.I.A.S. 1967).</bibl>
<bibl n="115">Cecile O'Rahilly (ed. &amp; trans.) T&aacute;in b&oacute; C&uacute;alnge from the Book of Leinster, (Dublin: D.I.A.S. 1967, repr. 1970).</bibl>
<bibl n="116">M&aacute;ir&iacute;n O'Daly (ed. &amp; trans.) &Uacute;ar in lathe do Lum Laine, in: James Carney and David Greene (eds.) Celtic studies: Essays in memory of Angus Matheson (1912&ndash;1962) (London 1968) 99&ndash;108.</bibl>
<bibl n="117">Anne O'Sullivan (ed. &amp; trans.) The O'Moore poems in the book of Leinster, Celtica 8 (1968) 182&ndash;6.</bibl>
<bibl n="118">H. P. A. Oskamp (ed. &amp; trans.) Mochen, mochen, a Br&eacute;naind. By M&aacute;el &Iacute;su &Oacute; Brolch&aacute;n, &Eacute;igse 13 (1969/70) 92&ndash;8. </bibl>
<bibl n="119">Wolfgang Meid (trans.) Die Romanze von Froech und Findabair (Innsbruck 1970).</bibl>
<bibl n="120">Vernam Hull (ed.) Four Old-Irish songs of summer and winter, Celtica 9 (1971) 200&ndash;1.</bibl>
<bibl n="121">M&aacute;ir&iacute;n O'Daly (ed.) Cath Maige Mucrama (Dublin 1975) 38&ndash;63.</bibl>
<bibl n="122">Fergus Kelly (ed. &amp; trans.) Audacht Morainn (Dublin: D.I.A.S. 1976).</bibl>
<bibl n="123">Ulrike Roider (ed.) De Chophur in da Muccida (Innsbruck 1979).</bibl>
<bibl n="124">Jeffrey Gantz (trans.) The intoxication of the Ulaid, in: idem (ed.) Early Irish Myths and Sagas (London 1981) 188&ndash;217.</bibl>
<bibl n="125">Edward Gwynn (ed.) The Metrical Dindshenchas, 5 vols. (Dublin repr. 1991). (Available on CELT.)</bibl>
<bibl n="126">Kevin Murray (ed.) The Finding of the T&aacute;in, Cambrian Medieval Celtic Studies 41 (2001) 17&ndash;23.</bibl>
</listBibl>
<listBibl>
<head>Secondary literature</head>
<bibl n="1">Brian O'Looney, On the Book of Leinster and its contents, Royal Irish Academy Proceedings, 2 Ser. I. (1877) 367&ndash;81.</bibl>
<bibl n="2">Heinrich Zimmer, Deutsche Literaturzeitung II. 270&ndash;1 (1881).</bibl>
<bibl n="3">Max Nettlau, The Fer Diad episode of the T&aacute;in B&oacute; C&uacute;ailnge LL 82a 21&ndash;88b 52, Revue Celtique 10 (1889) 330&ndash;346; 11 (1890) 23&ndash;32; 318&ndash;343.</bibl>
<bibl n="4">Edmund Crosby Quiggin, Die lautliche Geltung der vortonigen W&ouml;rter und Silben in der Book of Leinster version der T&aacute;in B&oacute; Cualnge (Greifswald 1900).</bibl>
<bibl n="5">Kuno Meyer, Die Zuverl&auml;ssigkeit des Faksimiles von LL, Zeitschrift f&uuml;r Celtische Philologie 8 (1910) 181&ndash;2.</bibl>
<bibl n="6">Lucius Gwynn, Leabhar gabh&aacute;la and the Book of Leinster, &Eacute;riu 8 (1916) 114&ndash;16.</bibl>
<bibl n="7">Rudolf Thurneysen (ed.) Die irische Helden- und K&ouml;nigsage bis zum siebzehnten Jahrhundert (Halle 1921).</bibl>
<bibl n="8">&Aacute;ine de Paor, The common authorship of some Book of Leinster texts, &Eacute;riu 9 (1923) 118&ndash;146.</bibl>
<bibl n="9">R. M. Smith, The speculum principum in early Irish literature, Speculum 2 (1927) 411&ndash;445.</bibl>
<bibl n="10">Rudolf Thurneysen, Die drei Kinder, die gleich nach ihrer Geburt sprachen, Zeitschrift f&uuml;r Celtische Philologie 20 (1936) 192&ndash;200.</bibl>
<bibl n="11">Vernam E. Hull, A collation of two tales in the Book of Leinster, Zeitschrift f&uuml;r Celtische Philologie 19 (1933) 161&ndash;62 PMLA 56 (1941) 937&ndash;50.</bibl>
<bibl n="12">M&aacute;ir&iacute;n O'Daly, The verbal system of the LL T&aacute;in, &Eacute;riu 14 (1946) 31&ndash;139.</bibl>
<bibl n="13">Review of The Book of Leinster, vol. 1, Francis Shaw, Studies 45 (1956) 111&ndash;3.</bibl>
<bibl n="14">Aubrey Gwynn, Some notes on the history of the Book of Leinster, Celtica 5 (1960) 8&ndash;12.</bibl>
<bibl n="15">Review of Some notes on the history of the Book of Leinster, Brian &Oacute; Cu&iacute;v, &Eacute;igse 10 (1962/63) 263.</bibl>
<bibl n="16">William O'Sullivan, Notes on the scripts and make-up of the Book of Leinster, Celtica 7 (1966) 1&ndash;31.</bibl>
<bibl n="17">Review of The book of Leinster, vol. 4, Brian &Oacute; Cu&iacute;v, &Eacute;igse 11 (1964/66) 297&ndash;8.</bibl>
<bibl n="18">Cecile O'Rahilly, The preverb con- (co n-) in the LL T&aacute;in, &Eacute;riu 20 (1966) 104&ndash;11.</bibl>
<bibl n="19">Review of The book of Leinster, vol. 5, Tom&aacute;s &Oacute; Concheanainn, &Eacute;igse 12 (1967/68) 240&ndash;4.</bibl>
<bibl n="20">Cecile O'Rahilly, 'ciarso (carsa), ciarsat' in LL, Celtica 7 (1966) 38&ndash;42.</bibl>
<bibl n="21">D. Dilts Swartz, Repetition in the Book of Leinster T&aacute;in B&oacute; C&uacute;ailnge and in neo&ndash;classical rhetoric, Proceedings of the Harvard Celtic Colloquium 5 (1984) 128&ndash;146.</bibl>
<bibl n="22">D. Dilts Swartz, The problem of classical influence in the Book of Leinster T&aacute;in B&oacute; C&uacute;ailnge: significant parallels with twelfth-century neo-classical rhetoric, Proceedings of the Harvard Celtic Colloquium 6 (1986) 96&ndash;125.</bibl>
<bibl n="23">Erich Poppe, The genealogy of &Eacute;m&iacute;n(e) in the Book of Leinster, &Eacute;riu 40 (1989) 93&ndash;97.</bibl>
<bibl n="24">Norbert Backhaus, The structure of the list of Remsc&eacute;la T&aacute;na B&oacute; C&uacute;algni in the Book of Leinster, Cambridge Medieval Studies 19 (1990) 19&ndash;26.</bibl>
<bibl n="25">U&aacute;it&eacute;ar Mac Gearailt, The language of some late Middle Irish texts in the Book of Leinster, Studia Hibernica 26 (1993) 167&ndash;216.</bibl>
<bibl n="26">U&aacute;it&eacute;ar Mac Gearailt, Infixed and independent pronouns in the LL text of T&aacute;in B&oacute; C&uacute;ailgne, Zeitschrift f&uuml;r Celtische Philologie 49&ndash;50 (1997&ndash;98) 494&ndash;515.</bibl>
<bibl n="27">P&aacute;draig &Oacute; N&eacute;ill, The Latin colophon to the 'T&aacute;in B&oacute; C&uacute;ailnge' in the Book of Leinster: a critical view of Old Irish literature, Celtica 23 (1999) 269&ndash;275.</bibl>
<bibl n="28">Edel Bhreathnach, Two contributors to the Book of Leinster: Bishop Finn of Kildare and Gilla na N&aacute;em &Uacute;a Duinn, Michael Richter and Jean-Michel Picard (eds.) Ogma: essays in Celtic studies in honour of Pr&oacute;ins&eacute;as N&iacute; Chath&aacute;in (Dublin 2002) 105&ndash;11.</bibl>
<bibl n="29">Gerald Manning (ed.) The later marginalia in the Book of Leinster, Celtica 24 (2003) 213&ndash;22.</bibl>
<bibl n="30">Michael Slavin (ed.) The ancient books of Ireland (Dublin   2005).</bibl>
</listBibl>
<listBibl>
<head>The edition used in the digital edition</head>
<biblFull>
<titleStmt>
<title level="m">Book of Leinster, formerly Lebar na Núachongb&aacute;la</title>
<editor>R. I. Best, Osborn Bergin</editor>
</titleStmt>
<editionStmt>
<edition>first edition</edition>
</editionStmt>
<extent>xi + 209 pp. 2 pls. (MS facss.)</extent>
<publicationStmt>
<publisher>Dublin Institute For Advanced Studies</publisher>
<pubPlace>Dublin</pubPlace>
<date>1956</date>
</publicationStmt>
</biblFull>
</listBibl>
</sourceDesc>
</fileDesc>
<encodingDesc>
<projectDesc>
<p>CELT: Corpus of Electronic Texts</p>
</projectDesc>
<samplingDecl>
<p>The present text represents pages 400&ndash;470 of the volume. The text of T&aacute;in B&oacute; C&uacute;ailnge is available in a separate CELT file and has been omitted here. Editorial introduction, notes and indexes have also been omitted. Missing text supplied by the editor is tagged <emph>sup</emph>. Expansions to the text are marked <emph>ex</emph>.</p>
</samplingDecl>
<editorialDecl>
<correction status="medium">
<p>Text has been checked and proofread twice. All corrections and supplied text are tagged.</p>
</correction>
<normalization>
<p>The electronic text represents the edited text.</p>
</normalization>
<hyphenation>
<p>Soft hyphens are silently removed.</p>
</hyphenation>
<segmentation>
<p><emph>div0</emph>=the whole document; <emph>div1</emph>=the section; stanzas are marked <emph>lg</emph>.</p>
</segmentation>
<interpretation>
<p>Names of persons (given names), and places are not tagged. Terms for cultural and social roles are not tagged.</p>
</interpretation>
</editorialDecl>
<refsDecl>
<state gi="div1" freq="1" label="section" unit="number"/>
</refsDecl>
</encodingDesc>
<profileDesc>
<creation>By Irish scribes in monastic scriptoria, based on older materials.
<dateRange from="1150" to="1190" exact="none">1150&ndash;1190</dateRange></creation>
<langUsage> 
<language id="ga">The text is in Middle Irish.</language>
</langUsage>
<textClass>
<keywords>
<term>saga</term>
<term>histor</term>
<term>genealogy</term>
<term>prose</term>
<term>poetry</term>
<term>medieval</term>
<term>codex</term>
</keywords>
</textClass>
</profileDesc>
<revisionDesc>
<change>
<date>2011-02-01</date>
<respStmt>
<name>Beatrix F&auml;rber</name>
<resp>ed.</resp>
</respStmt>
<item>New wordcount made.</item>
</change>
<change>
<date>2008-09-01</date>
<respStmt>
<name>Beatrix F&auml;rber</name>
<resp>ed.</resp>
</respStmt>
<item>Keywords added; file validated.</item>
</change>
<change>
<date>2008-07-25</date>
<respStmt>
<name>Beatrix F&auml;rber</name>
<resp>ed.</resp>
</respStmt>
<item>Value of div0 "type" attribute modified, content of 'langUsage' checked; minor modifications made to header.</item>
</change>
<change>
<date>2006-02-15</date>
<respStmt>
<name>Benjamin Hazard</name>
<resp>ed.</resp>
</respStmt>
<item>Bibliography compiled and file re-parsed.</item>
</change>
<change>
<date>2006-01-31</date>
<respStmt>
<name>Benjamin Hazard</name>
<resp>ed.</resp>
</respStmt>
<item>File parsed.</item>
</change>
<change>
<date>2006-01-30</date>
 <respStmt>
<name>Benjamin Hazard</name>
<resp>ed.</resp>
</respStmt>
<item>File proofed (2); markup adapted; more structural and content markup applied to file, header inserted from companion file.</item>
</change>
<change>
<date>2005-04-10</date>
<respStmt>
<name>Caoimh&iacute;n &Oacute; Domhnaill</name>
<resp>ed.</resp>
</respStmt>
<item>File proofed (1)</item>
</change>
<change>
<date>2005</date>
<respStmt>
<name>Data capture company</name>
<resp>capture</resp>
</respStmt>
<item>File captured, basic xml markup applied.</item>
</change>
</revisionDesc>
</teiHeader>
<text n="G800011B">
<body>
<div0 type="codex" lang="ga"> 
<pb n="400"/>
 <div1 type="section" n="1">
<head><sup resp="BBE">Sc&eacute;la Chonchobuir</sup></head>

<p><mls unit="MS folio" n="106a"/>Ropo &fdot;er amra airegda inti C<ex>on</ex>ch<ex>obor</ex> m<ex>ac</ex> Nessa Imr&aacute;t<ex>er</ex><lb n="12421"/> sunda for Ultaib. O m&aacute;thair ro hainmniged .i. Ness ingen<!--</lb>--> Echach Salbu<ex>di</ex> r&iacute;g Muman a mathairseom in Chonch<ex>obuir</ex>.<!--</lb>--> <mls unit="MS folio" n="106a 5"/> Is airi da<ex>no</ex> ro ainmnigside Ness .i. B&aacute;tar da aiti d&eacute;c oc&aacute; haltrom<!--</lb>--> inna hingeni do r&eacute;ir Echach. Assa a ainmsi leosom i tossuch ar <lb n="12425"/> ba hurussa a haltram. Fennid amnas i nHer<ex>ind</ex> in tansin .i.<!--</lb>--> Cathbad m<ex>ac</ex> Rossa a ainm. Sech ba druis<ex>id</ex>e ba f&eacute;nnid. Luidside<!--</lb>--> <mls unit="MS folio" n="106a 10"/> d&imacr; cuaird f&eacute;nnidechta hi cr&iacute;cha Muman. Iss <ex>ed</ex> doralaside cona<!--</lb>--> &fdot;&eacute;in do thig a haitisi .i. ingine Ech<ex>ach</ex>. Orta leis issind oenaidchi<!--</lb>--> a da haite d&eacute;c na ingine. &ampersir; nicon fess cia ro ort in n-orggain. <lb n="12430"/></p>

<p>Luid iar<ex>um</ex> iar suidiu ind ingen for fennidecht &ampersir; gab<ex>ais</ex> gaisced. &ampersir;<!--</lb>--> <mls unit="MS folio" n="106a 15"/> luide trib nonbaraib fo Herind. co ffessed nech ro marb a haiteda.<!--</lb>--> &ampersir; ro chr&iacute;n na t&uacute;atha. Is cumma nos cr&iacute;nad uili daig ni fit<ex>ir</ex><!--</lb>--> sainriuth a bidbada. Ni hassa bith fria fodechtsa ol c&aacute;ch. Is<!--</lb>--> desin ro bo&iacute; N&iacute; hassa fuirri. Luidsi d&imacr; for fiannas i cocrich nUlad. <lb n="12435"/> <mls unit="MS folio" n="106a 20"/> Luidsi laa and d&imacr; a hoenur dia fothrucud. Conid tecma&ndot;g cucci<!--</lb>--> in fennid c&eacute;tna .i. int&iacute; Cathb<ex>ad</ex>. C<ex>o</ex> tudchaidside et<ex>ur</ex>ru &ampersir; c<ex>r</ex>anna<!--</lb>--> &ampersir; ardagaib. Co 'mmanarnaic d&oacute;ib. &ampersir; co mba&iacute;si do mna&iacute; gradaigthe<!--</lb>--> ocosom. &ampersir; co mbert m<ex>a</ex>c d&oacute;. Ba h&eacute; in m<ex>a</ex>c h&iacute;sin d&imacr; .i. Conch<ex>obor</ex><!--</lb>--> <mls unit="MS folio" n="106a 25"/> m<ex>ac</ex> Cath<ex>bad</ex>. Ba ca&iacute;n tra a n-orddan ro genair i suidiu .i. int&iacute; <lb n="12440"/> C<ex>on</ex>ch<ex>obor</ex>. Deithb<ex>ir</ex> s&oacute;n da<ex>no</ex> uair issind &uacute;air ro g&eacute;nair Cr<ex>ist</ex><!--</lb>--> iss and ro genairseom. Ro b&aacute;tar .uii. f&aacute;thi oca thairchetul secht<!--</lb>--> &mdot;bl<ex>iadna</ex> riana genemain. No geinfed gein n-adamra la gein<!--</lb>--> Cr<ex>ist</ex> forsin chloich ucut forsaro genair Conch<ex>obor</ex> &ampersir; ropad irdairc<!--</lb>--> a ainm i nHer<ex>ind</ex>., <lb n="12445"/></p>

<pb n="401"/>

<p><mls unit="MS folio" n="106a"/> BA m&oacute;r a n-orddan do Chonch<ex>obur</ex> hi cind .uii. &mdot;bl<ex>iadan</ex> iarna<!--</lb>--> <mls unit="MS folio" n="106a 30"/> genemain iss and ro gab r&iacute;ge &ndot;Ul<ex>ad</ex>. Ba s&iacute; a thucaits<ex>id</ex>e<!--</lb>--> .i. bo&iacute; Ness ingen Ech<ex>ach</ex> a mathairseom i n-oentama. Bo&iacute; da<ex>no</ex><!--</lb>--> <mls unit="MS folio" n="106a 35"/> Fergus m<ex>ac</ex> Rossa i rr&iacute;gu Ul<ex>ad</ex>. Adcobrastarside in mna&iacute; .i. Ness<!--</lb>--> do mna&iacute; d&oacute;. Nath&oacute; ol sisi condom rab a log .i. r&iacute;ge &mdot;bl<ex>iadna</ex> <lb n="12450"/> dom m<ex>a</ex>c. Conid tairle nocon erbarthar m<ex>a</ex>c r&iacute;g frim m<ex>a</ex>c. Tabair<!--</lb>--> ol cach &ampersir; bid lat a rrige cia cho&ndot;garthar ainm r&iacute;ge. Foid tra iar<!--</lb>--> <mls unit="MS folio" n="106a 40"/> suidiu in ben la Fergus. &ampersir; co&ndot;gairther r&iacute;ge &ndot;Ul<ex>ad</ex> do Chonch<ex>obur</ex>.<!--</lb>--> Ro gab tra in ben for tinchosc a m<ex>ei</ex>cc &ampersir; a aite &ampersir; a munt<ex>ir</ex>e .i. lomrad<!--</lb>--> indala fir &ampersir; a thidnacul diaraile. &ampersir; a h&oacute;rsi &ampersir; a hargat do thidnacul do<lb n="12455"/> aradaib Ul<ex>ad</ex> ar d&aacute;ig iartaige dia m<ex>a</ex>c.<!--</lb>--></p>

<p><mls unit="MS folio" n="106a 45"/> Tanic d&imacr; cend na ree h&iacute;sin dia bl<ex>iadna</ex>. Dorimgart i suidiu<!--</lb>--> Fergus a giallu. Immacallaim immi or Ul<ex>aid</ex>. Ro imraidsetar<!--</lb>--> i n-oend&aacute;il. Ba d&iacute;micin m&oacute;r leo Fergus dia tabairt hi tindscra.<!--</lb>--> Roptar buidig i&mmacr; do Chonch<ex>obur</ex> ara degthidnacul d&oacute;ib. Ba s&iacute; <lb n="12460"/> <mls unit="MS folio" n="106a 50"/> i&mmacr; a n-immacall<ex>am</ex> anro rir Fergus scarad d&oacute; friss. Anro chennaig<!--</lb>--> Conch<ex>obor</ex> anad aici.<!--</lb>--></p>

<p><mls unit="MS folio" n="106b"/> Iss and sin tra ro scar Fergus fri r&iacute;ge &ndot;Ul<ex>ad</ex>. &ampersir; &#x2016; iss and sin tra<!--</lb>--> ro gaired ardrige choicid Her<ex>end</ex> do Chonch<ex>obur</ex> m<ex>a</ex>c Cath<ex>bad</ex>.,<!--</lb>--></p>


<pb n="402"/>

<p><mls unit="MS folio" n="106b"/> Ba m&oacute;r ind airmitiu tra doratsat Ul<ex>aid</ex> do Chonch<ex>obur</ex>. Ba <lb n="12465"/> si a airmitiu &aacute;m leo .i. cech fer di Ultaib doberad ingin<!--</lb>--> <mls unit="MS folio" n="106b 5"/> m<ex>a</ex>cdacht a feiss la Conch<ex>obor</ex> in chetaidchi combad h&eacute; a c&eacute;tmunt<ex>er</ex>.<!--</lb>--> Ni rabai for talmain gein bad ga&iacute;thi.u. Nocho ruc breith r&iacute;am<!--</lb>--> uair nocho l&eacute;icthe do. fo b&iacute;th na rucad gubreith. napdis messaiti<!--</lb>--> a thorthi. Ni rabi da<ex>no</ex> forsin tal<ex>main</ex> caur ba tressiu. &ampersir; ni reilced <lb n="12470"/> <mls unit="MS folio" n="106b 10"/> r&iacute;am i n-eislind .i. do airichill m<ex>ei</ex>c ind r&iacute;g. No b&iacute;t&iacute;s cauraid &ampersir;<!--</lb>--> arsidi catha &ampersir; l&aacute;ith gaile ara b&eacute;laib hi cathaib &ampersir; immaircib arnabad<!--</lb>--> eslind d&oacute;. Cech fer do Ul<ex>taib</ex> dobered aidchi n-oegidechta. fess<!--</lb>--> d&oacute; lia mna&iacute;s<ex>id</ex>e in n-aidchisin.<!--</lb>--></p>

<p><mls unit="MS folio" n="106b 15"/> C&oacute;iciur ar t<ex>r</ex>ib fichtib ar .ccc. ina thegluch Conch<ex>obuir</ex> .i. a ll&iacute;n <lb n="12475"/> laa b&iacute;s issin blia<ex>dain</ex> iss &eacute; l&iacute;n fer no b&iacute;d hi tegluch Conch<ex>obuir</ex>.<!--</lb>--> Commaid i&mmacr; no b&iacute;d et<ex>ur</ex>ru. .i. fer ce<ex>ch</ex> n-aidchi dia mbiathad. Is<!--</lb>--> and i&mmacr; ticed in fer toesech in biatta in n-aidchiIsin hi cind bl<ex>iadna</ex><!--</lb>--> <mls unit="MS folio" n="106b 20"/> doridisi. Nirbo bec i&mmacr; in biathad .i. mucc &ampersir; ag &ampersir; dabach do cach<!--</lb>--> &fdot;ir. No b&iacute;tis fir is taig i&mmacr; nach faerad sain. .i. Fergus m<ex>ac</ex> Roig <lb n="12480"/> am<ex>al</ex> adfiadar. Masu &fdot;&iacute;r ba h&uacute;ais a m&eacute;it .i. in t&sdot;echta Fergusa<!--</lb>--> nibu comthi.h la nech n-aile .i. Secht traigid et<ex>er</ex>a &oacute; &ampersir; a beolo. &ampersir;<!--</lb>--> uii. n-artim et<ex>er</ex>a da &sdot;&uacute;il. &ampersir; .uii. n-ar<ex>tim</ex> na sr&oacute;in. &ampersir; uii. n-ar<ex>tim</ex><!--</lb>--> <mls unit="MS folio" n="106b 25"/> inna b&eacute;laib. L&aacute;n coid m&eacute;ich fliuchad a chind coa &fdot;olc<ex>ad</ex>. Secht<!--</lb>--> n-ar<ex>tim</ex> na luirg. Bolg m&eacute;ich ina thistu. Secht mna dia ergaire <lb n="12485"/> mani thairs<ex>ed</ex> Flidais. Secht mucca &ampersir; uii. &ndot;dabcha &ampersir; uii. n-aige<!--</lb>--> do chathim d&oacute;. &ampersir; nert .dcc. and. Ba hecen dosum d&imacr; sechtmain<!--</lb>--> <mls unit="MS folio" n="106b 30"/> do biathad in teglaich sech cach. Conch<ex>obor</ex> i&mmacr; fessin no gaibed<!--</lb>--> in samuin d&oacute;ib fo dagin t<ex>er</ex>chomraic in t&sdot;l&uacute;aig m&oacute;ir. Ba hecen<!--</lb>--> in tsochaide m&oacute;r do airichill. fo bith ce<ex>ch</ex> fer do Ul<ex>taib</ex> na tairchebad <lb n="12490"/> aidchi samna dochum nEmna. no gatta ciall de &ampersir; focherte a &fdot;ert &ampersir;<!--</lb>--> <mls unit="MS folio" n="106b 35"/> a lecht &ampersir; a lie arnabarach. Airichill m&oacute;r di for Conch<ex>obor</ex>. No<!--</lb>--> noisigthe leis na tri lae ria samain. &ampersir; na tri laa iar samain fri tomailt<!--</lb>--> i tig Conch<ex>obuir</ex>. Ba ca&iacute;n da<ex>no</ex> in tegdas. Tri tigi la Conch<ex>obor</ex><!--</lb>--> .i. in Chroebr&uacute;ad &ampersir; in T&eacute;ite Brecc. &ampersir; in Chroibderg. Issin <lb n="12495"/> <mls unit="MS folio" n="106b 40"/> Chroebdeirg. no b&iacute;tis in chennal &ampersir; na fuidb. Issin Chroebruaid<!--</lb>--> i&mmacr; no bit&iacute;s na rr&iacute;g .i. ba r&uacute;ad dono r&iacute;gaib. Isin Teiti Bricc da<ex>no</ex><!--</lb>--> no b&iacute;tis na gae &ampersir; na sc&eacute;ith &ampersir; na claidib .i. ba brecc do imdornchoraib<!--</lb>--> <mls unit="MS folio" n="106b 45"/> na claideb n-orduirn. &ampersir; do chainnlig na &ndot;glasgae cona muncib &ampersir;<!--</lb>--> cona fithib &oacute;ir &ampersir; arg<ex>ait</ex> &ampersir; do lannaib &ampersir; imthimchellaib na &sdot;c&iacute;ath <lb n="12500"/> di &oacute;r &ampersir; argut. &ampersir; do intindrim da<ex>no</ex> na n-escra &ampersir; na corn &ampersir; na<!--</lb>--> mbaiglend.<!--</lb>--></p>

<p>Is airi no b<ex>er</ex>t&iacute;s a n-arma uadib i n-oentech. Cech n&iacute; gargg<!--</lb>--></p>

<pb n="403"/>

<p><mls unit="MS folio" n="106b 50"/> rochluint&iacute;s mani roist&iacute;s d&iacute;gail fair fo chet&oacute;ir. Atraiged ce<ex>ch</ex> fer<!--</lb>--> <mls unit="MS folio" n="107a"/>	dialailiu combid cach d&iacute;b oc tuarcain a chind &ampersir; a sc&eacute;ith &#x2016; for a <lb n="12505"/> cheiliu sethn&oacute;n in taige. co mb<ex>er</ex>tis a n-arma uadib uile isin Teite<!--</lb>--> &mdot;Brecc. Ind Ochoin Chonchob<ex>uir</ex> and .i. sciath Conch<ex>obuir</ex>.<!--</lb>--> cethri imle &oacute;ir impe. &ampersir; Fuban Con Cul<ex>aind</ex>. &ampersir; Lamthapad Conaill<!--</lb>--> C<ex>hernaig</ex>. &ampersir; ind &Oacute;chnech &Fdot;lidais. &ampersir; ind Orderg &Fdot;urbaide. &ampersir; in<!--</lb>--> <mls unit="MS folio" n="107a 5"/> Choscrach Causcraid. &ampersir; ind Echtach Amairgin. &ampersir; ind &Iacute;r Chond<ex>er</ex>e. <lb n="12510"/> &ampersir; in Chaindel Nuadat. &ampersir; ind Leochain &Fdot;ergusa. &ampersir; ind Uathach<!--</lb>--> Dubthaig. &ampersir; ind Lettach Errgi. &ampersir; in Brattach Mind. &ampersir; ind Luithech<!--</lb>--> Noisen. &ampersir; ind Nithach Loegaire. &ampersir; in Chroda Chorm<ex>ai</ex>c. &ampersir; in<!--</lb>--> <mls unit="MS folio" n="107a 10"/> Sciatharglan Senchada. &ampersir; in Chomla Chatha Cheltchair. Moo<!--</lb>--> turim da<ex>no</ex> anro bo&iacute; do sciathaib and olchena. <lb n="12515"/></p>

<p>Mor n-orddain da<ex>no</ex> &ampersir; &aacute;niusa &ampersir; alluda &ampersir; aurdarcais. in teglachsa<!--</lb>--> Conch<ex>obuir</ex>. Cenco beth do thren&fdot;eraib &ampersir; chauradaib and<!--</lb>--> chetmus. acht Fergus m<ex>ac</ex> R&oacute;ig ba l&oacute;r do chalmataid. in fer<!--</lb>--> <mls unit="MS folio" n="107a 15"/> atacomai&ndot;g na teora Formaela Mide. i cath G&aacute;rige for T&aacute;in B&oacute;<!--</lb>--> Cual<ex>nge</ex> .i. teora builli dorat forsin talmain o do&aacute;nic a &fdot;erg fri <lb n="12520"/> Conch<ex>obor</ex> co filet na tr&iacute; cnuiccsin and b&eacute;us &ampersir; merait and co br&aacute;th.<!--</lb>--> Cenco beth do gasciud and acht Conall C<ex>ernach</ex> m<ex>ac</ex> Amargin<!--</lb>--> <mls unit="MS folio" n="107a 20"/> Iar&ndot;giunnaig ba l&oacute;r fri immarb&aacute;ig .i. ond &uacute;air gab<ex>ais</ex> ga&iacute; inna<!--</lb>--> l&aacute;im ni rabi cen guin duini ce<ex>ch</ex> lai do Chon<ex>nachtaib</ex> &ampersir; argain fri<!--</lb>--> daigid ce<ex>ch</ex> n-aidchi. &ampersir; nar chotail riam cen chend Connac<ex>htaig</ex> <lb n="12525"/> foa gl&uacute;n. Ni rabi i nHer<ex>ind</ex> ferand boairig forsna rubad Conall<!--</lb>--> C<ex>ernach</ex> guin duine. Is &eacute; &aacute;m Conall C<ex>ernach</ex> ro rand muicc M<ex>ei</ex>c<!--</lb>--> <mls unit="MS folio" n="107a 25"/> Da Th&oacute; ar comram gascid ar belaib l&aacute;th gaile fer &ndot;Her<ex>end</ex>. Fer<!--</lb>--> ro diglastar Ultu for firu Her<ex>end</ex> .i. do neoch d&iacute;b ro marb<ex>ad</ex> &ampersir;<!--</lb>--> mairfith<ex>er</ex> co br&aacute;th. Fer na dechaid assa noendin o gab<ex>ais</ex> gai <lb n="12530"/> inna l&aacute;im.<!--</lb>--></p>

<p>Cenmotha da<ex>no</ex> in gill<ex>a</ex> urdairc imma n-agat fir Her<ex>end</ex> .i. Cu<!--</lb>--> <mls unit="MS folio" n="107a 30"/> Ch<ex>ulaind</ex> m<ex>ac</ex> Sualt<ex>aim</ex> m<ex>eic</ex> Becal<ex>taig</ex> m<ex>eic</ex> Moral<ex>taig</ex> m<ex>eic</ex><!--</lb>--> Umendr&uacute;aid a s&iacute;dib. &ampersir; Dolb m<ex>ac</ex> Becal<ex>taig</ex> a brath<ex>air</ex>. &ampersir; Ethne<!--</lb>--> Ingubai ben Elcmaire a s&iacute;dib. a siur. &ampersir; Dechter ingen Chathbad a <lb n="12535"/> mathair Chon Cul<ex>aind</ex> imscoich &ampersir; imacher a gn&iacute;mrad in gillai.<!--</lb>--> <mls unit="MS folio" n="107a 35"/> Ba dolig bith friss in tr&aacute;th ba fergach. Imrethitis a d&aacute; thraigid<!--</lb>--> &ampersir; a n-adbrond comt&iacute;s luathidir ruathur funemda. Na<ex>ch</ex> finna no<!--</lb>--> b&iacute;d fair ba athidir delg sciach. &ampersir; no b&iacute;d banne fola for ca<ex>ch</ex> &fdot;inna.<!--</lb>--> No theiged indala s&uacute;il ina chend. &ampersir; araile ass fot airthema. Ni <lb n="12540"/> <mls unit="MS folio" n="107a 40"/> athgned coemu na cairdiu. Cumma no &sdot;liged iarna chulaib &ampersir;<!--</lb>--> ara belaib. Sech ce<ex>ch</ex> fer i nHer<ex>ind</ex> d&oacute; a &ndot;gaisceda tuc o Sc&aacute;thaig<!--</lb>--> Buanand ingein Ardgeimme i lLetha .i. cless Caitt. &ampersir; c<ex>less</ex> Cuair. &ampersir;<!--</lb>--></p>

<pb n="404"/>

<p><mls unit="MS folio" n="107a"/> ubullchless &ampersir; faeborc<ex>hless</ex> &ampersir; faenc<ex>hless</ex> &ampersir; c<ex>less</ex> clettinech. &ampersir; tetc<ex>hless</ex><!--</lb>--> <mls unit="MS folio" n="107a 45"/> &ampersir; corpc<ex>hless</ex> &ampersir; ich n-erred. &ampersir; cor &ndot;deiled. &ampersir; l&eacute;im dar n&eacute;im. &ampersir; filliud <lb n="12545"/> erred nair. &ampersir; gai b<ex>olga</ex> &ampersir; bai brassi. &ampersir; rothchless &ampersir; &oacute;tar. &ampersir; c<ex>less</ex> for<!--</lb>--> analaib. &ampersir; bruud gine &ampersir; s&iacute;an curad. &ampersir; beim co commus &ampersir; tathb&eacute;im<!--</lb>--> &ampersir; r&eacute;im fri fogaist co ndirgud chrette fora rind co fornaidm niad.<!--</lb>--></p>

<p><mls unit="MS folio" n="107b"/> Moo t<ex>ur</ex>im i&mmacr; teglaig Conch<ex>obuir</ex>. &ampersir; t<ex>ur</ex>im a thigi. &#x2016; .i. tri choicait<!--</lb>--> <mls unit="MS folio" n="107b 51"/> imd&aacute;d is tig. &ampersir; teora lanamna in ca<ex>ch</ex> imdai. Stiall archopur do <lb n="12550"/> derggibur a teg &ampersir; na imdada. Imdai C<ex>on</ex>chob<ex>uir</ex> for l&aacute;r in taige.<!--</lb>--> Airinig creduma impe. co mbarridaib argit. &ampersir; eoin &oacute;ir forsna<!--</lb>--> <mls unit="MS folio" n="107b 5"/> hairenchaib. &ampersir; gemma do liic l&oacute;gmair it e s&uacute;li no b&iacute;tis ina cennaib.<!--</lb>--> Slatt argait uas Chonch<ex>obur</ex> &ampersir; teora ubla &oacute;ir &fdot;urri. fri tinchosc in<!--</lb>--> t&sdot;l&uacute;aig. &ampersir; in tan no chroithed no th<ex>ur</ex>cbad son a gotha fessin. no <lb n="12555"/> thoad in sluag &ampersir; ce dofaidsad snathat for lar in taige rocluinfide<!--</lb>--> <mls unit="MS folio" n="107b 10"/> lasin tu&iacute; i mb&iacute;tis ar airmitinsom. Tricha l&aacute;th &ndot;gaile i n-imdai<!--</lb>--> Chonch<ex>obuir</ex> fri &oacute;l. Ol &ndot;guala .i. dabach Geirg for l&aacute;r in tige<!--</lb>--> bithl&aacute;n. Is &iacute; thucad a Glind Gergg diar ort Gerg la Conchob<ex>or</ex>. Fer<!--</lb>--> frithalma more is taig .i. Bricriu m<ex>ac</ex> Carbada .ix. m<ex>ei</ex>c Carbada <lb n="12560"/> <mls unit="MS folio" n="107b 15"/> Uill is taig. .i. Glaine &ampersir; Gormainech. Mane Minscoth. &ampersir; Ailill Duress.<!--</lb>--> &ampersir; Ret &ampersir; Bricriu. Fer nemnech drochthengthach in Bricriu. Ba<!--</lb>--> l&oacute;r do neim d&oacute; dia &ndot;gabad forsin r&uacute;in no bid fora menmain no<!--</lb>--> &aacute;ssad bolgg corcra assa etun &ampersir; ba metithir ferdorn. Co n-apradsom<!--</lb>--> <mls unit="MS folio" n="107b 20"/> fri Conch<ex>obor</ex> mebais di<ex>n</ex> boilgg innocht a Chonch<ex>obuir</ex>. M&oacute;r tra <lb n="12565"/> do da&iacute;nib i&ndot;gantaib ro batar i taig Conch<ex>obuir</ex> fon innasain ...<!--</lb>--></p>
</div1>

<pb n="405"/>
<div1 n="2">
<head><sup resp="BBE">Aided Guill meic Carbada &ampersir; Aided Gairb Glinne Rigi</sup></head>

<p><mls unit="MS folio" n="107b"/> GEssa &ampersir; ilberta b&iacute;tis for Coin Cul<ex>aind</ex> for clothmaccaem<!--</lb>--> <mls unit="MS folio" n="107b 25"/> Croebruade. for m<ex>a</ex>c sethar Conch<ex>obuir</ex> for l&iacute;gbratanach<!--</lb>--> Line for buageltach &mdot;Breg. Batar &iacute;at a geisi. A &sdot;lonniud<!--</lb>--> do &oacute;enlaech. traig fordail di chonair ria comlund oen&fdot;ir. Comlund <lb n="12570"/> do opa do oen&fdot;ir. Techt i nd&aacute;il cen airiasacht. techt ra oenlaech<!--</lb>--> <mls unit="MS folio" n="107b 30"/> dochum dala. Feiss et<ex>er</ex> mn&aacute; cen &fdot;iru ocaib. g<ex>eiss</ex> d&oacute; commaid<!--</lb>--> la mnai. g<ex>eiss</ex> d&oacute; grian d'ergi fair i nEmain Macha acht <ex>com</ex>bad<!--</lb>--> &eacute; atressed rempe.<!--</lb>--></p>

<p>Fecht n-oen at<ex>r</ex>aacht i nEmain i tus la&iacute; ria &ndot;g<ex>r&eacute;</ex>in. Atbert fria <lb n="12575"/> araid carpait. Maith a mo phopa Laeg ar C<ex>u</ex> C<ex>hulaind</ex>. fetar<!--</lb>--> <mls unit="MS folio" n="107b 35"/> na fil it m<ex>en</ex>main ar Laeg. Cid son ar C<ex>u</ex> C<ex>hulaind</ex>. na eich do<!--</lb>--> gab<ex>ail</ex> &ampersir; in carp<ex>at</ex> do innell. ed em ar C<ex>u</ex> C<ex>hulaind</ex>. ar iss ed<!--</lb>--> ar Laeg ni toil dot gasciud iss indilti in carpat. is gabtha ind<!--</lb>--> echrad. Tair d&imacr; dit charpat. At<ex>r</ex>aaacht C<ex>u</ex> C<ex>hulaind</ex>. Cid leth <lb n="12580"/> na mochaergi ar Conch<ex>obor</ex>. Cian uad a mo phopa chaem<!--</lb>--> C<ex>on</ex>ch<ex>obuir</ex> ona lud do chur chuardda im Murthemniu. &ampersir; is digraiss<!--</lb>--> <mls unit="MS folio" n="107b 40"/> lend techt indiu. Nadba cian ind aurnaide duit a m<ex>ei</ex>c ar<!--</lb>--> Conch<ex>obor</ex>. ar is mitharba lend ca<ex>ch</ex> main &ampersir; ca<ex>ch</ex> maith it i&ndot;gnais.<!--</lb>--></p>

<p>Luid C<ex>u</ex> C<ex>hulaind</ex> dia charput iar tain. Tarblai&ndot;g na charp<ex>ut</ex> <lb n="12585"/> chobsaid chomerma. Saigis L&aacute;eg brot forin n-echraid. Snedis<!--</lb>--> <mls unit="MS folio" n="107b 45"/> slaitt i cend seta &ampersir; imthechta. Rancatar rempu co Athis Murthemni.<!--</lb>--> Maith a Laeg ar C<ex>u</ex> C<ex>hulaind</ex> is oebind in dindgnasa. Deithb<ex>ir</ex><!--</lb>--> son ar Laeg. daig is gle muir o &sdot;und. &ampersir; ro raid na bri<ex>athr</ex>a. &ampersir;<!--</lb>--> d<ex>orone</ex> laid <lb n="12590"/></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l>Oebind sund amne.<!--</lb>--></l>
<l>i fich Maige Murthemne<!--</lb>--></l>
<l>et<ex>er</ex> t&iacute;r &ampersir; Muir Mend.<!--</lb>--></l>
<l>tarpig torthig trebardrend<!--</lb>--></l></lg>

<pb n="406"/>

<lg n="2">
<l><mls unit="MS folio" n="107b 50"/> Mani anam sund amne. <lb n="12595"/></l>
<l>i foir Maige Murthemne. &#x2016;<!--</lb>--></l>
<l><mls unit="MS folio" n="108a"/> is diar &ndot;gessib cen ail<!--</lb>--></l>
<l>techt cen chomlund co hEmain.<!--</lb>--></l></lg>

<lg n="3">
<l>Ni &fdot;accasa tiactain duit.<!--</lb>--></l>
<l>a hEmain erctha carpait. <lb n="12600"/></l>
<l>do dula for cula di.<!--</lb>--></l>
<l>cen chomram doridisi.<!--</lb>--></l></lg>

<lg n="4">
<l>Arai anmait sunda tra.<!--</lb>--></l>
<l>a Laeg a m<ex>ei</ex>c Riangabra;<!--</lb>--></l>
<l><mls unit="MS folio" n="108a 5"/> co mbermais lind l&iacute;th co &ndot;gail. <lb n="12605"/></l>
<l>comram croda co hEmain.<!--</lb>--></l></lg>

<lg n="5">
<l>Ni fubai dam a laech laind.<!--</lb>--></l>
<l>olda duitsiu a Chulaind;<!--</lb>--></l>
<l>ni &fdot;uil mo thoisc armotha.<!--</lb>--></l>
<l>acht airm nodot &fdot;accursa. <lb n="12610"/></l></lg>

<lg n="6">
<l>Is airesin f&aacute;th co &ndot;gail.<!--</lb>--></l>
<l>sinsit m' eich for Cruachanmaig;<!--</lb>--></l>
<l>doriacht .l. cend lem de.<!--</lb>--></l>
<l>Emain im chenn iarnaide.<!--</lb>--></l></lg>

<lg n="7">
<l><mls unit="MS folio" n="108a 10"/> Is iarom sain fath cen ga&iacute;. <lb n="12615"/></l>
<l>ba maith in comlund oenla&iacute;;<!--</lb>--></l>
<l>tucais cen mebail c&eacute;t &ndot;gus<!--</lb>--></l>
<l>co hEmain mor d'oebinnius. Oe.<!--</lb>--></l></lg>
</body></text></p>

<p>Maith a Laeg fodail in n-echraid &ampersir; discuir in carp<ex>at</ex> ar bith<!--</lb>--> contulind mo laem cotulta. Uair is dom gessib techt co hEmain <lb n="12620"/> <mls unit="MS folio" n="108a 15"/> cen ch<ex>o</ex>mlund. Scuris Laeg in carp<ex>at</ex> &ampersir; tascrais ind echraid. Ocus<!--</lb>--> d&eacute;rgis fortgemne in carp<ex>ait</ex> foa. &ampersir; dobert fuan corcra cortharach<!--</lb>--> taris &ampersir; cendadart cl&uacute;mdaide fo chind. &ampersir; tul.is C<ex>u</ex> C<ex>hulaind</ex> a laem<!--</lb>--> cotulta. Bai Laeg ic foraire &ampersir; ic forcom&eacute;t do.<!--</lb>--></p>

<p>N&iacute;ba c&iacute;an d&oacute; ic forcomet mara &ampersir; t&iacute;ri co n-acca in curach n-adbal <lb n="12625"/> <mls unit="MS folio" n="108a 20"/> no bruinned dochum t&iacute;re. Metithir &oacute;en na prim&sdot;liab in chorr<!--</lb>--> thuisech din churuchsin. &ampersir; ba haidbliu leis. in chorr aile. Adbliu<!--</lb>--> leis co mm&oacute;r old&aacute;s gesca ralach rod&iacute;rge os &fdot;ult &fdot;idbaide in laech-<!--</lb>--></p>

<pb n="407"/>

<p><mls unit="MS folio" n="108a"/> seiss for braine in churaig. Da r&aacute;mma do iurn aithlegtha i ndib<!--</lb>--> <mls unit="MS folio" n="108a 25"/> lamaib d&oacute; ic tescad in mara immi sain chan. No rannad bledmila <lb n="12630"/> in mara immi do bressaib na ruadrama s&uacute;as i n-ardda clethi. <ex>co</ex><!--</lb>--> tuittitis i frithdrui&ndot;g na conaire cetna a dochum <ex>co m</ex>b&iacute;tis ar medon<!--</lb>--> in churaig. C<ex>o</ex> tibeds<ex>o</ex>m a ma&ndot;g&fdot;&aacute;itbiud gaire for aird impu. <ex>co</ex><!--</lb>--> <ex>n</ex>digsed tre&sdot;ess cona nirt nonbair dar ginchr&aacute;es d&oacute;. Comtar &eacute;cnaig<!--</lb>--> <mls unit="MS folio" n="108a 30"/> a thruim &ampersir; a glainene for ettegail dar commur a chraes &ampersir; a br&aacute;get. <lb n="12635"/> Samla beolo fidchuaich indara s&uacute;il d&oacute; fria chind dianechtair.<!--</lb>--> acht mod ma 'dres<ex>ed</ex> corr in t&sdot;&uacute;il anaill do ind a gr&uacute;ade. Samalta<!--</lb>--> comchubrech daim amr&iacute;ata ce<ex>ch</ex> finna sescnidi imluathi acarb sinis<!--</lb>--> <mls unit="MS folio" n="108a 35"/> tria fortrennaib a chr&uacute;adchind fri fonascad &ndot;ga&iacute;the. Ba&iacute; da<ex>no</ex><!--</lb>--> L&aacute;eg coa thuarascbail &ampersir; tairderc for aird. &ampersir; dorone in laed. <lb n="12640"/></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l>Atchiu churach dar Muir Mend.<!--</lb>--></l>
<l>ascnas i n-iathaib Her<ex>end</ex>;<!--</lb>--></l>
<l>adbal lim airdde ind ethair.<!--</lb>--></l>
<l>darin fairgge forlethain.<!--</lb>--></l></lg>

<lg n="2">
<l>Oenl&aacute;ech fil na &sdot;udi and. <lb n="12645"/></l>
<l>m&oacute; do &oacute;caib Gaedel is Gall;<!--</lb>--></l>
<l><mls unit="MS folio" n="108a 40"/> fothesc in fairgge 'male.<!--</lb>--></l>
<l>uad s&uacute;as co niulu nime.<!--</lb>--></l></lg>

<lg n="3">
<l>Oen&sdot;&uacute;il ina chiund c&eacute;im &ndot;gle.<!--</lb>--></l>
<l>meit fri coire colpthaige; <lb n="12650"/></l>
<l>in t&sdot;&uacute;il aile aidble glond.<!--</lb>--></l>
<l>ni r&oacute; corr asa chlocond.<!--</lb>--></l></lg>

<lg n="4">
<l>Sciath aca ar l&aacute;r a ethair<!--</lb>--></l>
<l>cona thugi dublethair;<!--</lb>--></l>
<l>fo tailfed dag ni g&oacute; dam. <lb n="12655"/></l>
<l>cethri drond dechenbar.<!--</lb>--></l></lg>

<lg n="5">
<l><mls unit="MS folio" n="108a 45"/> Claideb m&oacute;r dia leith deis.<!--</lb>--></l>
<l>tricha traiged no tomaiss;<!--</lb>--></l>
<l>mairg dia tibre a buille.<!--</lb>--></l>
<l>tr&aacute;th doficfa a laechluinde. <lb n="12660"/></l></lg>

<pb n="408"/>

<lg n="6">
<l><mls unit="MS folio" n="108a"/> Eirgem suas facbam in mag.<!--</lb>--></l>
<l>a Chu Ch<ex>ulaind</ex> na comram;<!--</lb>--></l>
<l>nacharthair in laech lond.<!--</lb>--></l>
<l>d&aacute;ig nad cossid a chomlond.<!--</lb>--></l></lg>

<lg n="7">
<l>Atbiur fom sc&iacute;ath scenbda tra. <lb n="12665"/></l>
<l>A Laeg a m<ex>ei</ex>c Riangabra;<!--</lb>--></l>
<l><mls unit="MS folio" n="108a 50"/> na<ex>ch</ex> fuiciub in mag met glond.<!--</lb>--></l>
<l>co fesser in me a chomlond. &#x2016;<!--</lb>--></l></lg>

<lg n="8">
<l><mls unit="MS folio" n="108b"/> Dia mbetis Ulaid malle.<!--</lb>--></l>
<l>immut a m<ex>ei</ex>c Dechtire; <lb n="12670"/></l>
<l>dosberad fo thaidbsin troch.<!--</lb>--></l>
<l>in laech atchiu sin churoch. A.<!--</lb>--></l></lg>
</body></text></p>

<p>Maith a Loeg insaig in laech n-ucut na n-iarfaig moa chr&iacute;ch<!--</lb>--> <mls unit="MS folio" n="108b 5"/> &ampersir; moa gen<ex>e</ex>l<ex>ach</ex> &ampersir; a ainm &ampersir; a atharth&iacute;r &ampersir; cia d&uacute; consaige. Luid<!--</lb>--> da<ex>no</ex> a dochum &ampersir; tarrasair forin phurt cind chomair d&oacute;. Can <lb n="12675"/> lod a m&oacute;rlaech ar Laeg. ni labair da<ex>no</ex> fri sin co L&aacute;eg. Can lod<!--</lb>--> a laech m&oacute;ir fil isin churuch ar Laeg. Niro labair beus. Atbert<!--</lb>--> <mls unit="MS folio" n="108b 10"/> Laeg in tress fecht. Can lod a laech m&oacute;ir. cia th'ainm &ampersir;<!--</lb>--> t'atharthir. c'airet imrecaim do &sdot;et. Dog&eacute;nsa mo &sdot;lo<ex>n</ex>nniud duit<!--</lb>--> ar atchiu is delb arad fort. &ampersir; m<ex>en</ex>bad sin nith&oacute;. Dena d&imacr; ar L&aacute;eg <lb n="12680"/> ar iss <ex>ed con</ex>nagam fort. Goll m<ex>ac</ex> Carbad m<ex>ac</ex> r&iacute;g na Germane<!--</lb>--> <mls unit="MS folio" n="108b 15"/> tuascertaige don domun. Triur brathar ataam .i. Goll &ampersir; Cromm<!--</lb>--> &ampersir; Rig. Ocus focherdsam crandchur immna teoraib insib .i. im<!--</lb>--> inis Bretan. im inis Danmarg. im Herind. Mo chrandsa da<ex>no</ex><!--</lb>--> taet ass ar t&uacute;s. dosb<ex>er</ex>t for Her<ex>ind</ex>. Atbiursa mo dee ar L&aacute;eg is <lb n="12685"/> <mls unit="MS folio" n="108b 20"/> c&eacute;tc<ex>r</ex>and co torud chraind dedenaig. Maith a gillai ar Goll cia<!--</lb>--> coa mb&iacute;. Cosind laech ucut arin tulaig i mmed&oacute;n in maigi ar do<!--</lb>--> chi. Cia <ex>con</ex>seiss in tulaig n-ucut ar Goll. C<ex>u</ex> C<ex>hulaind</ex> m<ex>ac</ex><!--</lb>--> Sual<ex>taim</ex> sund do &fdot;eraib Her<ex>end</ex> ar Laeg. Atchualammar in l&aacute;ech<!--</lb>--> &mdot;becsin ar Goll. r&aacute;id friss ar<ex>co</ex> t&iacute; <ex>co</ex>ragba mo chor &ampersir; mo thuarastas <lb n="12690"/> <mls unit="MS folio" n="108b 25"/> &ampersir; arco fargbur errige H<ex>erend</ex> f<ex>r</ex>&iacute;. laim fessin leiss. Meni thoga<!--</lb>--> an&iacute;sin .i. bith formu chur &ampersir; mo thur collad a Herind sechtair.<!--</lb>--> Dolluid Laeg a dochum Con C<ex>ulaind</ex>. Ocus iarfaigid C<ex>u</ex> C<ex>hulaind</ex><!--</lb>--> d&oacute;. c&uacute;ich in suut. Goll m<ex>ac</ex> Carbada. &ampersir; ro innis uile an&iacute; remi<!--</lb>--></p>


<pb n="409"/>

<p><mls unit="MS folio" n="108b"/> connici collad a Her<ex>ind</ex> sechtair. Maith a Laeg na n-insaig doridisi <lb n="12695"/> <mls unit="MS folio" n="108b 30"/> &ampersir; r&aacute;id friss na gaibed i n-airiur do airireraib Her<ex>end</ex> din chursa.<!--</lb>--> &ampersir; nad gaibed cocr&iacute;ch nUl<ex>ad</ex> a n-ed beorsa i nHer<ex>ind</ex>. Dothaet<!--</lb>--> i frithdrui&ndot;g na sliged cetna. &ampersir; adf&eacute;t a aithesc. Maith aile a Guill<!--</lb>--> <mls unit="MS folio" n="108b 35"/> atbert in laech ucut isin tulaig fritt. na taisc do churach co calad<!--</lb>--> do chal<ex>adaib</ex> Her<ex>end</ex> in n-ed bessum i mbethaid. &ampersir; na taise dochum <lb n="12700"/> nUl<ex>ad</ex> in t&sdot;ainruth.<!--</lb>--></p>

<p>La sodain dobert Goll band feramail fora churach co 'mmarossed<!--</lb>--> dar no&iacute; sessaib i t&iacute;r t&iacute;rim. Tanic Laeg i rro&iacute; madma do innaigid<!--</lb>--> <mls unit="MS folio" n="108b 40"/> C<ex>on</ex> C<ex>ulaind</ex>. Dothaet C<ex>u</ex> C<ex>hulaind</ex> do &sdot;aigid Guill. for&oacute;bair<!--</lb>--> cach d&iacute;b ic folmaisi gona araile. Luathium luis Goll a l&aacute;ma. <lb n="12705"/> Gab<ex>ais</ex> <gap/> C<ex>oin</ex> C<ex>ulaind</ex> dara armu no n-imnais et<ex>er</ex> a l&aacute;im &ampersir; a<!--</lb>--> thoeb ar ammus a churaig. Maith a &sdot;iriti a &sdot;iabairthe a<!--</lb>--> <mls unit="MS folio" n="108b 45"/> hebarchaim. luid torut mar th&aacute;et b&oacute; dar l&aacute;eg. Vot chur mar<!--</lb>--> churait idain mna. Rot naisc mar nasces idu feda. Rot t<ex>r</ex>egdastar<!--</lb>--> mar thregdas fadb omnaid. Ro tuairgestar mar thuargther &iacute;asc <lb n="12710"/> <mls unit="MS folio" n="108b 50"/> for ganmig. Rot &sdot;nigestar niar negar a lundu. Is litiud m<ex>ei</ex>c bic<!--</lb>--> <mls unit="MS folio" n="109a"/> dia scamun dorone in laechsin d&iacute;t. &#x2016; Ni &fdot;uil do dluig do gas<ex>ced</ex> &#x026B; dot<!--</lb>--> tarim et<ex>er</ex> dag&oacute;co Her<ex>end</ex> dind l&oacute;so. Colla dom inchaib n&iacute; m&oacute;<!--</lb>--> na mo chumlond f&eacute;in in fersin.<!--</lb>--></p>

<p>Bidgais C<ex>u</ex> C<ex>hulaind</ex> co 'mmarossed dar no&iacute; n-immarib on Gull <lb n="12715"/> <mls unit="MS folio" n="109a 5"/> sechtair. Ni roacht o Gull tascud &#x026B; tincur dind &fdot;&oacute;t forsa mba&iacute;.<!--</lb>--> <ex>co</ex> li&ndot;gis C<ex>u</ex> C<ex>hulaind</ex> mar cach n-ethait a haeraib <ex>co</ex> seiss for bil<!--</lb>--> sc&eacute;ith in Guill. Dobert Goll fochrothad d&aacute; uilind fon sc&iacute;ath co<!--</lb>--> roacht band &fdot;ata &uacute;ad. Indara fecht li&ndot;gis C<ex>u</ex> C<ex>hulaind</ex> for bil<!--</lb>--> <mls unit="MS folio" n="109a 10"/> in sc&eacute;ith chetna. &ampersir; nochtais in Cruad&iacute;n Catutchend .i. a chlaideb. <lb n="12720"/> Cumma no gabad chloich &ampersir; c<ex>r</ex>and &ampersir; cn&aacute;im. Dobert b&eacute;im do Gull<!--</lb>--> co tall in cend i comarda a muniuil de. &ampersir; dobert athb&eacute;im ina m&eacute;di<!--</lb>--> conid i n-oen&fdot;echt condr&aacute;ncatar a da gabait chliss dochum tal<ex>man</ex>.<!--</lb>--> <mls unit="MS folio" n="109a 15"/> &ampersir; dobert in tress co ndergenai da n-ordain de. &ampersir; no facband amlaid-<!--</lb>--> sin. &ampersir; atbert na bri<ex>athr</ex>a &ampersir; ro r&aacute;id in laed. <lb n="12725"/></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l>Cend Guill seo atch&iacute; im l&aacute;im a Laech.<!--</lb>--></l>
<l>a m<ex>ei</ex>c Riangab<ex>ra</ex> rogaeth;<!--</lb>--></l>
<l>doth&aacute;et sunda budni drend.<!--</lb>--></l>
<l>do chosnam insi Her<ex>end</ex>.<!--</lb>--></l></lg>

<pb n="410"/>

<lg n="2">
<l><mls unit="MS folio" n="109a"/> Asrubairt rimsa rad &ndot;gle. <lb n="12730"/></l>
<l>Goll m<ex>ac</ex> rig na G<ex>er</ex>mane; <!--</lb>--></l>
<l>naco mbeind aice cen ail.<!--</lb>--></l>
<l>nach beind i nHer<ex>ind</ex> adbail.<!--</lb>--></l></lg>

<lg n="3">
<l><mls unit="MS folio" n="109a 20"/> Atrubartsa frisin l&aacute;ech.<!--</lb>--></l>
<l>frisin fer fichda forbaeth; <lb n="12735"/></l>
<l>ciano trebaind sund nach than<!--</lb>--></l>
<l>na gebaind a thuarastal.<!--</lb>--></l></lg>

<lg n="4">
<l>Ro chomraicsem imme sain.<!--</lb>--></l>
<l>messe &ampersir; Goll m&oacute;r din maig;<!--</lb>--></l>
<l>doroch<ex>air</ex> Goll arin traig. <lb n="12740"/></l>
<l>conid &eacute; a chend so atchi im l&aacute;im. .C.<!--</lb>--></l></lg></body></text></p>

<p><mls unit="MS folio" n="109a 25"/> Maith a Laeg ar C<ex>u</ex> C<ex>hulaind</ex> aig brot forin n-echraid &ampersir; sneid<!--</lb>--> slaitt forru. Cia d&uacute; s&oacute;n ar Laeg. Co Emain m&oacute;ir Macha ar C<ex>u</ex><!--</lb>--> C<ex>hulaind</ex>. Dia nernta form ni ragmais o D&uacute;n Delga &ampersir; &oacute; ingin<!--</lb>--> &Fdot;orgaill. Cid duit a L&aacute;eg na forcuala a n-atbert mo phopa <lb n="12745"/> C<ex>on</ex>ch<ex>obor</ex> i t&uacute;s la&iacute; indiu. Bec do gr&aacute;d la Conch<ex>obor</ex> ar L&aacute;eg.<!--</lb>--> <mls unit="MS folio" n="109a 30"/> acht co mbethi ri gleicc &ampersir; ri gliaid dar cend a chuicid. F&oacute; leiss<!--</lb>--> ciano thiasta ass. f&oacute; leiss cenco tiasta. Mad f&iacute;r duit an&iacute;sin ar<!--</lb>--> C<ex>u</ex> C<ex>hulaind</ex> bamsa deorad dar cr&iacute;ch nUl<ex>ad</ex> fri bl<ex>iadain</ex> &ampersir; ni &fdot;uigbet<!--</lb>--> Ul<ex>aid</ex> mo g<ex>re</ex>im. M&aacute;d g&oacute; i&mmacr; b&aacute;t innarbthach f&eacute;in uamse &ampersir; nibat <lb n="12750"/> <mls unit="MS folio" n="109a 35"/> munt<ex>er</ex> dam &aacute;r n&iacute; miad lim mo ara do marbad.<!--</lb>--></p>

<p>Imth&uacute;sa Con C<ex>ulaind</ex> ni &sdot;ed iss innisti sunna coll&eacute;ic acht imth&uacute;sa<!--</lb>--> Con aill m<ex>eic</ex> Gleo Glaiss a Cual&ndot;ge. Briuga cetach atacomnaic.<!--</lb>--> Tarmchemnigid remi .lll. carpdech co hEmain M<ex>ach</ex>a i t&uacute;s la&iacute;.<!--</lb>--> <mls unit="MS folio" n="109a 40"/> Aill bruitt budi. aill b<ex>ruitt</ex> deirg. aill b<ex>ruitt</ex> &uacute;ane. aill b<ex>ruitt</ex> gorma. <lb n="12755"/> aill b<ex>ruitt</ex> chorcra. aill b<ex>ruitt</ex> duba. And seiss Conch<ex>obor</ex> for<!--</lb>--> rubu na r&iacute;gr&aacute;tha fri hEmuin immuich. co mmathib Ul<ex>ad</ex> imme.<!--</lb>--> for forodmaig na hEmna.<!--</lb>--></p>

<p><mls unit="MS folio" n="109a 45"/> Mo chen mo chen a Chonaill m<ex>eic</ex> Gleo Glaiss ar Conch<ex>obor</ex>.<!--</lb>--> Is <ex>ed</ex> conairnecmar ar Conall. Atetha samlaid ar Conch<ex>obor</ex>. <lb n="12760"/> Nith&oacute; ar Conall. acht fled m&oacute;rchain tarclamad limsa duitsiu. A<!--</lb>--> <mls unit="MS folio" n="109b"/> tochathium &#x2016; damsa ar Conch<ex>obor</ex>. Cia l&iacute;n ludfamar ar Conch<ex>obor</ex>.<!--</lb>--> Ul<ex>aid</ex> fir sceo mnaib maccaib ingenaib feib am<ex>al con</ex>n&iacute;s ar Conall.<!--</lb>--> ar dia mbet&iacute;s et<ex>er</ex> biu &ampersir; marbu Ul<ex>aid</ex> i n-oenbali atethaid&iacute;s le&oacute;r a<!--</lb>--> llessaigthi fri bl<ex>iadain</ex> l&aacute;in limsa ic D&uacute;n Cholptha i Cual<ex>ngiu</ex>. <lb n="12765"/></p>


<pb n="411"/>

<p><mls unit="MS folio" n="109b 5"/> Gabtar far n-eich a Ultu &ampersir; indlit<ex>er</ex> far carp<ex>ait</ex> ar Conch<ex>obor</ex>.<!--</lb>--> Ro gabait echrad Ul<ex>ad</ex> &ampersir; ro indlit a carp<ex>ait</ex>. T&aacute;ncatar mathi<!--</lb>--> Ul<ex>ad</ex> .i. damrad derm&oacute;r c&oacute;icid Her<ex>end</ex> m<ex>ei</ex>c r&iacute;g &ampersir; ruirech &ampersir; amus &ampersir;<!--</lb>--> &oacute;cthigern. &ampersir; gillarad chass crodund in choicid. &ampersir; m<ex>a</ex>cra.da &ampersir;<!--</lb>--> <mls unit="MS folio" n="109b 10"/> bantrochta c&aacute;emchendchassa chuicid Ul<ex>ad</ex>. aindre &ampersir; ingenrada &ampersir; <lb n="12770"/> maccaeme. gl&aacute;mma &ampersir; cl&iacute;ara. fiallach ci&uacute;il &ampersir; airfitid. fir denma<!--</lb>--> drecht &ampersir; nath &ampersir; admolta Ul<ex>ad</ex>. Comeirgset i nn-oen&fdot;echt a hEmain<!--</lb>--> samlaid. Senchaide &ampersir; brithemain &ampersir; echlacha &ampersir; obl&aacute;ire &ampersir; f<ex>or</ex>b&fdot;ir<!--</lb>--> &ampersir; &oacute;nmiti &ampersir; gr&aacute;cb<ex>er</ex>thaig.<!--</lb>--></p>

<p><mls unit="MS folio" n="109b 15"/> Tancatar Ul<ex>aid</ex> uile i n-oenchonair im Chonch<ex>obor</ex>. And atbert <lb n="12775"/> Conall roga ar d&iacute;b conairib lim duit a r&iacute; chuicid H<ex>erend</ex>. Cia da<!--</lb>--> chonair &oacute;n ar Conch<ex>obor</ex>. Conar r&eacute;id &fdot;ota. &#x026B; conar garit amr&eacute;id.<!--</lb>--> In chonar garit amreid ar Conch<ex>obor</ex>. luid dar formna la&iacute; acht<!--</lb>--> <mls unit="MS folio" n="109b 20"/> s&uacute;ail. Ni &fdot;ail do amr&eacute;id inti ar Conall acht Garb Glinni Rige.<!--</lb>--> Ni nGlend Rige tiagait na sl&uacute;aig ar Conch<ex>obor</ex> acht i Sl&iacute;ab &Fdot;&uacute;ait <lb n="12780"/> cach remdirgi. Ni &fdot;&aacute;cbam mo chonair la Garb Rige tria bithu<!--</lb>--> ar Conch<ex>obor</ex>. Niro rathaig in Garb na sluaig do dul secha co<!--</lb>--> cuala culgaire na carp<ex>at</ex> fo deoid. Luid Garb fo deired na sl&uacute;ag<!--</lb>--> <mls unit="MS folio" n="109b 25"/> conascar .l. l&aacute;ech d&iacute;b assa carptib. Fosrimmart i ngonaib &ampersir; i<!--</lb>--> crobuillib b&aacute;is do methescul derid in t&sdot;l&oacute;ig. <lb n="12785"/></p>

<p>Dolluid Conch<ex>obor</ex> co tech Conaill m<ex>eic</ex> G<ex>leo</ex> G<ex>laiss</ex> co D&uacute;n<!--</lb>--> Colptha i Cual<ex>ngiu</ex>. Ro frithalit na sl&uacute;aig &ampersir; na sochaide ar d&aacute;naib<!--</lb>--> <mls unit="MS folio" n="109b 30"/> ar gr&aacute;daib ar dligedaib. ar &uacute;asli ar cha&iacute;nb&eacute;saib do neoch badas<!--</lb>--> tadas f&iacute;naib firmathi. Ro esr&aacute;it tigi ardda urgbaidi do a&iacute;n &ampersir;<!--</lb>--> do &uacute;rl&uacute;achair &ampersir; do cholcthib cl&uacute;mdaide. &ampersir; cach neich bad comtig do <lb n="12790"/> mathib Ul<ex>ad</ex> dia frith&aacute;lim f<ex>r</ex>i i mbrudin bronn&fdot;arsi&ndot;g b&eacute;lscailti<!--</lb>--> <mls unit="MS folio" n="109b 35"/> C<ex>on</ex>aill m<ex>eic</ex> G<ex>leo</ex> G<ex>laiss</ex> in n-aidchisin. Maith a r&iacute; ch&uacute;cid Her<ex>end</ex><!--</lb>--> a Chonch<ex>obuir</ex> inro d&aacute;l nech dit munt<ex>ir</ex> it&iacute;aid innocht. Niro<!--</lb>--> d&aacute;l ar Conch<ex>obor</ex> do neoch ro f&aacute;cbus i nEmain. Cid s&oacute;n ar<!--</lb>--> Conch<ex>obor</ex>. Coro oslaicther din choinse imdeglas in letht<ex>r</ex>ichait <lb n="12795"/> chet .i. do Chonb&eacute;l. Is &eacute; nar n-airend ar chuirib ar chobdenaib<!--</lb>--> echtrannaib. Iar sin ro oslaiced do Chonb&eacute;l.<!--</lb>--></p>

<p><mls unit="MS folio" n="109b 40"/> Tucait airigthe b&iacute;d &ampersir; lenna dona sluag<ex>aib</ex> iar sin. &ampersir; dor&oacute;nait<!--</lb>--> g<ex>re</ex>tha glan&fdot;othraicthe d&oacute;ib assa aithle. Fliuchcaemna folcthi &ampersir;<!--</lb>--> foth<ex>raicthe</ex>. Ro figd&iacute;rged a canuch cetamuin do ca<ex>ch</ex> laech fo <lb n="12800"/> leith. Dob<ex>er</ex>t c&uacute;achsnaidm curad ar ca<ex>ch</ex> laech fo leith. Tucait<!--</lb>--> <mls unit="MS folio" n="109b 45"/> na d&aacute;er &ampersir; na dorsaire do &fdot;aire na cathrach iar tam. Ro tasselbad a<!--</lb>--> llind &ampersir; a mbiad do Ul<ex>taib</ex> i n-&aacute;itt oenbale. Ro d&aacute;iled mid mesc<!--</lb>--> <mls unit="MS folio" n="110a"/> medarcha&iacute;n forsna sluagaib &#x2016; a cuachaib a cornaib a coplestraib.<!--</lb>--></p>

<pb n="412"/>

<p><mls unit="MS folio" n="110a"/> Imth&uacute;s na sl&uacute;ag iss ed iss innisti sund coll&eacute;ic. acht tarrasatar <lb n="12805"/> ac &oacute;l &ampersir; ic oebinnius. Imthusa Chon C<ex>ulaind</ex> i&mmacr; maith a Laeg<!--</lb>--> cuir m cend sin carp<ex>at</ex> &ampersir; aig brot forin n-echraid &ampersir; do dait co hEmain.<!--</lb>--> <mls unit="MS folio" n="110a 5"/> Lotar rempu. Ba samla fri cr&iacute;ch in da chlod dori&ndot;gensat roith<!--</lb>--> iarnaide carp<ex>ait</ex> C<ex>on</ex> C<ex>ulaind</ex> in l&aacute;sin do thaebaib na sliged. Ba<!--</lb>--> samalta ri helta dub&eacute;n ic snigi dar mag moradbal. ina curtis na <lb n="12810"/> eich do cheppaib &ampersir; do chorr&fdot;&oacute;taib &ampersir; di &fdot;uatnib tal<ex>man</ex> asa n-aigthib<!--</lb>--> <mls unit="MS folio" n="110a 10"/> s&iacute;ar sechtair fri fonascad &ndot;gaithe. Ba samalta fri eill &ndot;g&eacute;isi ic<!--</lb>--> snige dar mag m&oacute;radbal ana curtis rempu d'uanfadaig dar<!--</lb>--> glomraigib a sr&iacute;an. Ba s amla ri diaid do rigbruidin in dendgur &ampersir;<!--</lb>--> ind an&aacute;lfadach &ampersir; in sm&uacute;tgur. ar t<ex>r</ex>essa na h&eacute;rma dobert Laeg m<ex>ac</ex> <lb n="12815"/> Rian<ex>gabra</ex> ar da n-ech<ex>aib</ex> C<ex>on</ex> C<ex>ulaind</ex> in l&aacute;sin.<!--</lb>--></p>

<p><mls unit="MS folio" n="110a 15"/> Dofarnaic reme co faidchi na Emna fon samlaidsin. Maith a<!--</lb>--> Laeg ar C<ex>u</ex> Ch<ex>ulaind</ex> indar lim is f&aacute;s ind Emainse thall innocht.<!--</lb>--> Cid dia fil lat sin ar Lae<ex>g</ex>. Ar n&iacute; chlunim <ex>g</ex>&aacute;ir &#x026B; <ex>gre</ex>tha inti ar C<ex>u</ex><!--</lb>--> C<ex>hulaind</ex>. Ni chlunim g&aacute;ir echlach &#x026B; boccmell sl<ex>uaig</ex> &#x026B; tar<ex>con</ex> <lb n="12820"/> <mls unit="MS folio" n="110a 20"/> t<ex>ur</ex>usa inti. Ni chlunim g&aacute;ir chiuil &#x026B; airfiti inti. Fosta latt &eacute;ssi<!--</lb>--> fostada th' echraidi co ndigsa dia &fdot;is cia teidm tethra dothait<!--</lb>--> forsna sluagu. Fostaid Laeg ind echrad. &ampersir; luid C<ex>u</ex> C<ex>hulaind</ex><!--</lb>--> i nEmain. Is &eacute; c&eacute;tlaech dorala d&oacute; i nEmain S&uacute;anan Salcend<!--</lb>--> rannaire Conch<ex>obuir</ex>. Ar n&iacute; &fdot;acbad a rannaire f&eacute;in Emain do g<ex>r&eacute;</ex>s. <lb n="12825"/> <mls unit="MS folio" n="110a 25"/> Maith a &Sdot;&uacute;anain cid lotar na sluaig. Co tech Conaill m<ex>eic</ex> G<ex>leo</ex><!--</lb>--> G<ex>laiss</ex> i Cual<ex>ngiu</ex> ar Suan<ex>an</ex>. Inrom imraidse Conch<ex>obor</ex> ritsu<!--</lb>--> ar C<ex>u</ex> C<ex>hulaind</ex>. Ni chualammar ar Suan<ex>an</ex>. Is f&iacute;r a n-adbert<!--</lb>--> L&aacute;eg. nad fil mo gradsa la Conch<ex>obor</ex>. Atbiur mo breth<ex>ir</ex> na bia<!--</lb>--> Emain feib am<ex>al</ex> conairnecus. nodas ber i corthair tened. Ni bia <lb n="12830"/> <mls unit="MS folio" n="110a 30"/> &eacute;ludach esti. &#x026B; &oacute;en di &eacute;is oirgni. D&aacute; n&iacute; no thairmescad Ch<ex>oin</ex> C<ex>ulaind</ex><!--</lb>--> do g<ex>r&eacute;</ex>s .i. cichi &ampersir; aurbrunne ban do thasbenad d&oacute;. &#x026B; raind espai &ampersir;<!--</lb>--> airchetail cachnaitis fiadu. Ro gab ecla inti S&uacute;anan &ampersir; cachain<!--</lb>--> rand.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l>Mo chen a Chu Ch<ex>ulaind</ex> chruaid <lb n="12835"/></l>
<l>a h&uacute; Chathbad chlaidebruaid;<!--</lb>--></l>
<l>failti duit sund armoth&aacute;<!--</lb>--></l>
<l>ca<ex>ch</ex> &oacute;enaidchi &ampersir; ca<ex>ch</ex> oenl&aacute;.<!--</lb>--></l></lg>

<lg n="2">
<l>Mo chen fort fein fichtib tor. <!--</lb>--></l>
<l>is mo chen ar C<ex>on</ex>chobor; <lb n="12840"/></l>
<l>mo chen ar Decht<ex>ir</ex> m&eacute;t rath.<!--</lb>--></l>
<l>is mo chen ar Sualtach.<!--</lb>--></l></lg>

<pb n="413"/>
<lg n="3">
<l><mls unit="MS folio" n="110a"/> Na b&iacute; ic imthecht na hoidche.<!--</lb>--></l>
<l>f&uacute;airi flichi firdoirche;<!--</lb>--></l>
<l>a Ch<ex>u</ex> C<ex>hulaind</ex> cetaib reb <lb n="12845"/></l>
<l>airis i fus is mo chen. M.<!--</lb>--></l></lg></body></text></p>

<p><mls unit="MS folio" n="110a 40"/> N&iacute;ra chomaill C<ex>u</ex> C<ex>hulaind</ex> tr&aacute; anro thingell .i. Emain do los<ex>cud</ex><!--</lb>--> acht t&aacute;nic ar c&uacute;l immach. Maith a Laeg aig brot forin n-ech<ex>raid</ex><!--</lb>--> d&oacute; r&uacute;n co tech Conaill m<ex>eic</ex> G<ex>leo</ex> G<ex>laiss</ex> i Cual<ex>ngiu</ex> d&aacute;ig iss <ex>ed</ex> lotar<!--</lb>--> na sluaig &ampersir; C<ex>on</ex>ch<ex>obor</ex>. Dia ndernta form ar in gilla ni ragmais <lb n="12850"/> <mls unit="MS folio" n="110a 45"/> a hEmain innocht. dered dind l&oacute;. Cromm barr cr&aacute;eb. &iacute;sel cithar<!--</lb>--> fidbad. ro laig f&iacute;ad i f&oacute;rib. salaig cretta carp<ex>at</ex>. lesc ri fom&oacute;ir<!--</lb>--> c<ex>u</ex>mscugud. ni tr&aacute;th iml&uacute;ate echraide. N&iacute;ram irgaire ar C<ex>u</ex><!--</lb>--> <mls unit="MS folio" n="110b"/> C<ex>hulaind</ex>. Nitho ar in gilla. Roga ar da <ex>con</ex>air &#x2016; lim duit conar<!--</lb>--> &fdot;ota r&eacute;id &#x026B; <ex>con</ex>ar fota amr&eacute;id. In garit amr&eacute;id ar C<ex>u</ex> C<ex>hulaind</ex>. <lb n="12855"/> Ni &fdot;il d'amreid inti ar Laeg acht Garb Glinni R<ex>ige</ex>. N&iacute; &fdot;&aacute;cbaini<!--</lb>--> mo chonair la &oacute;enl&aacute;ech ar C<ex>u</ex> C<ex>hulaind</ex>.<!--</lb>--></p>

<p>Luid C<ex>u</ex> C<ex>hulaind</ex> reme i cend s&eacute;ta. Co cuala in fe&oacute;lb&eacute;im issin<!--</lb>--> <mls unit="MS folio" n="110b 5"/> glind ba nessam d&oacute; .i. i &ndot;Glind R<ex>ige</ex> anro thascair reme in Garb<!--</lb>--> do sl<ex>uagaib</ex> Ul<ex>ad</ex>. Luid C<ex>u</ex> C<ex>hulaind</ex> fon feolb&eacute;im. Co n-ecmamg <lb n="12860"/> c<ex>o</ex>mlund d&oacute; &ampersir; Garb G<ex>linne</ex> R<ex>ige</ex>. Ro gab c&aacute;ch d&iacute;b guin &ampersir; airlech<!--</lb>--> araile dona slegaib slemunchruadib. Facsit la Coin Cul<ex>aind</ex> dond<!--</lb>--> <mls unit="MS folio" n="110b 10"/> imbual<ex>ad</ex> &#x026B; dond imrubad. Lecis a &sdot;leig &uacute;ad &ampersir; gab<ex>ai</ex>s a l&aacute;im &ampersir;<!--</lb>--> dobert crothad cotud f<ex>ur</ex>ri condas tuc &aacute; gualaind cona slinn&eacute;n.<!--</lb>--> L&eacute;icis Garb G<ex>linne</ex> R<ex>ige</ex> a iachtad &eacute;c<ex>o</ex>mlaind ar aird. I fail nech <lb n="12865"/> beo sund ar L&aacute;eg. Am be&oacute;sa ar C<ex>u</ex> C<ex>hulaind</ex> &ampersir; domroched mo<!--</lb>--> <mls unit="MS folio" n="110b 15"/> chlaideb. Dobert Laeg d&oacute; in claideb. Nochtais C<ex>u</ex> C<ex>hulaind</ex> in<!--</lb>--> Cruadin Catutchend co tuc b&eacute;im don Garb co topacht in d&aacute; cend<!--</lb>--> b&aacute;tar fora &oacute;enm&eacute;idiu de &ampersir; dobert athbeim d&oacute; ina m&eacute;di conid i<!--</lb>--> n-oen&fdot;echt r&aacute;ncatar a da gabait chliss for tal<ex>main</ex> &ampersir; tuc in tress <lb n="12870"/> <mls unit="MS folio" n="110b 20"/> buille d&oacute; co nderna d&aacute; n-orddain de. Maith ar L&aacute;eg cinnas<!--</lb>--> c<ex>o</ex>mlaind. In n-ed bam be&oacute; ticfa frim ar C<ex>u</ex> C<ex>hulaind</ex> &ampersir; dor<ex>igne</ex> in<!--</lb>--> laed.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l>Garb Glinni<!--</lb>--></l>
<l>olc a &fdot;&uacute;ath is a inni .&ampersir; <lb n="12875"/></l>
<l>sochaidi dorochair leiss<!--</lb>--></l>
<l>nirbo thabarta d'eisleis.<!--</lb>--></l></lg>

<pb n="414"/>

<lg n="2">
<l><mls unit="MS folio" n="110b"/> Dorat .l. crecht form chness<!--</lb>--></l>
<l>dom leith chle &ampersir; dom leith dess;<!--</lb>--></l>
<l>ni &fdot;ail d&iacute;b ar tal<ex>main</ex> tend. <lb n="12880"/></l>
<l>crecht arna fagbaim fairrend.<!--</lb>--></l></lg>

<lg n="3">
<l><mls unit="MS folio" n="110b 25"/> Ro chomraicsium rad cen &fdot;ell.<!--</lb>--></l>
<l>iar techta d&uacute;n isin glend;<!--</lb>--></l>
<l>ticfa frim c&eacute;in bam b&eacute;o.<!--</lb>--></l>
<l>nirbo chennais ar cruadgleo. <lb n="12885"/></l></lg>	

<lg n="4">
<l>Atrubart rutt cen &fdot;ell.<!--</lb>--></l>
<l>ria techta duit issin glend;<!--</lb>--></l>
<l>is eol dam na mbiad duit de<!--</lb>--></l>
<l>dot trut &ampersir; Garb Glinne. G.<!--</lb>--></l></lg></body></text></p>

<p>Cuir in da chend a Laeg issin carp<ex>at</ex> &ampersir; saig brot forin n-echr<ex>aid</ex><lb n="12890"/> <mls unit="MS folio" n="110b 30"/> &ampersir; d&oacute; romaind co tech Conaill m<ex>eic</ex> G<ex>leo</ex> G<ex>laiss</ex> i Cual<ex>ngiu</ex>. bid<!--</lb>--> f&iacute;r for Laeg. Tancatar rempu i sligedaig saethair co torachtatar<!--</lb>--> in n-abaind i fail tige Conaill. frisi nn-abar Aband Cholpthai i<!--</lb>--> Cual<ex>ngiu</ex>. M&oacute;r ind aband ar C<ex>u</ex> C<ex>hulaind</ex>. Domroched fertas mo<!--</lb>--> <mls unit="MS folio" n="110b 35"/> charp<ex>ait</ex> coro &fdot;romur in n-&aacute;th riasinn ech<ex>raid</ex>. Atchuala Conb&eacute;l <lb n="12895"/> c&uacute; C<ex>on</ex>aill f&uacute;aim ind us<ex>ci</ex> fri formnaib in m&iacute;led. Oslaicis a<!--</lb>--> ginchr&aacute;es &ampersir; atnaig a gloim n-archon for aird. co ndigs<ex>ed</ex> treess dar<!--</lb>--> ginchraes d&oacute;. Dobert C<ex>u</ex> C<ex>hulaind</ex> in fertais na gin &ampersir; a laim &ampersir; gab<ex>ais</ex><!--</lb>--> <mls unit="MS folio" n="110b 40"/> a thrommu &ampersir; no n-imnaisc mo chend feib imnaiscth<ex>er</ex> lathranna<!--</lb>--> staible co nderna briscbr&uacute;ar dia chn&aacute;maib na chroccund &ampersir; dobert <lb n="12900"/> urchur uad de &oacute; abaind Chol<ex>pthai</ex> i Cual<ex>ngiu</ex> co Belut. conid de<!--</lb>--> at&aacute; Belut forsin chloich fora torchair Conb&eacute;l c&uacute; C<ex>on</ex>aill m<ex>eic</ex> G<ex>leo</ex><!--</lb>--> G<ex>laiss</ex>.<!--</lb>--></p>

<p><mls unit="MS folio" n="110b 45"/> Dothaet reme co dorus na cathrach. Apair oslucud remut a<!--</lb>--> Laeg &ampersir; na raid missi and. acht apair gn&aacute;thmacc&aacute;em do macc&aacute;emaib <lb n="12905"/> na hEmna &#x2016; <!--</lb>--></p>

<p><mls unit="MS folio" n="111a"/> Dothaet L&aacute;eg co dorus na cath<ex>rach</ex>. Oslaicid a dorsaire. Cia<!--</lb>--> condnaig in n-urslucud. maccaem do maccaemnaib na hEmna<!--</lb>--> sund ar Laeg. Ni uasalgen i nEmain int&iacute; n&aacute; tanic in fleidsea<!--</lb>--> <mls unit="MS folio" n="111a 5"/> cosin trathsa. &ampersir; naro c<ex>u</ex>mniged im biad &#x026B; im lind. d'oslucud remi <lb n="12910"/> dia t&iacute;s<ex>ed</ex> sund. Na radid a mogadu. borb &ampersir; anseirc i&ndot; m<ex>a</ex>c fil<!--</lb>--> sund. Atberum ar &mdot;bre<ex>thir</ex> ar na dor<ex>sairi</ex> in maccaem dia tucsat<!--</lb>--></p>


<pb n="415"/>

<p><mls unit="MS folio" n="111a"/> Ul<ex>aid</ex> i n-&aacute;itt oenbaile br&oacute;n &ampersir; t&aacute;r &ampersir; tarcusul na ticfa co solustr&aacute;th<!--</lb>--> <mls unit="MS folio" n="111a 10"/> &eacute;irge imb&aacute;rach isin cath<ex>raig</ex> co tuca c&aacute;ch aichni for araile.<!--</lb>--> Rochuala C<ex>u</ex> C<ex>hulaind</ex> in guthsain. Ocus gall&aacute;n clochi bo&iacute; forsin <lb n="12915"/> &fdot;aichthi. A thrian i tal<ex>main</ex> &ampersir; a da t<ex>r</ex>&iacute;an uasa. dof&uacute;argaib fria<!--</lb>--> ais &ampersir; tarlaic a urchur dar &fdot;iartharsna ind imdorais coro briss in<!--</lb>--> <mls unit="MS folio" n="111a 15"/> dunad &ampersir; coro marb .lll. mogad batar ic frithalim na sl<ex>uag</ex> na ranic<!--</lb>--> fer ma&iacute;ti airgni &uacute;ad innund. Ro nocht a chlaideb &ampersir; dothaet is tech<!--</lb>--> darna sluag<ex>aib</ex> &ampersir; a chlaideb frithnocht leis. Cona rathaig fer <lb n="12920"/> dotheing d&uacute;aig diarbo chomainm Bricriu m<ex>ac</ex> Carbad Uill di Ul<ex>taib</ex>.<!--</lb>--> &ampersir; doroni in rand.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l><mls unit="MS folio" n="111a 20"/>Cu Ch<ex>ulaind</ex> sund srethaib gal<!--</lb>--></l>
<l>a &oacute;cu &aacute;ille Ulad;<!--</lb>--></l>
<l>claideb nocht na deiss dendgil. <lb n="12925"/></l>
<l>n&iacute; tr&aacute;th com&oacute;il com&eacute;rgid.<!--</lb>--></l></lg>

<lg n="2">
<l>Arm nocht cip &eacute; dombera.<!--</lb>--></l>
<l>cuc<ex>u</ex>m im thech trenmeda;<!--</lb>--></l>
<l>n&iacute; n-ainset r&iacute;g mod n-amra.<!--</lb>--></l>
<l>n&aacute; m<ex>ei</ex>c r&iacute;g n&aacute; rigdamna. <lb n="12930"/></l></lg>

<lg n="3">
<l>In l&aacute;ech i fail in t-arm l&aacute;im.<!--</lb>--></l>
<l>atberim tria immarb&aacute;ig;<!--</lb>--></l>
<l><mls unit="MS folio" n="111a 25"/> ma cach mairer sund co se.<!--</lb>--></l>
<l>fort n&iacute; chunnig commairge.<!--</lb>--></l></lg>

<lg n="4">
<l><mls unit="MS folio" n="111a 5"/> Dob&eacute;rsa degbuilli duit. <lb n="12935"/></l>
<l>a Bricriu b&aacute;eth briatharguirt;<!--</lb>--></l>
<l>raticfa ra mod n-ellaim.<!--</lb>--></l>
<l>meni chosce do drochthe&ndot;gaid.<!--</lb>--></l></lg>

<lg n="5">
<l>Att&uacute;sa ar commairge chr&uacute;aid.<!--</lb>--></l>
<l>Con na Cerdda asin Chraebruaid; <lb n="12940"/></l>
<l>ceno radiur rad cen brath.<!--</lb>--></l>
<l>nocon &aacute;gur mo marbad.<!--</lb>--></l></lg>

<lg n="6">
<l><mls unit="MS folio" n="111a 30"/> Is eol dam na mbia du&iacute;t de.<!--</lb>--></l>
<l>a Bricriu ata&iacute; for buadre;<!--</lb>--></l>
<l>mairfidir sib malle. <lb n="12945"/></l>
<l>tussu &ampersir; do chommairge.<!--</lb>--></l></lg>

<pb n="416"/>

<lg n="7">
<l><mls unit="MS folio" n="111a"/> Mairg ro raid a brethir m&oacute;ir.<!--</lb>--></l>
<l>meni chomalla a ch&eacute;t&oacute;ir;<!--</lb>--></l>
<l>mad dia ndig for culu de.<!--</lb>--></l>
<l>atberthar bid genaige. <lb n="12950"/></l></lg>

<lg n="8">
<l>&Eacute;irgid a Ultu &aacute;na<!--</lb>--></l>
<l>&ampersir; comaillid for mb&aacute;ga;<!--</lb>--></l>
<l><mls unit="MS folio" n="111a 35"/> t&oacute;cbaid for cl&uacute; erctha raind.<!--</lb>--></l>
<l>&ampersir; marbaid Con Culaind. C.<!--</lb>--></l></lg></body></text></p>

<p>Cia airm i t&aacute;t francai&ndot;ais mo thige ar Conchob<ex>or</ex>. Senoll Uathad. <lb n="12955"/> Bruchur a Bruachairne. Sescn&eacute;n m<ex>ac</ex> Forduib Mani L&aacute;mgarb.<!--</lb>--> Cia airm i t&aacute;t mo m<ex>ei</ex>cse ar Fergus. Buinne Find. &ampersir; Illand<!--</lb>--> <mls unit="MS folio" n="111a 40"/> Ilair cland. Cia airm i t&aacute;t m<ex>ei</ex>c Uisnig. No&iacute;si &ampersir; &Aacute;nle &ampersir; Ardd&aacute;n.<!--</lb>--> Maith ar Conall cia airm i t&aacute;t mo brathirse. com&eacute;rgid &ampersir; co&ndot;gnaid<!--</lb>--> fri Coin Cul<ex>aind</ex>. <lb n="12960"/></p>

<p>Atragat na sluaig. Ro ba&iacute; fe 'nund &ampersir; fe anall in d&uacute;sin. essgal &ampersir;<!--</lb>--> tessgal. rocloss f&uacute;arg&fdot;othrom na sl<ex>uag</ex> i c&eacute;in. At<ex>r</ex>aacht Sencha<!--</lb>--> <mls unit="MS folio" n="111a 45"/> iar tain &ampersir; ro chroth in cr&aacute;eb s&iacute;da &oacute;sna sl<ex>uagaib</ex> combtar s&iacute;daig<!--</lb>--> am<ex>al</ex> betis m<ex>ei</ex>c oenathar &ampersir; &oacute;enmathar. Ra coraigit a sc&eacute;ith<!--</lb>--> fora ndelgnaib. a claidbe fora n-adartaib. &ampersir; a slega fora n-adlennaib. <lb n="12965"/> <mls unit="MS folio" n="111b"/> T&aacute;nic c&aacute;ch na inad &oacute;il. &#x2016; Dobreth C<ex>u</ex> C<ex>hulaind</ex> a chlaideb na<!--</lb>--> &fdot;intech. Ro gab flesc findairgit &ampersir; dobreth b&eacute;im di i mmulluch<!--</lb>--> Conch<ex>obuir</ex> o bun irlai co clais a chuil. D&iacute;ambad &aacute;il dam ar se<!--</lb>--> is &eacute; in claideb dob&eacute;raind &ampersir; ni &fdot;ail do slogaib ocut l&iacute;n t'anacail<!--</lb>--> <mls unit="MS folio" n="111b 5"/> m<ex>en</ex>b&aacute;dat aite &ampersir; brathair m&aacute;thar. <lb n="12970"/></p>

<p>T&aacute;nic Conall C<ex>ernach</ex> &ampersir; Fergus. dobrethsat p&oacute;ca do Choin<!--</lb>--> Cul<ex>aind</ex> &ampersir; ra fucsat leo dind &fdot;ochlai &fdot;ennida. Tancas &oacute; Chonch<ex>obur</ex><!--</lb>--> na d&iacute;aid co n-airdig meda i llestur argait &oacute;engil d&oacute; co mbethaid &ampersir;<!--</lb>--> sl&aacute;nti &oacute;nd r&iacute;g. Tanic Laeg immach fiadna sl<ex>uagaib</ex> &ampersir; fuachais d&iacute;<!--</lb>--> <mls unit="MS folio" n="111b 10"/> ch&uacute;alle. &ampersir; dobreth cend Guill for indara cualle. &ampersir; da cend Gairb <lb n="12975"/> Glinni Rigi arin cuailli aile. Maith a Laeg ar Conch<ex>obor</ex> cia cend<!--</lb>--> in cend attnech acarb m&oacute;r &uacute;t. Cend Guill m<ex>eic</ex> Carb<ex>ada</ex> ar L&aacute;eg<!--</lb>--> m<ex>ei</ex>c r&iacute;g na Germane tuascertaige in domain. <ex>co&ndot;</ex>arnaic d&oacute; fri<!--</lb>--> Coin Cul<ex>aind</ex> ar &Aacute;th M&oacute;r i mMaig Mur<ex>themni</ex>. Niba &Aacute;th M&oacute;r a<!--</lb>--> <mls unit="MS folio" n="111b 15"/> ainm ondiu co br&aacute;th ar Ath<ex>ir</ex>ne acht &Aacute;th &ndot;Guill. Conid de at&aacute; <lb n="12980"/> &Aacute;th &ndot;Guill fri D&uacute;n Delga an&iacute;s. Cit n-&eacute; d&aacute; chend in da chend &uacute;t<!--</lb>--> forind oenmun&iacute;ul ar Conch<ex>obor</ex>. Da cend Gairb G<ex>linne</ex> R<ex>ige</ex> ar<!--</lb>--></p>

<pb n="417"/>

<p><mls unit="MS folio" n="111b"/> L&aacute;eg. Atlochur dom chumachtaib ar Conch<ex>obor</ex>. Ro thascair<!--</lb>--> .l. do deriud na sluag ic tiachtain secha.<!--</lb>--></p>

<p><mls unit="MS folio" n="111b 20"/> Mo chen do thichtu a Ch<ex>u</ex> C<ex>hulaind</ex> ar Conall m<ex>ac</ex> G<ex>leo</ex> G<ex>laiss</ex>. <lb n="12985"/> Ro gelcais do l&aacute;ma isin chathraig i tanacais innocht. Cia holc<!--</lb>--> dar&oacute;ne ar Conch<ex>obor</ex>. Tr&iacute; choicait mogad b&aacute;tar ic frithalim na<!--</lb>--> sl<ex>uag</ex> rodos marb d'&oacute;enurchur don gall&aacute;n chloche amb&uacute;aruch.<!--</lb>--> Nach ba&iacute; c&uacute; maith latsu ar Laeg. N&iacute; raba i nHer<ex>ind</ex> acht c&uacute; na<!--</lb>--> <mls unit="MS folio" n="111b 25"/> cerdda coin bad &fdot;err old&aacute;s ar Conall C<ex>ernach</ex>. Fuil cul&eacute;n d&oacute; <lb n="12990"/> limsa n&iacute;ba ferr a athair old&aacute;s. doberthar duitsiu do inchaib Con<!--</lb>--> C<ex>ulaind</ex>. Doberthar .lll. mogad uaimsi ar Conch<ex>obor</ex> dar cend<!--</lb>--> aigthe Con C<ex>ulaind</ex>.<!--</lb>--></p>

<p>Fessatar co cend tr&iacute; c&oacute;icthiges and i tig Conaill m<ex>eic</ex> G<ex>leo</ex> G<ex>laiss</ex>.<!--</lb>--> Ba h&eacute; sescend a n-oigidechta a cetadaig &ampersir; niba h&iacute; ind adaig <lb n="12995"/> dedenach.<!--</lb>--></p>

<p><mls unit="MS folio" n="111b 30"/> Tan<ex>catar</ex> na sl<ex>uaig</ex> co hEmain asa aithle. And atbert C<ex>u</ex><!--</lb>--> C<ex>hulaind</ex> fri Laeg. Aig brot fora n-ech<ex>raid</ex> &ampersir; sneid slaitt forru. &ampersir;<!--</lb>--> do duit co tech Eogain m<ex>eic</ex> Dur<ex>thacht</ex> co fosud fer Fernmaige.<!--</lb>--> co fargbam in coiced fri bl<ex>iadain</ex> conna faccara nech di choiciud <lb n="13000"/> Ul<ex>ad</ex> ar n-agid fri bl<ex>iadain</ex> airm innar n-imdergad. Maith a m<ex>ei</ex>c<!--</lb>--> <mls unit="MS folio" n="111b 35"/> ar Conch<ex>obor</ex> niba f&iacute;r an&iacute;sin. Atetha breth do b&eacute;l f&eacute;in duit.<!--</lb>--> Ni g&eacute;b mo breth f&eacute;in ar C<ex>u</ex> C<ex>hulaind</ex> acht breth bertait brith<ex>emain</ex><!--</lb>--> &ampersir; fil<ex>id</ex> in chuicid. Tucait aes d&aacute;na Ul<ex>ad</ex> ar leth. &ampersir; is s&iacute; breth rucsat<!--</lb>--> screpul ca<ex>cha</ex> &sdot;r&oacute;na. unga ca<ex>cha</ex> cathri. ech aigenmais cacha g<ex>re</ex>ga. <lb n="13005"/> <mls unit="MS folio" n="111b 40"/> Screpul ca<ex>cha</ex> b&oacute;botha. mucc mucr&iacute;me ca<ex>ch</ex> tre&oacute;it. Cumal ca<ex>cha</ex><!--</lb>--> cathrach. Ro maith C<ex>u</ex> C<ex>hulaind</ex> a d&aacute; tr&iacute;an sain d&aacute; aiti &ampersir; d&aacute;<!--</lb>--> thigernu &ampersir; do brath<ex>air</ex> a math<ex>ar</ex>. Dorat a t<ex>r</ex>&iacute;an n-aill dar cend<!--</lb>--> a einich do &fdot;il<ex>edaib</ex> in chuicid. Combad marthanach in echtrasin<!--</lb>--> d&oacute; mar ca<ex>ch</ex> n-echtra dochuaid riam. Ocus in mochergisin mar <lb n="13010"/> ca<ex>ch</ex> mochergi.<!--</lb>--></p>

<p><mls unit="MS folio" n="111b 45"/> Conid h&iacute;sin Aided Guill m<ex>eic</ex> C<ex>arbada</ex> &ampersir; Aided Gairb G<ex>linne</ex><!--</lb>--> R<ex>ige</ex>.,<!--</lb>--></p>
</div1>


<pb n="418"/>
<div1 n="3">
<head>Incipit Scel Mucci M<ex>ei</ex>c Da Th&oacute;.</head>

<p>BO&iacute; r&iacute; amra for Laig<ex>nib</ex> .i. M<ex>a</ex>c Da ,Th&oacute; a ainm. Bui c&uacute; oca. <lb n="13015"/> <mls unit="MS folio" n="112a"/> No ditned in cu Lagniu uile. Ailbe ainm in chon. &#x2016; &ampersir; l&aacute;n<!--</lb>--> Heriu dia aurdarcus. Tancas o Ail<ex>il</ex>l &ampersir; o Meidb do chungid<!--</lb>--> in chon. I n-oenuair da<ex>no</ex> tancatar &ampersir; techta Conch<ex>obuir</ex> m<ex>eic</ex><!--</lb>--> Nessa do chungid in chon chetna. Ro ferad failte friu uile. &ampersir;<!--</lb>--> <mls unit="MS folio" n="112a 5"/> ructha chucisium isin &mdot;bruidin. Is &iacute;sein in t&sdot;essed bruiden ro <lb n="13020"/> bo&iacute; i nHer<ex>ind</ex> in tansin .i. bruden Da Derga i cr&iacute;ch Cualand. &ampersir;<!--</lb>--> b<ex>ruden</ex> &Fdot;orgaill Manaich. &ampersir; b<ex>ruden</ex> M<ex>eic</ex> Da Reo i mBrefni. &ampersir;<!--</lb>--> b<ex>ruden</ex> Da Choca i n-iarth<ex>ur</ex> Mide. &ampersir; b<ex>ruden</ex> Blai Briuga i nUltaib.<!--</lb>--> Secht &ndot;doruis isin bruidin. &ampersir; uii. sligeda tr&eacute;thi. &ampersir; .uii. tellaige<!--</lb>--> inti. &ampersir; .uii. core. &ampersir; dam &ampersir; tinne in ca<ex>ch</ex> coire. In &fdot;er dotheiged <lb n="13025"/> <mls unit="MS folio" n="112a 10"/> iarsin t&sdot;ligi dobered in n-ael isin coire. &ampersir; na tabrad don chetgabail<!--</lb>--> iss ed no ithed. Mani thucad n&iacute; don ch&eacute;ttadall ni bered a n-aill.<!--</lb>--> Ructha tr&aacute; na techta na imdai chucisium do airiuc thuile doib<!--</lb>--> riasin feiss. Ro raidset a n-athes Do chungid in chon<!--</lb>--> <mls unit="MS folio" n="112a 15"/> dodechammarni &oacute; Ail<ex>ill</ex> &ampersir; &oacute; Meidb ar tecta Conn<ex>acht</ex>. &ampersir; dobertar <lb n="13030"/> tri fichit c&eacute;t lilgach a chet&oacute;ir. &ampersir; carpat &ampersir; da ech bas &fdot;err la Connachta.<!--</lb>--> &ampersir; a chomma&iacute;n i cind bl<ex>iadna</ex> cenmotha sin. Dia chungid da<ex>no</ex><!--</lb>--> dodechammarni ar tecta Ul<ex>ad</ex> o Chonchob<ex>ur</ex>. &ampersir; ni messo Conch<ex>obor</ex><!--</lb>--> do charait. &ampersir; da<ex>no</ex> do thabairt s&eacute;t &ampersir; indile. &ampersir; doberthar a chomm&eacute;it<!--</lb>--> <mls unit="MS folio" n="112a 20"/> c&eacute;tna i cind bl<ex>iadna</ex>. &ampersir; biaid degcaratrad de. <lb n="13035"/></p>

<p>Ro l&aacute; d&imacr; i socht m&oacute;r int&iacute; M<ex>a</ex>c Da Th&oacute;. Co rrabi tri thr&aacute;th cen dig<!--</lb>--> cen biad. cen chotlod. acht co immorchor &oacute;n taib co araile. Is<!--</lb>--> and ro r&aacute;id a ben riss. Is fota in troscud i ta&iacute;. at&aacute; biad lat cenco<!--</lb>--> n-essara. cid no ta&iacute;. Ni tharat frecra forin mna&iacute;. conid and ro<!--</lb>--> r&aacute;id in b<ex>en</ex>. <lb n="13040"/></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l><mls unit="MS folio" n="112a 25"/>Tucad turbaid chotulta<!--</lb>--></l>
<l>do M<ex>a</ex>c Da Th&oacute; co thech;<!--</lb>--></l>
<l>ros bo&iacute; ni no chomairled<!--</lb>--></l>
<l>cenco labradar fri nech.<!--</lb>--></l></lg>

<pb n="419"/>

<lg n="2">
<l><mls unit="MS folio" n="112a"/> In ben Aso&iacute; doso&iacute; uaim fri fraig <lb n="13045"/></l>
<l>in ferg fene co londgail;<!--</lb>--></l>
<l>a ben trebar dosbeir mod<!--</lb>--></l>
<l>bith dia ceiliu cen chotlud.<!--</lb>--></l></lg>

<lg n="3">
<l>.In fer. Asbert Crimthand Niad Nair.<!--</lb>--></l>
<l>ni thardda do r&uacute;n do mnaib; <lb n="13050"/></l>
<l>run mna n&iacute; maith concelar<!--</lb>--></l>
<l><mls unit="MS folio" n="112a 30"/> maith ar mug ni athenar.<!--</lb>--></l></lg>

<lg n="4">
<l>.In ben. Cid fri mnai atberthasu<!--</lb>--></l>
<l>mani thesbad n&iacute; aire;<!--</lb>--></l>
<l>n&iacute; n&aacute; t&eacute;it do menmasu <lb n="13055"/></l>
<l>teiti menma neich aile.<!--</lb>--></l></lg>

<lg n="5">
<l>.In fer. C&uacute; Mes Roida m<ex>ei</ex>c Da Th&oacute;<!--</lb>--></l>
<l>ba holc lathe etha d&oacute;;<!--</lb>--></l>
<l>dofaeth m&oacute;r fer find fria rath<!--</lb>--></l>
<l>bid lia t<ex>u</ex>rim a chath. <lb n="13060"/></l></lg>

<lg n="6">
<l><mls unit="MS folio" n="112a 35"/> Manip do Chonchob<ex>ur</ex> b&eacute;rthair<!--</lb>--></l>
<l>is derb bid mogda in gn&iacute;m;<!--</lb>--></l>
<l>nocon &fdot;aicebat a &sdot;luaig<!--</lb>--></l>
<l>bas m&oacute; do buaib na do th&iacute;r.<!--</lb>--></l></lg>

<lg n="7">
<l>Mad do Ailill era <lb n="13065"/></l>
<l>leis Falmag darsin t&uacute;aith;<!--</lb>--></l>
<l>dodonb&eacute;ra m<ex>a</ex>c Matach<!--</lb>--></l>
<l>atanebla i luim l&uacute;aith.<!--</lb>--></l></lg>

<lg n="8">
<l>.In .ben. Tathut airle limsa ris<!--</lb>--></l>
<l>n&iacute; holc fri &iacute;armairt n-inni; <lb n="13070"/></l>
<l><mls unit="MS folio" n="112a 40"/> tabair doibsium dib l&iacute;naib.<!--</lb>--></l>
<l>cumma cia thoetsat immi.<!--</lb>--></l></lg>

<lg n="9">
<l>.In fer. In chomairli dob<ex>er</ex>isiu<!--</lb>--></l>
<l>is &iacute; n&iacute;m d&eacute;ni cutal;<!--</lb>--></l>
<l>Ailbe doroid Dia <lb n="13075"/></l>
<l>nicon fes cia o tucad. T.<!--</lb>--></l></lg></body></text></p>

<pb n="420"/>

<p><mls unit="MS folio" n="112a"/> Iar sin at<ex>r</ex>aacht suas &ampersir; no mbertaigedar. Bad maith d&uacute;n tra<!--</lb>--> ol se &ampersir; dona haigedaib dodnancatar. Anaitside leis tr&iacute; laa &ampersir; tr&iacute;<!--</lb>--> <mls unit="MS folio" n="112a 45"/> aidche. &ampersir; hairmtgr chuci fo leith techta Connacht. Ro b&aacute;sa tra<!--</lb>--> ar se i n-im&sdot;nim mor &ampersir; cuntabairt m&oacute;ir coro gl&eacute; dam .i. doratusa <lb n="13080"/> in coin do Ail<ex>ill</ex> &ampersir; do Meidb. &ampersir; tecat ar cend in chon co sochraid &ampersir;<!--</lb>--> ros bia lind &ampersir; biad. &ampersir; bertait in coin. &ampersir; is fo chen d&oacute;ib. Buidig<!--</lb>--> <mls unit="MS folio" n="112b"/> techta &#x2016; Connacht dond athesc. Luid iar sin co tec<ex>h</ex>taib Ul<ex>ad</ex>.<!--</lb>--> Doratusa tr&aacute; ar se asmo chuntabairt in coin do Chonch<ex>obur</ex>. &ampersir;<!--</lb>--> bid uallach tiastar ara chend .i. formna mathe Ul<ex>ad</ex>. Bertait <lb n="13085"/> ascada &ampersir; ros bia failte. Budig techta Ul<ex>ad</ex>.<!--</lb>--></p>

<p><mls unit="MS folio" n="112b 5"/> I n-oenl&oacute; i&mmacr; ro dalaitseom et<ex>er</ex> anair &ampersir; aniar. Niro follaiged<!--</lb>--> leosom da<ex>no</ex> t&aacute;ncatar da coiced Her<ex>end</ex> i n-oenl&oacute; co mb&aacute;tar i<!--</lb>--> ndorus bruidni M<ex>ei</ex>c Da Th&oacute;. Ticseom f&eacute;in immach &ampersir; dogn&iacute; failte<!--</lb>--> friu. Nirobar fachlisem a &oacute;cu. ar apaide is mo chen duib. Tait <lb n="13090"/> <mls unit="MS folio" n="112b 10"/> issin les. Lotar iarum uili isin &mdot;bruidin. Leth in tigi da<ex>no</ex> la<!--</lb>--> Conn<ex>achta</ex> &ampersir; in leth aile la Ulto. Nirbo bec da<ex>no</ex> in tech. secht<!--</lb>--> &ndot;doruiss ind. &ampersir; l. imdad et<ex>er</ex> ce<ex>ch</ex> da dorus. Niptar aigthe carat<!--</lb>--> im &fdot;leid i&mmacr; b&aacute;tar isin taig. Sochaide d&iacute;b ro &fdot;uachtnaig fri araile.<!--</lb>--> <mls unit="MS folio" n="112b 15"/> Tri ch&eacute;t bl<ex>iadan</ex> ria &ndot;gein Chr<ex>ist</ex> ro bo&iacute; in cocad et<ex>u</ex>rru. Marbthair <lb n="13095"/> d&oacute;ib da<ex>no</ex> in mucc M<ex>ei</ex>c Da Th&oacute;. Tri fichit gamnach coa biathadsaide<!--</lb>--> co cend .uii. &mdot;bl<ex>iadan</ex>. Tri neim i&mmacr; no b&iacute;ata coro lathea &aacute;r fer<!--</lb>--> &ndot;Her<ex>end</ex> impi.<!--</lb>--></p>

<p>Tucad d&oacute;ib i.arum in mucc. &ampersir; .x&#x026B;. dam dia tarsnu cenmotha in<!--</lb>--> biad archena. M<ex>a</ex>c Da Tho fessin icond &fdot;erdaigsecht. Mo chen <lb n="13100"/> <mls unit="MS folio" n="112b 20"/> duib ar se ni dabar samail <corr sic="risssin">rissin</corr> ataat aige &ampersir; mucca la Laigniu. A<!--</lb>--> testa desin mairfider d&uacute;ib imbarach. Is maith in mucc ar<!--</lb>--> Conch<ex>obor</ex>. Is maith i&mmacr; ar Ail<ex>il</ex>l. Cinnas rainnfither in mucc a<!--</lb>--> Chonch<ex>obuir</ex> ar Ail<ex>il</ex>l. Cinnas ar Bricriu m<ex>a</ex>c Carb<ex>ada</ex> an&uacute;asane.<!--</lb>--> <mls unit="MS folio" n="112b 25"/> bale i taat l&aacute;ith gaile fer &ndot;Her<ex>end</ex> acht a rraind ar galaib &ampersir; ar <lb n="13105"/> chomramaib &ampersir; dorat c&aacute;ch dib buille dar sr&oacute;in a cheile riam. Dentar<!--</lb>--> ar Ail<ex>il</ex>l. Is c&oacute;ir ar Conch<ex>obor</ex>. At&aacute;t gillai d&uacute;n is taig ro imthigitar<!--</lb>--> in cocr&iacute;ch. <!--</lb>--></p>

<p>Ricfait<ex>er</ex> a les do gillai innocht a Chonch<ex>obuir</ex> ar Senlaech Arad<!--</lb>--> <mls unit="MS folio" n="112b 30"/> a lLuachraib Conalad aniar. Ba menic ag m&eacute;th d&iacute;b d'&fdot;acbail <lb n="13110"/> ac<ex>u</ex>msa &ampersir; rota Luachra Dedad f&oacute; t&oacute;in. Ba m&eacute;thiu a n-ag foracbaisiu<!--</lb>--> ocainni .i. do brathair fad&eacute;in .i. Cruachniu m<ex>ac</ex> R&uacute;adluim a<!--</lb>--> Cruachnaib Conalad. Nirbo &fdot;errsaide ar Lug<ex>aid</ex> m<ex>a</ex>c Con ru&iacute;<!--</lb>--> <mls unit="MS folio" n="112b 35"/> and&aacute;s in Loth Mor m<ex>ac</ex> Fergusa m<ex>ei</ex>c Leti foracbad la Echb&eacute;l m<ex>ac</ex><!--</lb>--></p>


<pb n="421"/>

<p><mls unit="MS folio" n="112b"/> Dedad i Temair Lochra. Cinnas fir lib ol Celtchair m<ex>ac</ex> Uth<ex>echair</ex> <lb n="13115"/> Co&ndot;ganchness m<ex>a</ex>c Dedad do marb<ex>ad</ex> damsa &ampersir; a chend do b&eacute;im de.<!--</lb>--> Immotarla tr&aacute; d&oacute;ib fo de&oacute;id. co tarat in t-oin&fdot;er for firu Her<ex>end</ex><!--</lb>--> <mls unit="MS folio" n="112b 40"/> .i. Cet m<ex>a</ex>c Mat<ex>ach</ex>. Dof&uacute;argaibside i&mmacr; fair a gasced uas gaiscedaib<!--</lb>--> in t&sdot;luaig. &ampersir; ro gab sc&iacute;n inna laim &ampersir; dessid ocon muicc. Fagabar<!--</lb>--> tra ar se do &fdot;eraib Her<ex>end</ex> tairismi comrama frimsa &#x026B; l&eacute;cud na <lb n="13120"/> mmucci do raind dam. Rosl&aacute; i socht na hUlto. Atchi a Loegaire<!--</lb>--> <mls unit="MS folio" n="112b 45"/> or Conch<ex>obor</ex>. Niba f&iacute;r ar Loeg<ex>aire</ex> Cet do raind na mucce arar<!--</lb>--> mbelaibni. An bic a Loegaire corot acilliur ar Cet. Is b&eacute;s d&uacute;ibsi<!--</lb>--> <mls unit="MS folio" n="113a"/> infar nUltaib ar Cet. ce<ex>ch</ex> m<ex>a</ex>c gaibes gaisced acaib &#x2016; is cucainni<!--</lb>--> cend a baire. Dochuadaisiu da<ex>no</ex> isin cocr&iacute;ch. immatarraid d&uacute;n <lb n="13125"/> inti. foracbais in roth &ampersir; in carpat &ampersir; na heocho. Atrullais fein &ampersir;<!--</lb>--> gai triut. Nis toirchi in muicc fon innasin. Dessids<ex>id</ex>e da<ex>no</ex>.<!--</lb>--> <mls unit="MS folio" n="113a 5"/> Niba f&iacute;r or laech find m&oacute;r dodechaid assind imdai Cet do raind<!--</lb>--> na mucci arar mb&eacute;laibni. Coich and so or Cet. Is ferr do laech<!--</lb>--> andaisiu or cach. Oengus m<ex>a</ex>c Lama Gabaid sin do Ultaib. Cid <lb n="13130"/> dia ta Lam Gabuid for th' athairsiu or Cet. Cid &aacute;m. Rofetarsa<!--</lb>--> <mls unit="MS folio" n="113a 10"/> or Cet. Dochuadusa sair fecht and. Eigther immum. doroich<!--</lb>--> c&aacute;ch. Doroich da<ex>no</ex> L&aacute;m. Tarlaic urchor do gai m&oacute;r damsa.<!--</lb>--> Dosl&eacute;icimse da<ex>no</ex> dosom in &ndot;gai cetna co mben a laini de co mbui<!--</lb>--> for l&aacute;r. Cid dob&eacute;rad a m<ex>a</ex>c do chomram frimsa. T&eacute;it Oengus <lb n="13135"/> ina suide.<!--</lb>--></p>

<p>In comram do thairisem beus or Cet &#x026B; in mucc do raind damsa.<!--</lb>--> <mls unit="MS folio" n="113a 15"/> Niba f&iacute;r a rraind duitsiu chetumus ar laech find m&oacute;r de Ultaib.<!--</lb>--> Cia and so or Cet. Eogan m<ex>ac</ex> Durthacht sin ar c&aacute;ch .i. r&iacute; Fernmaigi.<!--</lb>--> Atchonnarcsa riam or Cet. Cia airm indom &fdot;acca ar Eogan. I <lb n="13140"/> ndorus do thaige oc tabairt tana b&oacute; uait. Ro h&eacute;ged immumsa<!--</lb>--> <mls unit="MS folio" n="113a 20"/> isin t&iacute;r. Tanacaisiu fon &eacute;gim. Ro thelgs gai &fdot;ormsa co rraba<!--</lb>--> asmo sc&iacute;ath. Dollecimse duitsiu in &ndot;gai cetna. co lluid tret chend.<!--</lb>--> &ampersir; co mbert do &sdot;&uacute;il asdo chind. Atotchiat fir Her<ex>end</ex> co n-&oacute;en&sdot;&uacute;il.<!--</lb>--> Messe tall in t&sdot;&uacute;il aile asdo chind. Dessid<ex>sid</ex>e da<ex>no</ex>. <lb n="13145"/></p>

<p><mls unit="MS folio" n="113a 25"/> Frithalid da<ex>no</ex> a Ulto. in comram beus ar Cet. Nis raindfe<!--</lb>--> innossa ar Munremor m<ex>a</ex>c Gergind. Inn &eacute; seo Munremur ar Cet.<!--</lb>--> Is me ro glan mo g&oacute; fo deoid a Munremur or Cet. N&iacute; &fdot;uilet tr&iacute;<!--</lb>--> thr&aacute;th and o thucusa tri la&iacute;chcind uait im chend do ch&eacute;tm<ex>ei</ex>c ast<!--</lb>--> &fdot;erund. Dessids<ex>id</ex>e da<ex>no</ex>. <lb n="13150"/></p>

<p><mls unit="MS folio" n="113a 30"/> In comram beus or Cet. Rot bia s&oacute;n ar Mend m<ex>ac</ex> Salcholcan.<!--</lb>--> Cia so or Cet. M<ex>en</ex>d or c&aacute;ch. Cid ane or Cet. m<ex>a</ex>c na mbachlach<!--</lb>--> cusna lesanmannaib do chomram chucum. Ar ba &uacute;aimse &fdot;&uacute;air<!--</lb>--> th' athair in t-ainmsin .i. Messe ra ben a &sdot;ail de do chlaidiub conna<!--</lb>--></p>


<pb n="422"/>

<p><mls unit="MS folio" n="113a"/> ruc acht oenchoss &uacute;aim. Cid dob&eacute;rad m<ex>a</ex>c ind oenchoisseda <lb n="13155"/> <mls unit="MS folio" n="113a 35"/> chucum. Dessids<ex>id</ex>e da<ex>no</ex>.<!--</lb>--></p>

<p>In comram beus or Cet. Rot bia or laech l&iacute;ath m&oacute;r forgr&aacute;nna<!--</lb>--> do Ultaib. Cia so or Cet. Celtchair m<ex>a</ex>c Cuth<ex>echair</ex> sin or c&aacute;ch.<!--</lb>--> An bic a Chel<ex>tchair</ex> or Cet manip dom thuarcain fo chet&oacute;ir. Ro<!--</lb>--> <mls unit="MS folio" n="113a 40"/> tanacsa a Chel<ex>tchair</ex> co dorus do thigi. Fo heged immum. T&aacute;nic <lb n="13160"/> c&aacute;ch. Tanacaisiu da<ex>no</ex>. Dotluid i mbernai armo chindsa.<!--</lb>--> doreilgis gae damsa. Ro thelgiusa gai n-aill chucutsu. co ndechaid<!--</lb>--> triat liasait. &ampersir; tria uacht<ex>ur</ex> do m<ex>a</ex>craille. Ata&iacute; <ex>co</ex> &ndot;galur &fdot;&uacute;ail<!--</lb>--> <mls unit="MS folio" n="113a 45"/> ond &uacute;airsin. noco rucad m<ex>a</ex>c &#x026B; ingen duit ond uairsin. Cid dotb&eacute;rad<!--</lb>--> chuc<ex>u</ex>msa. Dessids<ex>id</ex>e da<ex>no</ex> <lb n="13165"/></p>

<p>In comram beus or Cet. Rot bia son or Cuscraid M<ex>en</ex>d Macha<!--</lb>--> m<ex>ac</ex> Conch<ex>obuir</ex>. Cuich seo ar Cet. Cuscraid or c&aacute;ch. Is adbar<!--</lb>--> <mls unit="MS folio" n="113b"/> r&iacute;g &#x2016; ar deilb. ni buide frit or in gilla. Maith or Cet. Cucainn<!--</lb>--> cetna thanacais do ch&eacute;tgasciud a gillai. immatarraid d&uacute;n issin<!--</lb>--> chocrich. foracbais trian do munt<ex>ir</ex>e. &ampersir; is aml<ex>aid</ex> dochuadais &ampersir; <lb n="13170"/> <mls unit="MS folio" n="113b 5"/> gai triat bragit. conna hetai focul fort chend i c&oacute;rai ar ro loitt in gai<!--</lb>--> f&eacute;thi do braget. Conid C&uacute;scraid M<ex>end</ex> atotchomnaic ond uairsin.<!--</lb>--> Dorat tra fon n-innasin ail forsin c&oacute;iced uile.<!--</lb>--></p>

<p>In tan d&imacr; ro mbertaigestar ocon muicc &ampersir; sc&iacute;an inna l&aacute;im. co<!--</lb>--> n-accatar Conall Cernach is tech. Is and tarblai&ndot;g for l&aacute;r in taige. <lb n="13175"/> <mls unit="MS folio" n="113b 10"/> Ferait Ul<ex>aid</ex> i&mdot; failte m&oacute;ir fri Conall. Is and rola Conchob<ex>or</ex><!--</lb>--> in cennide dia chind &ampersir; rod mbertaigedar. Is maith lind ar cuit<!--</lb>--> do thairiuc ar Conall. Cia rannas d&uacute;ib. Ro dd&eacute;t dond &fdot;ir nod<!--</lb>--> ranna ar Conch<ex>obor</ex> .i. Cet m<ex>a</ex>c Matach. In fir a Chit ar Conall<!--</lb>--> tusso do raind na mmuicce. Is and asbert Cet. <lb n="13180"/></p>

<p><text type="poem"> <body>
<lg type="verse" n="1">
<l><mls unit="MS folio" n="113b 15"/> .R. Fo chen Conall.<!--</lb>--></l>
<l>cride licce.<!--</lb>--></l>
<l>londbruth loga.<!--</lb>--></l>
<l>luchair ega.<!--</lb>--></l>
<l>gus fland ferge. <lb n="13185"/></l>
<l>fo ch&iacute;ch curad.<!--</lb>--></l>
<l>crechtaig cathb&uacute;adaig<!--</lb>--></l>
<l>ad comsa m<ex>a</ex>c Findchoeme frim.<!--</lb>--></l></lg></body></text></p>

<p>conid and atb<ex>ert</ex> Conall. <!--</lb>--></p>

<pb n="423"/>

<p><text type="poem"> <body>
<lg type="verse" n="1">
<l><mls unit="MS folio" n="113b"/> .R. Fo chen Cet <lb n="13190"/></l>
<l>Cet m<ex>a</ex>c Matach.<!--</lb>--></l>
<l>magen curad<!--</lb>--></l>
<l>cride n-ega.<!--</lb>--></l>
<l>eithre n-ela.<!--</lb>--></l>
<l>eirr tr&eacute;n. Tressa <lb n="13195"/></l>
<l>trethan &aacute;gach<!--</lb>--></l>
<l><mls unit="MS folio" n="113b 20"/> ca&iacute;n tarb tn&uacute;thach<!--</lb>--></l>
<l>Cet m<ex>a</ex>c Magach.<!--</lb>--></l></lg></body></text></p>

<p>Bid m<ex>en</ex>d inar n-imchomrucni &oacute;n ar Conall &ampersir; bid m<ex>en</ex>d inar<!--</lb>--> n-imscarad. bid airscela la fer &mdot;brot. bid fiadnaisi la fer manath. <lb n="13200"/> adcichset airg loman londgliaid fer dar fer is taig seo innocht.<!--</lb>--> <mls unit="MS folio" n="113b 25"/> Eirg &oacute;n muicc d&imacr; or Conall. Cid da<ex>no</ex> dot b&eacute;radsu chucci ar<!--</lb>--> Cett. Is fir or Conall do chungid chomraime chucumsa. Dob&eacute;r<!--</lb>--> oenchomram duit a Cheit ar Conall. To&ndot;gu na to&ndot;gat mo thuath<!--</lb>--> ora gabus gai im l&aacute;im na<ex>ch</ex> menic ro b&aacute; cen chend Connachtaig f&oacute;m <lb n="13205"/> chind oc cotlud. &ampersir; cen guin duine cech oenl&aacute; &ampersir; cech oenaidchi.<!--</lb>-->
<mls unit="MS folio" n="113b 30"/> Is fir or Cet at ferr do l&aacute;ech and&oacute;sa. Mad Anluan no beth is taig<!--</lb>--> doberad comram ar araile duit. Is anim d&uacute;n na fil is taig. At&aacute;<!--</lb>--> i&mmacr; ar Conall ic tabairt chind &Aacute;nl&uacute;ain assa chriss &ampersir; nos leice do<!--</lb>--> Chet ara bruinni co rroimid a loim fola fora beolu. Ro gabside <lb n="13210"/> <mls unit="MS folio" n="113b 35"/> i&mmacr; &oacute;n muic. &ampersir; dessid Conall aicce.<!--</lb>--></p>

<p>Tecat don chomram a fechtsa ar Conall. Ni fr&iacute;th &oacute;n la Connachta<!--</lb>--> laech a thairismi. Doratad i&mmacr; damdabach dona bocc&oacute;tib immi<!--</lb>--> imm chuairt ar ro bo&iacute; drochcostud is taig do chloendiburgun la<!--</lb>--> drochdui<ex>n</ex>i. Luid iarum Conall do raind na mmucci &ampersir; gebid <lb n="13215"/> <mls unit="MS folio" n="113b 40"/> da<ex>no</ex> cend in tarra ina beolo co rr&aacute;nic d&oacute; raind na mmucci. ra<!--</lb>--> suig in tairr .i. aere ind n&oacute;nbair conna fargaib n&iacute; de.<!--</lb>--></p>

<p>Ni tharat i&mmacr; do Chonnac<ex>htaib</ex> acht a da cois na mmucci fo br&aacute;git.<!--</lb>--> Ba bec da<ex>no</ex> la Connac<ex>hta</ex> a cuit. Atragatsaide. Atragat da<ex>no</ex><!--</lb>--> Ulaid co rriacht c&aacute;ch araile. Ro bo&iacute; tr&aacute; builli dar &oacute; i suidiu. <lb n="13220"/> <mls unit="MS folio" n="113b 45"/> comba comard ra &sdot;liss in taige in carnail ro ba&iacute; for lar in<!--</lb>--> taigi. <ex>co m</ex>batar na srotha don chr&uacute; forsna dorsi. Maidit<ex>h</ex> da<ex>no</ex><!--</lb>--> na sluaig forna dorsi co rralsat grith m&oacute;r co suifed fuil mol for l&aacute;r<!--</lb>--> <mls unit="MS folio" n="114a"/> ind liss .i. cach oc truastad &#x2016; a cheile. Is and gabais Fergus d&oacute;ib<!--</lb>--> dair m&oacute;r ro bo&iacute; for l&aacute;r ind liss assa fremaib. Maidit immach <lb n="13225"/> da<ex>no</ex> asind liss. Doberar in cath i ndorus ind liss.<!--</lb>--></p>


<pb n="424"/>

<p><mls unit="MS folio" n="114a"/> Is and luid m<ex>a</ex>c Da Th&oacute; immach &ampersir; in c&uacute; inna l&aacute;im coro leiced<!--</lb>--> <mls unit="MS folio" n="114a 5"/> et<ex>ur</ex>ro. d&uacute;s cia d&iacute;b no thogad .i. r&uacute;s con. Dora&iacute;ga in c&uacute; Ulto.<!--</lb>--> &ampersir; ro leci for &aacute;r Connacht ar ro mebaid for Connachta. Asberatsom<!--</lb>--> iss i mmaigib Ailbe ro gab in c&uacute; fertais in charpait fo Ail<ex>il</ex>l &ampersir; fo <lb n="13230"/> Meidb. Is and don&aacute;raill Fer Loga ara Ail<ex>el</ex>la &ampersir; Medba .i. co rrala<!--</lb>--> <mls unit="MS folio" n="114a 10"/> a cholaind for leth. &ampersir; coro an a chend i fertais in charp<ex>ait</ex>. Atberat<!--</lb>--> da<ex>no</ex> is de at&aacute; Mag Ailbe .i. Ailbe ainm in chon.<!--</lb>--></p>

<p>Dolluid a mmaidm andes for Beluch Mugna se<ex>ch</ex> Ro&iacute;rind. for<!--</lb>--> &Aacute;th Midbine i mMastin sech Druim Criaig fris rat<ex>er</ex> Cell Dara <lb n="13235"/> <mls unit="MS folio" n="114a 15"/> indiu. sech R&aacute;ith Imgain. i Fid &ndot;Gaible. do &Aacute;th M<ex>a</ex>c Lugnai.<!--</lb>--> sech Druim Da Maige. for Drochet Cairp<ex>ri</ex>. oc &Aacute;th Chind Chon i<!--</lb>--> mBiliu. is and ro l&aacute; cend in chon asin charput. Ic techt iar fraechrud<!--</lb>--> Mide s&iacute;ar. is and donarlaic Fer Loga isin fraech .i. ara Ail<ex>el</ex>la. &ampersir;<!--</lb>--> ro li&ndot;g isin carput iar c&uacute;l C<ex>on</ex>ch<ex>obuir</ex> corra gaib a chend dar aiss.13240<!--</lb>--> <mls unit="MS folio" n="114a 20"/> Beir buide n-anacuil a Chonch<ex>obuir</ex> ar se. T'&oacute;gr&iacute;ar ar Conch<ex>obor</ex>.<!--</lb>--> Niba m&oacute;r ar Fer Loga .i. mo breith latt do Emain Macha. &ampersir; mn&aacute;<!--</lb>--> oentama Ul<ex>ad</ex> &ampersir; a n-ingena m<ex>a</ex>cdacht do gab<ex>ail</ex> cepoce ce<ex>cha</ex> n&oacute;n a<!--</lb>--> immum. co n-erbrat Fer Loga mo lennansa. Ba &eacute;cen &oacute;n ar n&iacute;<!--</lb>--> <mls unit="MS folio" n="114a 25"/> laimtis chena la Conch<ex>obor</ex>. &ampersir; ra leiced Fer Loga dar &Aacute;th Luain <lb n="13245"/> s&iacute;ar dia bl<ex>iadna</ex> &ampersir; d&aacute; gab<ex>air</ex> Chonch<ex>obuir</ex> leis co n-allaib &oacute;ir friu.<!--</lb>--> Conid desin ro cet.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l>A gillu Conn<ex>acht</ex> nad liu<!--</lb>--></l>
<l>far trommacht ic rada g&oacute;;<!--</lb>--></l>
<l>gilla lasma bec far cuit <lb n="13250"/></l>
<l>for&fdot;odail muicc M<ex>ei</ex>c Da Th&oacute;<!--</lb>--></l></lg>

<lg n="2">
<l>Na tri coicait coica fer.<!--</lb>--></l>
<l>d&oacute; doll&oacute;tar almaib tor;<!--</lb>--></l>
<l><mls unit="MS folio" n="114a 30"/> comrac &uacute;alle im Albe sin<!--</lb>--></l>
<l>bec in cin tria cha&ndot;gin chon <lb n="13255"/></l></lg>

<lg n="3">
<l>Conch<ex>obor</ex> buadach ro thelt.<!--</lb>--></l>
<l>Ail<ex>il</ex>l sluagach &ampersir; Cet.<!--</lb>--></l>
<l>Bodb iar n-araib fora slicht<!--</lb>--></l>
<l>C&uacute; Ch<ex>ulaind</ex> n&iacute; damair cert.<!--</lb>--></l></lg>

<lg n="4">
<l>Congal Aidni and anair. <lb n="13260"/></l>
<l>Fiamuin D&uacute;in Binne don muir;<!--</lb>--></l>
<l>ro ches tairmthechta iar sin.<!--</lb>--></l>
<l>Eogan m<ex>a</ex>c Dairthechta duib.<!--</lb>--></l></lg>

<pb n="425"/>

<lg n="5">
<l><mls unit="MS folio" n="114a"/> Tri m<ex>ei</ex>c Nerai ar l&iacute;n lerg.<!--</lb>--></l>
<l><mls unit="MS folio" n="114a 35"/> tri m<ex>ei</ex>c Uislend cobra &ndot;garg; <lb n="13265"/></l>
<l>Senlaech Arad nadbo borb<!--</lb>--></l>
<l>a Cruachnaib Con Alad ard.<!--</lb>--></l></lg>

<lg n="6">
<l>Dubthach Emna ard a br&iacute;g.<!--</lb>--></l>
<l>Baith&eacute;n Berba breithir bl&aacute;ith.<!--</lb>--></l>
<l>Illand irdairc ilair glond. <lb n="13270"/></l>
<l>Munremur lond Locha S&aacute;il.<!--</lb>--></l></lg>

<lg n="7">
<l>Conall Cernach cruaid a gal<!--</lb>--></l>
<l>Marcan Sinna setrod son;<!--</lb>--></l>
<l><mls unit="MS folio" n="114a 40"/> Celtchair Ulad fer dar fer<!--</lb>--></l>
<l>Lug<ex>aid</ex> Muman m<ex>a</ex>c Tri Con. <lb n="13275"/></l></lg>

<lg n="8">
<l>Fethis Fergus Ailbe n-oll<!--</lb>--></l>
<l>crothais d&oacute;ib dairbre &ndot;dall;<!--</lb>--></l>
<l>gabais fianbrat dar sciath scenb<!--</lb>--></l>
<l>br&oacute;nderg toidlech dar fer fland.<!--</lb>--></l></lg>

<lg n="9">
<l>Ceth<ex>er</ex>n m<ex>a</ex>c Fintain ro b&iacute;th. <lb n="13280"/></l>
<l>uathad a ll&iacute;n forsind &aacute;th.<!--</lb>--></l>
<l><mls unit="MS folio" n="114a 45"/> Fir &oacute;l nEcmacht ermaig sluaig<!--</lb>--></l>
<l>nis relic uad ri se thr&aacute;th.<!--</lb>--></l></lg>

<lg n="10">
<l>Feidlimid co n-ilur thor<!--</lb>--></l>
<l>Loeg<ex>aire</ex> Buadach sair. <lb n="13285"/></l>
<l>ba leth &ndot;dograi immon coin<!--</lb>--></l>
<l>Conaeth m<ex>a</ex>c Mornai nach mair.<!--</lb>--></l></lg>

<lg n="11">
<l>Mora airig aidbli band<!--</lb>--></l>
<l>crodai curaid cumtaig dind;<!--</lb>--></l>
<l>mora fina fortbi chland <lb n="13290"/></l>
<l>m&oacute;ra gialla m&oacute;ra gill. A. &#x2016;<!--</lb>--></l></lg></body></text></p>
</div1>

<pb n="426"/>
<div1 n="4">
<head>Incipit Talland Etair</head>

<p><mls unit="MS folio" n="114b"/> BA&Iacute; fer amnas &eacute;trocar i nHer<ex>ind</ex> .i. Aith<ex>ir</ex>ne Ailg<ex>esach</ex> de<!--</lb>--> Ultaib. Fer ro chunnig a oen&sdot;&uacute;il &oacute;n chaech. &ampersir; no guided in<!--</lb>--> mnai oc lamnad. Is de boi dos<ex>o</ex>m dia lluid for c&uacute;aird a <lb n="13295"/> <mls unit="MS folio" n="114b 5"/> comairli Chonchob<ex>uir</ex>. Is <ex>ed</ex> luide i tosuch chetumus tuathbel Her<ex>end</ex><!--</lb>--> co rrala cuairt Connacht. Is <ex>ed</ex> luide iar<ex>u</ex>m co rr&iacute;g med&oacute;in Her<ex>end</ex><!--</lb>--> et<ex>er</ex>na da Ath Chliath .i. co Ech<ex>aid</ex> m<ex>ac</ex> Luctai co rr&iacute;g descirt<!--</lb>--> <ex>Con</ex>nacht. Luidside dia idnacul ind Athirni co firu Muman dar<!--</lb>--> Sinaind fades. Conna ruca ar ndimda a Ath<ex>ir</ex>ni or Eoch<ex>aid</ex>. <lb n="13300"/> <mls unit="MS folio" n="114b 10"/> ma t&aacute; ocaiind do &sdot;&eacute;taib &#x026B; ma&iacute;nib n&iacute; bas &aacute;il duit co rruca. At&aacute;<!--</lb>--> i&mmacr; or Ath<ex>iune</ex> ind oen&sdot;&uacute;il &uacute;t fil it chind do brith damamsa im durn.<!--</lb>--> N&iacute;ba &eacute;ra i&mmacr; or Eoch<ex>aid</ex> rot bia. Is and dorat in r&iacute; a m&eacute;r fo &sdot;&uacute;il<!--</lb>--> <mls unit="MS folio" n="114b 15"/> co tall assa chind &ampersir; co tarat i ndorn Aitherne. Geib mo l&aacute;im a<!--</lb>--> gillai or in r&iacute; dochum ind us<ex>ci</ex> do nigi mo agthi. D&aacute;lis iarum tri <lb n="13305"/> tonna dond us<ex>ciu</ex> imma agid. In tallad in t&sdot;&uacute;il asmo chind a gillai<!--</lb>--> or in r&iacute;. All amae or in gilla. is d<ex>er</ex>g in derc dot &fdot;uil. Bid ed a<!--</lb>--> <mls unit="MS folio" n="114b 20"/> ainm co br&aacute;th or in r&iacute; .i. Dergderc. Lasin f&eacute;li da<ex>no</ex> daroni in r&iacute;<!--</lb>--> .i. a oen&sdot;&uacute;il do thabairt do chind a enig. Firt feli da<ex>no</ex> dorat Dia<!--</lb>--> d&aacute; &sdot;&uacute;il d&oacute;som. Is desin ro cet. <lb n="13310"/></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l>Suil ind r&iacute;g ramot clothach<!--</lb>--></l>
<l>do Athirne ba brig brethach;<!--</lb>--></l>
<l>sella sillit an tuaraid<!--</lb>--></l>
<l>ercsait cend uallaig nEchach.<!--</lb>--></l></lg>

<lg n="12">
<l><mls unit="MS folio" n="114b 25"/> Et<ex>er</ex> Athirne n-irach <lb n="13315"/></l>
<l>is Echaig &mdot;bald<ex>er</ex>g &mdot;buadach<!--</lb>--></l>
<l>dori&ndot;gne Dia d&uacute;lech<!--</lb>--></l>
<l>im chloichmod s&uacute;lech sluagach. S.<!--</lb>--></l></lg></body></text></p>

<p>Iss <ex>ed</ex> dolluid Ath<ex>irne</ex> iar suide co rrig Muman .i. co Tigerna<!--</lb>--> Tetbuillech. Nira gaib da<ex>no</ex> n&iacute; dia inchaibs<ex>id</ex>e acht ind r&iacute;gan <lb n="13320"/> <mls unit="MS folio" n="114b 30"/> do &fdot;eis leis ind aidchisin. n&oacute; einech fer Muman do brith co br&aacute;th.<!--</lb>--> Ocus ind aidchisin ro assa&iacute;ted in ben is &iacute; ad aig ra &fdot;o&iacute; la Ath<ex>irne</ex><!--</lb>--> do aenig a fir arna ructha a enech.<!--</lb>--></p>

<pb n="427"/>

<p><mls unit="MS folio" n="114b"/> Iss <ex>ed</ex> luide Ath<ex>ir</ex>ne iar sin co lLaigniu co mbo&iacute; i nArd Brestine<!--</lb>--> <mls unit="MS folio" n="114b 35"/> i ndesciurt Maige Fea. &ampersir; tancatar descert Lagen ina agid do <lb n="13325"/> tharcsin s&eacute;t &ampersir; ma&iacute;ne d&oacute; arna digsed issin t&iacute;r. d&aacute;ig na facbad ailche.<!--</lb>--> Ar n&iacute; b&iacute;tis a ma&iacute;ne nach neich fora tabrad ammus mani thabairthe<!--</lb>--> d&oacute;. Ni &fdot;aicfed da<ex>no</ex> athgab&aacute;il t&uacute;ath &#x026B; chen<ex>e</ex>l lasa mairfide som.<!--</lb>--> <mls unit="MS folio" n="114b 40"/> Co tabrad in fer a mnai d&oacute;. no co tabrad a o&iacute;n&sdot;&uacute;il asa chind. no co<!--</lb>--> tabrad a &sdot;aint do &sdot;&eacute;taib &ampersir; ma&iacute;nib. Is ed i&mmacr; tucsom inna m<ex>en</ex>main <lb n="13330"/> ailchi m&oacute;ra d'acb&aacute;il for Laig<ex>nib</ex> coro marbtais Lagin &eacute; co mbetis<!--</lb>--> <mls unit="MS folio" n="114b 45"/> Ulaid do g<ex>r&eacute;</ex>s oca d&iacute;gail for Laigniu. Is and tr&aacute; gabais &aacute;ilgis do<!--</lb>--> desciurt Lagen i mBrestine .i. nad &fdot;acca do s&eacute;taib &#x026B; ma&iacute;nib n&iacute; no<!--</lb>--> gabad uadib. acht ail brethri do &fdot;acb&aacute;il forro co br&aacute;th conna<!--</lb>--> <mls unit="MS folio" n="115a"/> t<ex>ur</ex>gebtais a n-aigthe &#x2016; la Goedelu. mani thucdais d&oacute;s<ex>o</ex>m in s&eacute;t <lb n="13335"/> as dech bo&iacute; is tulaig &ampersir; nad fit<ex>ir</ex> nech is tilaig cia s&eacute;t so &#x026B; cia bale<!--</lb>--> i rrabe.<!--</lb>--></p>

<p>Ba g<ex>re</ex>ss &ampersir; ba imdergad m&oacute;r don t&sdot;l&uacute;ag an&iacute;sin. &ampersir; ro guidetar<!--</lb>--> <mls unit="MS folio" n="115a 5"/> uile Tigerna na nd&uacute;l co tardad fortacht d&oacute;ib im di&ndot;gb&aacute;il d&iacute;b na<!--</lb>--> g<ex>re</ex>ssi rolad forro. Ba&iacute; tra marcach ic airimrim a eich is tilaig. <lb n="13340"/> doscuiched dochum na hairechta. no li&ndot;ged uadib. Fecht and<!--</lb>--> d&imacr; oc soud ind eich dar colptha. Docuridar in t-ech f&oacute;t m&oacute;r da d&iacute;b<!--</lb>--> croib. Niro airig duine isind airiucht coni tarla i n-ucht ind r&iacute;g<!--</lb>--> <mls unit="MS folio" n="115a 10"/> .i. Fergusa Fairge. Co n-accais<ex>id</ex>e a ndelg i n-agid ind &fdot;&oacute;it dond<!--</lb>--> leith on talmain. i rrabatar cethri fichit u&ndot;ga do derg&oacute;r. Cid fil <lb n="13345"/> im uchtsa or in r&iacute; a Ath<ex>ir</ex>ni. Is and asbert Ath<ex>ir</ex>ni.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l>Delg fil i nArd Brestini<!--</lb>--></l>
<l>do chruib eich doridnacht.<!--</lb>--></l>
<l>taris rucad m&oacute;r i&mdot;breth cert<!--</lb>--></l>
<l><mls unit="MS folio" n="115a 15"/> i mbrutt Mani m<ex>eic</ex> Durthacht. <lb n="13350"/></l></lg></body></text></p>

<p>Is &eacute; in delgsin rop &aacute;il damsa or Ath<ex>irne</ex> .i. brathair m'atharsa<!--</lb>--> fodracaib &ampersir; dorat i tal<ex>main</ex> iar maidm &aacute;ir chatha for Ulto .i. cath<!--</lb>--> Brestini. Is and sin doratad d&oacute; in delg. Ocus luid iar sin co<!--</lb>--> Mes Gegra .i. r&iacute; Lagen. Brathair d&oacute; Mes Ro&iacute;dia .i. d&aacute; m<ex>a</ex>c Datho<!--</lb>--> <mls unit="MS folio" n="115a 20"/> in sin. buidir amlabair a mmathair &ampersir; a n-athair. Feraid Mess <lb n="13355"/> Gegra falti m&oacute;ir fri Ath<ex>irne</ex>. Is maith limsa tr&aacute; or Ath<ex>irne</ex> acht<!--</lb>--> co rraib im &fdot;arrad co mmatin. Cid ara tibrind mo mna&iacute; duit ar<!--</lb>--> in r&iacute;. Dot inchaib ol Ath<ex>irne</ex>. Naconom marbasa corop ail<!--</lb>--> <mls unit="MS folio" n="115a 25"/> do Laignib co br&aacute;th. &ampersir; conna hanat Ulaid com digailse forro co<!--</lb>--> br&aacute;th. Mad ar Ultaib nocot biadso falti limsa a Ath<ex>irni</ex>. Rot <lb n="13360"/> bia in ben i&mmacr; dom inchaibse. Ni &fdot;ail i&mmacr; la Ulto oen&fdot;er nos berad<!--</lb>--></p>


<pb n="428"/>

<p><mls unit="MS folio" n="115a"/> acht manis tabraind duitsiu dom inchaib. Is f&iacute;r ol Ath<ex>irne</ex>. Ni<!--</lb>--> anubsa tr&aacute; ditso co rruca oen&fdot;er d'Ultaib do chend &ampersir; do mnai.<!--</lb>--> <mls unit="MS folio" n="115a 30"/> Ni g&eacute;bthar inniut or in r&iacute;. Rot bia falti. Foid in ben leis .i.<!--</lb>--> Buan ben Mess Gegra. Ocus anaid Ath<ex>irne</ex> for c&uacute;aird Lagen co <lb n="13365"/> cend &mdot;bl<ex>iadna</ex> co tuc tri coicdu rigan do mnaib flatha &ampersir; dagdoine<!--</lb>--> Lagen dia mbreith dia th&iacute;r leis.<!--</lb>--></p>

<p><mls unit="MS folio" n="115a 35"/> Maith tra a gillai ol Ath<ex>irne</ex> fria gilla airg damsa co Ulto co<!--</lb>--> tisat imm agid. Is dochu biaid imr&aacute;dud la Laigniu formsa immon<!--</lb>--> &mdot;braitse acht co nnechur dia n-inchaib. <lb n="13370"/></p>

<p>Dollotar d&imacr; Lagin do chelebrad do Ath<ex>irniu</ex> co mbatar oc Telchuine<!--</lb>--> fri Ath Cliath at&uacute;aid. Celebraid d&oacute;ib iarum inti Ath<ex>irne</ex> &ampersir; ni<!--</lb>--> <mls unit="MS folio" n="115a 40"/> &fdot;argaib bennachtain. &ampersir; ni thuc a n-aill. Ba olc i&mmacr; la Lagnib a<!--</lb>--> mnaa do brith uadib i mbrait do Ultaib. O thanic do ainiuch<!--</lb>--> Lagen inti Ath<ex>irne</ex> lotar Lagin do iarmoracht a mbraiti. <lb n="13375"/> Doroachtatar Ul<ex>aid</ex> da<ex>no</ex> i n-iarm&oacute;racht Ath<ex>irni</ex>. Dollotars<ex>id</ex>e dia<!--</lb>--> <mls unit="MS folio" n="115a 45"/> thessaircainseom. Fechair cath immi fo ch&eacute;toir. Maidid for<!--</lb>--> Ulto. co ndechatar la muir sair co rragbad Etar forru. No&iacute; trath<!--</lb>--> d&oacute;ib i nEt<ex>ur</ex> cen dig cen biad. acht meni esbetar &sdot;&aacute;l in mara. &#x026B;<!--</lb>--> mani dotar in n-uir. Secht c&eacute;t b&oacute; i&mmacr; la Ath<ex>irne</ex> for l&aacute;r in d&uacute;ni &#x2016; <lb n="13380"/> <mls unit="MS folio" n="115b"/> &ampersir; ni rabi la Ulto m<ex>a</ex>c na fer no blaissed a loimm acht no leicthe<!--</lb>--> fon aill a mblegon. arna taiscelad nech dib et<ex>ir</ex> a biadsom do<!--</lb>--> blassacht. &ampersir; dobertis cuci ind &fdot;ir athgoeti &ampersir; n&iacute; leiced banne ina.<!--</lb>--> <mls unit="MS folio" n="115b 5"/> cend co n-aplaitis a n-o&iacute;nur do chr&oacute;galar. &ampersir; teigtis niathe Ulad<!--</lb>--> cuce i n-impide im dig do Chonchob<ex>ur</ex> &ampersir; nocon &eacute;ta &uacute;ad. Conid <lb n="13385"/> ed no &fdot;urad Chonch<ex>obor</ex> a ndobered ind ingen fora mmuin ot&aacute;<!--</lb>--> Emuin Macha im thr&aacute;th n&oacute;na b&eacute;us .i. Leborcham is s&iacute; dobered.<!--</lb>--> Mug &ampersir; c<ex>u</ex>mal ro batar i tig Conch<ex>obuir</ex> is &iacute; gein rucad et<ex>ur</ex>ru .i.<!--</lb>--> <mls unit="MS folio" n="115b 10"/> ind ingen Leborcham. Ba dochraid da<ex>no</ex> a delb na ingine .i. a<!--</lb>--> da traigid &ampersir; a da gl&uacute;n inna diaid. a da escait &ampersir; a d&aacute; s&aacute;il rempe. <lb n="13390"/> Is &iacute; toichled Her<ex>ind</ex> i n-oenl&oacute;. Cech m do maith &ampersir; do &sdot;aich<!--</lb>--> dognithea i nHer<ex>ind</ex> adfeided do Chonch<ex>obur</ex> isin Chroibr&uacute;aid<!--</lb>--> deod lai. T<ex>ur</ex>t&iacute;ne tri fichet &mdot;bargen ara cind i cind tened.<!--</lb>--> <mls unit="MS folio" n="115b 15"/> cenmotha a cuit lasin sl&uacute;ag. Is &iacute; tra no bered a chuit do Chonch<ex>obur</ex><!--</lb>--> ara mmuin ot&aacute; Emuin co &Eacute;t<ex>ar</ex>. <lb n="13395"/></p>

<p>No b&iacute;d tra ind imguin et<ex>er</ex> l&aacute; &ampersir; aidchi immon d&uacute;n. Atberat<!--</lb>--> Lagin is s&iacute;at ro chlaidsetar D&uacute;n Etair. At&aacute; B<ex>er</ex>n Chon Cul<ex>aind</ex><!--</lb>--> and cen iadad. No b&iacute;d c&aacute;ch ica g<ex>re</ex>ssacht imma immi. Nith&oacute;<!--</lb>--> ar se c&uacute;al gai immusniada lemsa. No b&iacute;d da<ex>no</ex> Conch<ex>obor</ex> oc<!--</lb>--> <mls unit="MS folio" n="115b 20"/> airbriathrad C<ex>on</ex> Cul<ex>aind</ex> conna rucad a burach immach et<ex>ir</ex> .i. <lb n="13400"/> co tairsed t&oacute;chostul Ulad. ar dochoid Leborcham do thochostul<!--</lb>--> Ul<ex>ad</ex>. co t&iacute;stais i curchaib &#x026B; co tistais ar t&iacute;r dia cobair.<!--</lb>--></p>


<pb n="429"/>

<p><mls unit="MS folio" n="115b"/> Doratad i&mmacr; Mess Dead m<ex>ac</ex> Amargin dalta do Choin Cul<ex>aind</ex><!--</lb>--> m<ex>a</ex>c secht &mdot;bl<ex>iadan</ex> ar cl&eacute;ith ar dorus in d&uacute;ne. &ampersir; nonbur ce<ex>cha</ex><!--</lb>--> <mls unit="MS folio" n="115b 25"/> uaire isind l&oacute; do marb<ex>ad</ex> d&oacute;. &ampersir; geill Ul<ex>ad</ex> do thabairt immach <lb n="13405"/> ce<ex>ch</ex> l&aacute; do Lag<ex>nib</ex> f&oacute; thr&iacute;. &ampersir; a mbreith innund do Mes Dead fo thr&iacute;<!--</lb>--> ar galaib. Combad airsein no imberthea &eacute;comlund i tosaig i<!--</lb>--> nHer<ex>ind</ex>. Iss <ex>ed</ex> tr&aacute; asberatsom in tan rod &ndot;gabsat Ul<ex>aid</ex> i tir<!--</lb>--> <mls unit="MS folio" n="115b 30"/> issind Et<ex>ur</ex> anair. Is and dochotar tri ch&eacute;t laech cosin m<ex>a</ex>c forsin<!--</lb>--> chl&eacute;ith dia marb<ex>ad</ex>. Dorat a b&uacute;riud ass iarum oc beim a chind <lb n="13410"/> de. Co cuala Cu Ch<ex>ulaind</ex>. Is nem maides&#x026B; is muir thr&aacute;ges &#x026B; talam<!--</lb>--> conscara &#x026B; b&uacute;riud mo daltaise oc imb<ex>ir</ex>t ecomluind fair. La sodain<!--</lb>--> focheird Cu Ch<ex>ulaind</ex> bedg immach. Ro&iacute;nti in sluag ina diaid.<!--</lb>--> <mls unit="MS folio" n="115b 35"/> Fechair cath and fo chet&oacute;ir. Trom i&mmacr; in g<ex>re</ex>ss ro lasat. Cr&oacute;da<!--</lb>--> ind imth&oacute;cbail amnas a mb&uacute;rach ro &fdot;ersat na curaid &ampersir; na l&aacute;ith <lb n="13415"/> gaile. Ro co&ndot;gaibthe tr&aacute; na da urgail &oacute; theirt co n&oacute;nai. Maidid<!--</lb>--> iar<ex>u</ex>m for Lag<ex>nib</ex> co turgabsat m&uacute;r derg fri Ulto. ar ba geis do<!--</lb>--> <mls unit="MS folio" n="115b 40"/> Ul<ex>taib</ex> dul dar m&uacute;r &ndot;derg. Ba fe ille &fdot; ba fe innund i&mmacr; in comrac.<!--</lb>--> Dorochratar sochaide m&oacute;r and do Ultaib i frecur in chatha.<!--</lb>--> Dorochair and chetumus Mess Dead m<ex>ac</ex> Amargin. &ampersir; Br&iacute;ann&aacute;n <lb n="13420"/> Brethach. &ampersir; Condla. &ampersir; Beothach &ampersir; Conaed m<ex>ac</ex> Mornai &ampersir; sochaide<!--</lb>--> archena.<!--</lb>--></p>

<p><mls unit="MS folio" n="115b 45"/> Is and sin tra luid Leborcham fothuaid riasin sluag co celmuiniu<!--</lb>--> do mnaib Ul<ex>ad</ex> ar ro batarside i &ndot;g&uacute;ais &ampersir; g&aacute;bud &ampersir; i toirsi m&oacute;ir ond<!--</lb>--> uair ro gabad Et<ex>ur</ex> forsna feraib .i. Mugain Aittenchaith<ex>rech</ex> ben <lb n="13425"/> <mls unit="MS folio" n="116a"/> Chonch<ex>obuir</ex> m<ex>eic</ex> Nesa andtuaid. Feidelm Noichruth<ex>ach</ex> &#x2016; da<ex>no</ex><!--</lb>--> ingen Chonch<ex>obuir</ex> .i. no&iacute; crotha furri &ampersir; ba hailliu ca<ex>ch</ex> cruth araile.<!--</lb>--> Feidelm &Fdot;oltcha&iacute;n and da<ex>no</ex> ben Loegaire Buada ig. Findbec<!--</lb>--> ingen Ech<ex>ach</ex> ben Cheth<ex>ir</ex>n m<ex>eic</ex> &Fdot;intain. Brig Brethach ben<!--</lb>--> Cheltch<ex>air</ex>. Findnige ingen Ech<ex>ach</ex> ben Eogain m<ex>eic</ex> Dur<ex>thacht</ex>. <lb n="13430"/> <mls unit="MS folio" n="116a 5"/> Findch aem ingen Chath<ex>bada</ex> ben Amairgin Iar&ndot;giunnaig.<!--</lb>--> Derb &Fdot;orgaill ben Lug<ex>dach</ex> Riab &ndot;Derg. Emer &Fdot;oltchain ingen<!--</lb>--> Forgaill Man<ex>aig</ex>. ben <ex>Con</ex> Cul<ex>aind</ex> m<ex>eic</ex> &Sdot;ual<ex>taim</ex>. Lendabair<!--</lb>--> ingen Eogain m<ex>eic</ex> Dur<ex>thacht</ex> ben Chonaill m<ex>eic</ex> Amairgin. Niab<!--</lb>--> ingen Chel<ex>tchair</ex> m<ex>eic</ex> Uth<ex>idir</ex> ben Chorm<ex>aic</ex> Con Lon<ex>ges</ex> m<ex>eic</ex> <lb n="13435"/> Conch<ex>obuir</ex>. M&oacute; t <ex>ur</ex>im andro batar do degmnaib and chena.<!--</lb>--> <mls unit="MS folio" n="116a 10"/> Mugain tra ro bo&iacute; oca hacallaimsi na Leborchaimmi. Conid and<!--</lb>--> atbertsi M<ex>ugain</ex>.<!--</lb>--></p>

<p>A ingen a luath a Lebarcham cia Ulto &aacute;na acca. A b&eacute; find<!--</lb>--> &fdot;orusta atchonnarcsa caimchele sliasta i sni m sruth&fdot;ola. Fua <lb n="13440"/> mbui beo cathmil Conch<ex>obor</ex>. Atchonnarc and Coin Cul<ex>aind</ex><!--</lb>--></p>


<pb n="430"/>

<p><mls unit="MS folio" n="116a"/> certlain o ch&uacute;l co ulaig <mls unit="MS folio" n="116a 15"/> cnedmar fadessin essi derga dia luid. Atcon<ex>narc</ex> Loegaire lon-<!--</lb>--> Buad<ex>ach</ex> fria thair culpait tolla imma tho&iacute;bu. tlacht a da b<ex>er</ex>gin<!--</lb>--> buada beb&aacute;rnatar. Atcon<ex>narc</ex> and Brianan bretsatar fir frisa <lb n="13445"/> comarnaic carn. Atcon<ex>narc</ex> and Gabliol lesciol lemnech lug.<!--</lb>--> <mls unit="MS folio" n="116a 20"/> Atcon<ex>narc</ex> and Conla C&aacute;em toib selgatar fri lathraige l&aacute;r.<!--</lb>--> Atcon<ex>narc</ex> and Furbaide Fer Bend for daid ben doensus dergsus<!--</lb>--> asa beirn bu&iacute;. Atcon<ex>narc</ex> and Eogan Eo dia d<ex>er</ex>gdeiss. assa d&iacute;<!--</lb>--> l&aacute;im dobebarnatar fuili folcmara fair. Atcon<ex>narc</ex> and Dubthach <lb n="13450"/> di d&oacute;it lugdaig leosait dessa dlu&ndot;gsius. Atcon<ex>narc</ex> and Lug<ex>aid</ex><!--</lb>--> <mls unit="MS folio" n="116a 25"/> l&iacute;n a m<ex>a</ex>c &mdot;brogsus in n-ind fri durach &ndot;derg. Atcon<ex>narc</ex> and<!--</lb>--> Amairgin artruad ro lassair assa chuthchath cath. Atcon<ex>narc</ex><!--</lb>--> and Fer&gdot;na fer br&iacute;gach fer cetaro raid ria ca<ex>ch</ex> coraid foa dib sebtaib<!--</lb>--> selsus. Atcon<ex>narc</ex> and Auchride augestar fri &sdot;l&uacute;ag &sdot;ains&oacute;is fria <lb n="13455"/> <mls unit="MS folio" n="116a 30"/> n-indeg firu foi f&oacute;. Atcon<ex>narc</ex> and Beothaig beogestar dara &oacute;ir<!--</lb>--> srethius. fuli foa &uacute;n a &sdot;elad fri slas. Atcon<ex>narc</ex> in tudbigid troethas<!--</lb>--> rigr&aacute;tha Rochad r&uacute;adbullech m<ex>ac</ex> find Fatheman fri sellad sl&uacute;ag.<!--</lb>--> Atcon<ex>narc</ex> and in suid sulbair soacallma rosiacht a ardinsci ardr&iacute;gda<!--</lb>--> &uacute;ad ro &sdot;&aacute;raigsetar fir Fercherdne file ind r&iacute;g. Atcon<ex>narc</ex> and <lb n="13460"/> <mls unit="MS folio" n="116a 35"/> Fiachraig n-ail ail ce<ex>ch</ex> ecl&oacute; sa&iacute;r cl&oacute;&oacute;. Atcon<ex>narc</ex> and Conaed<!--</lb>--> cetguinech cetaro r&aacute;id ecrata garg. a r&oacute;e rith ro bith m<ex>ac</ex> Mornai<!--</lb>--> moid no da thoib tuill t&uacute;aim i timargar ith. Atcon<ex>narc</ex> and Corp<ex>re</ex><!--</lb>--> cend fir fris tnuid fris brunniu ben. Atconn<ex>arc</ex> and na riglasra<!--</lb>--> <mls unit="MS folio" n="116a 40"/> lassait am<ex>al</ex> o&iacute;na&iacute;bill. garg a &ndot;gascid gn&iacute;m gaile glaine. &ampersir; Gormainech13465<!--</lb>--> Mane Milscothach &ampersir; Ailil scel &ampersir; Toscel Dures &ampersir; Ret &ampersir; Bricriu bertsait<!--</lb>--> m&oacute;rgnimu no&iacute; m<ex>ei</ex>c Carbada uill. Atcon<ex>narc</ex> and Conall
 Cer<ex>nach</ex><!--</lb>--> co coscraib co fodbaib co finnib co n-&eacute;tib co n-&oacute;caib ro r&aacute;ith br&iacute;ga<!--</lb>--> in cathmil<ex>ed</ex> cathb&uacute;adach cathchoscrach Conall c&aacute;em Cernach.<!--</lb>--> <mls unit="MS folio" n="116a 45"/> Atcon<ex>narc</ex> and &Uacute;ara<sup resp="BBE">tha</sup>ch Cethern claidebr&uacute;ad conmeil morgala. <lb n="13470"/> asa Eolairg ard. Atcon<ex>narc</ex> and fo&fdot;uaratar Ulaid n&iacute;rro selgatar<!--</lb>--> am<ex>al</ex> liges milchobur mil millsiund sastund s&aacute;l mara m&oacute;ir tethragtar<!--</lb>--> <mls unit="MS folio" n="116b"/> cu tig. Atcon<ex>narc</ex> and do &fdot;uargaib &#x2016; ur immon s&iacute;nsetar fir.<!--</lb>--></p>

<pb n="431"/>

<p><mls unit="MS folio" n="116b"/> immo tarlaicthe c<ex>r</ex>anna imma cloiset gai. sciathgal sc&iacute;ath i cath.<!--</lb>--> i cathbuadaig Ul<ex>aid</ex> iar n-araib ecrat iar fortbiu buiden iar slige air. <lb n="13475"/> <mls unit="MS folio" n="116b 5"/> Dofairchelsa giall ce<ex>ch</ex> coicid de choicedaib Her<ex>end</ex> acht coiced<!--</lb>--> Galion dofil ticfat tadbat fibait i nEmam dadaig. Ulaid ollchathaig<!--</lb>--> frithalid na firu dosfil far &ndot;dochum acht ce<ex>ch</ex>a torchair d&iacute;b iss ed<!--</lb>--> celmaini in sein ruc Leborcham do mnaib Ulad.<!--</lb>--></p>

<p><mls unit="MS folio" n="116b 10"/> Luid Conall Cer<ex>nach</ex> a oenur i n-iarmoracht Lagen do d&iacute;gail a <lb n="13480"/> brathar dorochratar sin chath .i. Mes Dead. &ampersir; Loegaire. Iss <ex>ed</ex><!--</lb>--> luide for &Aacute;th Cl&iacute;ath sech Dr<ex>u</ex>mmainech for Uib Gabla. i Forcarthain.<!--</lb>--> sech Uachtur Aird. sech N&aacute;s. do Chlo&iacute;nud.<!--</lb>--></p>

<p>O r&aacute;ncatar d&imacr; Lagin a t&iacute;r luid c&aacute;ch &uacute;adib dia bailiu. Anais i&mmacr;<!--</lb>--> <mls unit="MS folio" n="116b 15"/> Mess Gegra for Cass&aacute;n Chlo&iacute;nta a o&iacute;nur. &ampersir; a ara dar &eacute;ssi in t&sdot;l&uacute;aig. <lb n="13485"/> Contuiliubsa coll&eacute;ic ar in t-ara fri Mess Gegra. &ampersir; contolasu iarum.<!--</lb>--> Maith lim ar in r&iacute;. A mbu&iacute; Mess Gegra oc descin ind usci co n-acca<!--</lb>--> in cnoi ar fut na haband chuce. Ba meti cend fir in chn&uacute;. Luid<!--</lb>--> s&iacute;s fadessin conos tuc cuce &ampersir; ros teind cona sc&iacute;n. &ampersir; foracaib<!--</lb>--> <mls unit="MS folio" n="116b 20"/> leth ind eitne don gillu. Co n-&fdot;accaiseom in &ndot;gilla do&fdot;urcbad &oacute;n <lb n="13490"/> tal<ex>main</ex> triana chotlud. &ampersir; ro d&uacute;sig in gilla iar sin assa chotlud.<!--</lb>--> Cid ta&iacute; a gillai ol in r&iacute;. Drochaslingi atchonnarc ar in gilla. Gaib<!--</lb>--> na eochu a gillai ol in r&iacute;. Ro gab in gilla na eochu. In chn&uacute;<!--</lb>--> <mls unit="MS folio" n="116b 25"/> d&oacute;dais ar in gilla. iss <ex>ed</ex> or in r&iacute;. In farcbais a lleth damsa or in<!--</lb>--> gilla. Minigid lim chetus or in r&iacute;. In fer doid in &mdot;bec sechomsa <lb n="13495"/> ar in gilla no issad a mm&oacute;r. Ro bo&iacute; a l&aacute;m in r&iacute;g fria agid ind<!--</lb>--> r&iacute;g co lleith ind eitni. Donaidlend in gilla co claidiub co tall a<!--</lb>--> <mls unit="MS folio" n="116b 30"/> l&aacute;im de. Olc sin a gillai ol in r&iacute;. Oslaic mo dorn at&aacute; leth ind<!--</lb>--> eitni and. Am<ex>al</ex> atchonnairc in gilla an&iacute;sin imso&iacute; in claideb friss<!--</lb>--> fessin co ndechaid triana druim s&iacute;ar. Fe amae a gill<ex>ai</ex> or in r&iacute;. <lb n="13500"/> Indlid fessin inti Mess Fegra a charput &ampersir; dobeir a laim ind ara<!--</lb>--> <mls unit="MS folio" n="116b 35"/> belaib. In tan d&imacr; luid assinn &aacute;th s&iacute;ar. Is and doriacht Conall<!--</lb>--> issin &aacute;th anair. Amlaid sin a Mess Gegra ar Conall. At&oacute; sund<!--</lb>--> ar Mess Gegra. C<ex>ei</ex>s<ex>t</ex> iarum ar Conall. Cid ail and ar Mess G<ex>egra</ex><!--</lb>--> acht int&iacute; dia ndligi &fdot;iachu saig fair ca<ex>ch</ex> cumung rot b&eacute;. At&aacute;t <lb n="13505"/> mo brathir latsu ar Conall. Ni 'm chriss at&aacute;t ar Mess G<ex>egra</ex>. Bid<!--</lb>--> <mls unit="MS folio" n="116b 40"/> anim &oacute;n ar Conall. Ni f&iacute;r &ndot;gascid ar Mes G<ex>egra</ex>. comrac frimsa co<!--</lb>--> n-oenl&aacute;im. Is fair bias ar Conall. cumrigfithir mo l&aacute;m dom tha&iacute;bse<!--</lb>--> ar Conall. Co bo thr&iacute; ro cumriged l&aacute;m Chonaill Cher<ex>naig</ex> dia tho&iacute;b.<!--</lb>--> Ro thuairc cach a ch&eacute;ile comb&oacute; derg ind aband d&iacute;b. Fortressiu <lb n="13510"/> iarum a chluchi in Chonaill. Maith tr&aacute; a Chonaill ar Mes G<ex>egra</ex>.<!--</lb>--></p>


<pb n="432"/>

<p><mls unit="MS folio" n="116b"/> Rofetarsa ni ragasu co rruca mo chendsa lett. &ampersir; tabair mo chend<!--</lb>--> <mls unit="MS folio" n="116b 45"/> fort chend &ampersir; m'orddan for th'orddan. Benaid Conall a chend de<!--</lb>--> ic Cass&aacute;n Chlo&iacute;nta. &ampersir; berid Conall in cend co tarat forin liic ar<!--</lb>--> <mls unit="MS folio" n="117a"/> bruac<ex>h</ex> &aacute;tha. &#x2016; dolluid banna a mmediu in chind co ndechaid I <lb n="13515"/> cend in chorthi co lluid trit co tal<ex>main</ex>. Dobert da<ex>no</ex> a chend<!--</lb>--> f<ex>or</ex>sa corthe. &ampersir; adnaic a cend in corthe co tal<ex>main</ex> co tarla fora<!--</lb>--> beolu docum na haband. Conall Cloen a ainmseom co sain. ar<!--</lb>--> <mls unit="MS folio" n="117a 5"/> ro batar tri ainmi la Ulto .i. Conall Cl&oacute;en, &ampersir; Cu Ch<ex>ulaind</ex> Goll. &ampersir;<!--</lb>--> Cuscraid M<ex>en</ex>d. Ro randsat mna Ul<ex>ad</ex> i tr&iacute; iat. Ro char ca<ex>ch</ex> a <lb n="13520"/> &fdot;er don triursin. A trian ro charsa Coin Cul<ex>aind</ex> bat&iacute;s guill cot<!--</lb>--> acall<ex>aim</ex>. A trian ro charsat Conall C<ex>loen</ex> batis clo&iacute;n cot acall<ex>aim</ex>.<!--</lb>--> <mls unit="MS folio" n="117a 10"/> A trian ro charsat Cuscraid batis guit cot acall<ex>aim</ex>. Dobert i&mmacr;<!--</lb>--> Conall a chendsom fora chend conid tarla dara ais combo diriuch<!--</lb>--> ond uairsin. <lb n="13525"/></p>

<p>Luid d&imacr; Conall ina charp<ex>at</ex> a o&iacute;nur &ampersir; in t-ara i carp<ex>at</ex> Mes G<ex>egra</ex>.<!--</lb>--> Nos brogat d&oacute; iarum i nUachtur Fine. Co comrancatar fri coicait<!--</lb>--> &mdot;ban and sin .i. Buan ben Mes G<ex>egra</ex> cona bantrocht oc tuidecht<!--</lb>--> <mls unit="MS folio" n="117a 15"/> assin chocrich at&uacute;aid. Cia c&aacute; ta&iacute; a ben ar Conall. ben Mess G<ex>egra</ex><!--</lb>--> r&iacute;g. Timarnad duit techt limsa ar Conall. Cia do thimarnae <lb n="13530"/> or in ben. Mess G<ex>egra</ex> ar Conall. In tucais chomartha latt or in<!--</lb>--> ben. A charpat &ampersir; a eich sund ar Conall. Sochaide da tabair<!--</lb>--> <mls unit="MS folio" n="117a 20"/> seotu ar in ben. A chend suno da<ex>no</ex> ar Conall. Am d&iacute;lessa<!--</lb>--> uadsom a fechtsa or in ben. No imdergtha in cend indara fecht<!--</lb>--> &ampersir; ro b&aacute;nta in fecht aile. Cid d&aacute;s in cend a ben ar Conall. <lb n="13535"/> Rofetarsa i&mmacr; ar in ben. Immarb&aacute;g dorala et<ex>ur</ex>ro &ampersir; Ath<ex>irne</ex>.<!--</lb>--> <mls unit="MS folio" n="117a 25"/> Atrubairtseom nacham b&eacute;radsa oen&fdot;er d'Ultaib. Comrac imma<!--</lb>--> brethir iarum iss <ex>ed</ex> daas in cend. Tairsiu chuc<ex>u</ex>msa ar Conall<!--</lb>--> issin car<ex>pat</ex>. an frim or si coro chainiur mo cheile. Tuargaib<!--</lb>--></p>


<pb n="433"/>

<p><mls unit="MS folio" n="117a"/> iar<ex>u</ex>m a fo&iacute;d guil esti. co clos co Temraig. &ampersir; co Alind. &ampersir; fosceird <lb n="13540"/> <mls unit="MS folio" n="117a 30"/> dara cend &ampersir; s&iacute; marb. Ata a fert forsin t&sdot;ligi .i. Coll Buana. in<!--</lb>--> coll ro &aacute;s triana &fdot;ert.<!--</lb>--></p>

<p>Dotuc ass a gillai ar Conall. For&eacute;imdim in cend do breith<!--</lb>--> lim or in gilla. Gat a inchind ass or Conall. &ampersir; immir claideb fair.<!--</lb>--> &ampersir; tuc a inchind latt. &ampersir; cummaisc &aacute;el air. co nderna liathroit de. <lb n="13545"/> <mls unit="MS folio" n="117a 35"/> Dogn&iacute;ther &oacute;n &ampersir; facabair in cend acon mna&iacute;. &ampersir; lotarsom co rancatar<!--</lb>--> Emain. Ba ma&iacute;dmech i&mmacr; la Ulto r&iacute; Lagen do marb<ex>ad</ex> doib.<!--</lb>--></p>

<p>Is de sin tr&aacute; at&aacute; Cuaird Ath<ex>ir</ex>ni. &ampersir; Marbad Mes G<ex>e</ex>g<ex>ra</ex> do Chonall<!--</lb>--> C<ex>hernach</ex> &ampersir; Cath Etair.<!--</lb>--></p>
</div1>

<pb n="434"/>
<div1 n="5">
<head>Athirne &Aacute;ilgessach &ampersir; Mider Br&iacute; L&eacute;ith</head>

<p><mls unit="MS folio" n="117a"/> ATH<ex>IR</ex>NE Ailgessach m<ex>ac</ex> Ferch<ex>er</ex>tne. is e is doichlechu ro <lb n="13550"/> <mls unit="MS folio" n="117a 40"/>boi i nHer<ex>ind</ex>. Dochoid co Mider Br&iacute; L&eacute;ith co tuc corra<!--</lb>--> diultada &ampersir; doichle &uacute;ad fora thech .i. ar dibe &ampersir; ar dochill. Arna<!--</lb>--> <mls unit="MS folio" n="117a 45"/> taidled fer do &fdot;eraib Her<ex>end</ex> a thechsom do aigidecht &#x026B; &fdot;oigde.<!--</lb>--> Na tair. na tair ar in chetchorr. Eirgg ass ol a setig. Sech thech<!--</lb>--> se<ex>ch</ex> thech ar in tres chorr. Ca<ex>ch</ex> fer do &fdot;eraib Her<ex>end</ex> ataciched <lb n="13560"/> ni gebed fria chomlund a llaasin. Nocho doid a. &sdot;aith riam bale<!--</lb>--> <mls unit="MS folio" n="117a 50"/> i n&fdot;acced duine. Luidseom da<ex>no</ex> &ampersir; mucc urgnaide leis &ampersir; paitt<!--</lb>--> meda co n-essad a &sdot;aith a oinur. &ampersir; ro ch<ex>er</ex>taigestar ara belaib &#x2016;<!--</lb>--> <mls unit="MS folio" n="117b"/> in muicc &ampersir; in paitt meda. Co n-acca in fer chuice. Dogenta<!--</lb>--> th'o&iacute;nur ar se la tadall na <ex>m</ex>muicce &ampersir; na paitte uad. Cia th'ainmseo<!--</lb>--> ar Ath<ex>ir</ex>ni. Nocon erdairc &oacute;n ar se .i. Sethor. Ethor. Othor. Sele.<!--</lb>--> <mls unit="MS folio" n="117b 5"/> Dele. Dreng Gerce. Mec Gerce. Ger G&eacute;r. D&iacute;r D&iacute;r iss <ex>ed</ex> mo ainmse.<!--</lb>--> Ni thanic in mucc. &ampersir; for&fdot;emmid inn air do chuibdigud. D&oacute;ig combad<!--</lb>--> &oacute; Dia th&iacute;sta do breith na mmucce. ar n&iacute;rbo anf&eacute;lisium ond uairsin.<!--</lb>--></p>
</div1>


<pb n="435"/>
<div1 n="6">
<head><sup resp="BBE">Athirne and Amairgen son of Ecet Salach</sup></head>

<p><mls unit="MS folio" n="117b"/> BA&Iacute; goba amra i nUltaib .i. Eccet Salach goba a ainm. Ainm <lb n="13565"/> <mls unit="MS folio" n="117b 10"/> n-aill do Echen. su&iacute; ce<ex>ch</ex> admait. conna rabi riam &#x026B; iarum<!--</lb>--> goba bad &fdot;err. Rucad iar<ex>u</ex>m m<ex>a</ex>c d&oacute;. Amairgen a ainm. Ro<!--</lb>--> bu&iacute; iarum in m<ex>a</ex>csin i mmacrai ceth&eacute;ora &mdot;bl<ex>iadna</ex> d&eacute;c. cen labrad.<!--</lb>--> Ro &aacute;s a. br&uacute; iar<ex>u</ex>m combo m&eacute;it adbul teig m&oacute;ir. &ampersir; ba feithech<!--</lb>--> glasremor in br&uacute;sin. &ampersir; a smucli asa &sdot;r&oacute;in inna beolu. Ba dub a <lb n="13570"/> <mls unit="MS folio" n="117b 15"/> chroccend. Batir gela a &fdot;iacla. Ba glasb&aacute;n a aged. Am<ex>al</ex> da<!--</lb>--> urbuinne builg goband a lurgne &ampersir; a &sdot;liastai. Batir laebladracha<!--</lb>--> a thraigid. Batir adbolm&oacute;ra a adbronna. Batir ardda imchiana<!--</lb>--> a da &ndot;gruad. Batir domna dubderga a d&iacute; &sdot;&uacute;il. Ba lebormailgech<!--</lb>--> <mls unit="MS folio" n="117b 20"/> an&uacute;as. Ba garb drestaide a &fdot;olt. ba mellach cn&aacute;mach carrgarb <lb n="13575"/> a druim. Nib&oacute; c&aacute;emduine samlaid. Dia follaigthe cu ciana<!--</lb>--> inna &sdot;uidiu cen &fdot;oglanad doacmaised a m&uacute;rtraide d&oacute; cotice a<!--</lb>--> di leiss. Bat&iacute;r &eacute; a &sdot;ercla gruth bruithe. m&oacute;r luatha. mera derga.<!--</lb>--> <mls unit="MS folio" n="117b 25"/> caera glassa. diasa loscthi. gais chrema. cnoi caecha a mbith for<!--</lb>--> cl&aacute;r oca oca airfitiud. <lb n="13580"/></p>

<p>Do&fdot;o&iacute;d iar<ex>u</ex>m Ath<ex>ir</ex>ne a gilla .i. Greth a ainm co Ecet Sal<ex>ach</ex><!--</lb>--> do chor b&eacute;la i tenid. Co n-acca Greth in n-arracht &ndot;d&oacute;er &ndot;dochraid<!--</lb>--> &iacute;sin ara chind for lar in tige. Dan&eacute;ci co anm&iacute;n. atr&aacute;gestar Greth.<!--</lb>--> Bu&iacute; ingen Ecit i cathair c<ex>u</ex>mtachtai &ampersir; tlacht derscaigthe impe<!--</lb>--> <mls unit="MS folio" n="117b 30"/> issin tig. &ampersir; s&iacute; a ho&iacute;nur oc com&eacute;t in tige. &ampersir; in m<ex>a</ex>c na fail. Co cualatae <lb n="13585"/> n&iacute; in m<ex>a</ex>c fri gilla nAth<ex>ir</ex>ni. In n-ith Greth gruth ol se fo thr&iacute;.<!--</lb>--> Niro recart G<ex>ret</ex>h. &ampersir; atr&aacute;gestar co mm&oacute;r. Asbert i&mmacr; frisseom<!--</lb>--> arisi. Gr&iacute;nmuine gr&aacute;nmuine gais chrema. cuae uinn. ubla g<ex>re</ex>ti.<!--</lb>--> gruth. in n-ith Greth gruth.<!--</lb>--></p>

<p><mls unit="MS folio" n="117b 35"/> Atnaig G<ex>re</ex>th d&oacute; assin tig. conid corastar dar droichtiu ind <lb n="13590"/> liss. isin cechair. Luidi iar sin co rranic Ath<ex>irne</ex>. Atchonnarcais<!--</lb>--> &oacute;cu ol Ath<ex>irne</ex> olc f&eacute;th fil fort. Deithb<ex>ir</ex> dam ol G<ex>re</ex>th . M<ex>a</ex>c<!--</lb>--> cetheora &mdot;bl<ex>iadan</ex> naro labrastar riam dom acall<ex>aim</ex> indiu. &ampersir;<!--</lb>--> fot&fdot;uicfeso in m<ex>a</ex>csin cen gr&aacute;d mani dibdaither. Cid asrubairt<!--</lb>--> frit ol Ath<ex>irne</ex>. Ni <ex>handsa</ex> ol G<ex>re</ex>th. In n-ith Greth. &ampersir;c. Imchomairc <lb n="13595"/> <mls unit="MS folio" n="117b 40"/> Ath<ex>irne</ex> cindas both isind liss. Adf&eacute;t d&oacute; in gilla uile am<ex>al</ex> luide<!--</lb>--> G<ex>re</ex>th assind liss.<!--</lb>--></p>

<pb n="436"/>

<p><mls unit="MS folio" n="117b"/> Tanic Ecet fo chetoir. Asbert a ingen fris. Ro labrastar<!--</lb>--> Amar<ex>gen</ex> indiu ol si fri gilla nAth<ex>ir</ex>ni dodechaid sund do denam<!--</lb>--> bela lais. Cid asbert friss. In n-ith G<ex>ret</ex>h gruth. &ampersir;c. Bid ed <lb n="13600"/> bias de ol Ecet. Ticfa Ath<ex>irne</ex> do marbad in m<ex>ei</ex>c arna ragba<!--</lb>--> <mls unit="MS folio" n="117b 45"/> fair. ar biaid m&oacute;r s&oacute;is ocun m<ex>a</ex>c ro r&aacute;di in sein.<!--</lb>--></p>

<p>Dotet ind ingen iarum cosin m<ex>a</ex>c l&eacute; assind liss dond airgi bu&iacute;<!--</lb>--> oc Sliab Mis tess. Dogn&iacute; Ecet deilb in meicc di chriaid &ampersir; suidigis<!--</lb>--> fo l&aacute;im chl&iacute; d&oacute; et<ex>ir</ex> &ampersir; a builg. &ampersir; dobert dagthimthach imbi. &ampersir; suidigis <lb n="13605"/> inna liugu am<ex>al</ex> bid ina chotlud no beth.<!--</lb>--></p>

<p><mls unit="MS folio" n="117b 50"/> Tic Ath<ex>irne</ex> iar sin &ampersir; a gilla Greth. Co n-accatar in m<ex>a</ex>c inna<!--</lb>--> th&aacute;lgud. Dognith a mbieil leo. &ampersir; batar ro maith &ampersir; adacht for<!--</lb>--> <mls unit="MS folio" n="118a"/> samthaig. Dambert Ath<ex>irne</ex> imma chend na &#x2016; delba ucut am<ex>al</ex><!--</lb>--> bed in m<ex>a</ex>c beth and. &ampersir; atnaig do for teiched &ampersir; eigth<ex>er</ex> <lb n="13610"/> impu.<!--</lb>--></p>

<p>Lotar in t&sdot;luaig ina ndiaid. Tecmalla Aith<ex>irne</ex> a &fdot;olad &ampersir; a<!--</lb>--> inmass issin less. &ampersir; gabtha fair a les. Tecait Ul<ex>aid</ex> gleithir et<ex>ur</ex>ru.<!--</lb>--> <mls unit="MS folio" n="118a 5"/> Doberar .uii. cumala &ampersir; log a einig d&oacute; &ampersir; dognither cora et<ex>ur</ex>ru. &ampersir;<!--</lb>--> gaibid Ath<ex>irne</ex> in m<ex>a</ex>c for altram .i. Amor<ex>gen</ex> &ampersir; legais suithe filidechta <lb n="13615"/> laiss. Conid iar<ex>um</ex> ro laig senordacht for Ath<ex>irne</ex> &ampersir; ro gab Amor<ex>gen</ex><!--</lb>--> ardollomnacht Ul<ex>ad</ex>.<!--</lb>--></p>
</div1>
<div1 n="7">
<head><sup resp="BBE">Aigidecht Aithirne</sup></head>

<p>Dodechaid tra Ath<ex>irne</ex> fecht and for turus isin &fdot;ogomur do<!--</lb>--> thaig a daltai Amor<ex>gene</ex> co mba&iacute; adaig and. &ampersir; coro &fdot;obbair imthecht <lb n="13620"/> <mls unit="MS folio" n="118a 10"/> arnabarach. Conid and atbert Amor<ex>gen</ex> ac fostud Ath<ex>irni</ex>.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="verse" n="1">
<l>Raithe fo foss fogomur<!--</lb>--></l>
<l>feidm and for ca<ex>ch</ex> oenduine<!--</lb>--></l>
<l>la t&oacute;eb na ll&aacute; langarit.<!--</lb>--></l>
<l>Lo&iacute;g brecca a broind osseilti <lb n="13625"/></l>
<l>ditnit ruadgaiss raithnigi.<!--</lb>--></l>
<l>Ret<ex>h</ex>it daim a dumachaib<!--</lb>--></l>
<l>ri dorddan na damgaire.<!--</lb>--></l>
<l>Derccain duba a ssithchailtib.<!--</lb>--></l>
<l>Slatta etha amm ithgortaib<!--</lb>--></l></lg></body></text></p>

<pb n="437"/>

<p><text type="poem"> <body>
<lg type="verse" n="1">
<l><mls unit="MS folio" n="118a"/> os &iacute;ath domuin duind. <lb n="13630"/></l>
<l><mls unit="MS folio" n="118a 15"/> Draigin drissi delgnacha<!--</lb>--></l>
<l>fri toeb in lair leithlessi.<!--</lb>--></l>
<l>lan do mess tr<ex>u</ex>mtairnith.<!--</lb>--></l>
<l>Tuittit cnoi cuill cainmessa<!--</lb>--></l>
<l>do robilib rath. R. <lb n="13635"/></l></lg></body></text></p>

<p>Ro thriall da<ex>no</ex> imthecht isin gemrud. conid and atbert Am<ex>orgen</ex>.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="verse" n="1">
<l>Dubaib rathib rogemred.<!--</lb>--></l>
<l>robarta tond tuargabar.<!--</lb>--></l>
<l>iar to&iacute;b bethad blai.<!--</lb>--></l>
<l>bronaig eoin ca<ex>ch</ex> iathmaige. <lb n="13640"/></l>
<l><mls unit="MS folio" n="118a 20"/> acht fiaich fola forderge<!--</lb>--></l>
<l>fri fuaim gemrid gairg.<!--</lb>--></l>
<l>garb dub dorcha dethaite.<!--</lb>--></l>
<l>Diumsaig coin cnamchommaig<!--</lb>--></l>
<l>curtir ar aed iarnlestar <lb n="13645"/></l>
<l>iar lo dorcha dub. D.<!--</lb>--></l></lg></body></text></p>

<p>Ro t<ex>r</ex>iall da<ex>no</ex> imthecht isind erruch. Conid and atbert Am<ex>orgen</ex>.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="verse" n="1">
<l>Glass &uacute;ar errach aigide.<!--</lb>--></l>
<l>Is uacht in gaeth gignither.<!--</lb>--></l>
<l>glaidsait lachain lindusci. <lb n="13650"/></l>
<l>luin ic ecnacht corr cruadeigmi.<!--</lb>--></l>
<l><mls unit="MS folio" n="118a 25"/> Cluinit c&uacute;ana a dithrubaib.<!--</lb>--></l>
<l>fri eirge moch matarnaid.<!--</lb>--></l>
<l>d&uacute;scit eonu ind&fdot;eraid.<!--</lb>--></l>
<l>m&oacute;r fiad resa firtheichet <lb n="13655"/></l>
<l>a fid a f&eacute;or glas. G.<!--</lb>--></l></lg></body></text></p>

<p>Ro t<ex>r</ex>iall da<ex>no</ex> imthecht issin t&sdot;amrud conid and atbert Amor<ex>gen</ex><!--</lb>-->
ica chetugud d&oacute;.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="verse" n="1">
<l>F&oacute; s&iacute;n samrad sithistar <!--</lb>--></l>
<l>sadal fid forard forglide. <lb n="13660"/></l>
<l>Nach fet gaithe gluaseba.<!--</lb>--></l>
<l>glas clum caille clithaige<!--</lb>--></l>
<l>s&oacute;it srotha saebus<ex>ci</ex><!--</lb>--></l>
<l><mls unit="MS folio" n="118a 30"/> tess hi fota fon. F.<!--</lb>--></l></lg></body></text></p>

<p>Ro cetaiged d&oacute; iar<ex>u</ex>m imthecht issin t&sdot;amrud. O rasiacht <lb n="13665"/> iar<ex>u</ex>m oc Ath<ex>irne</ex> imthecht. is and ra thothlaihsetar a daltai .i.<!--</lb>--></p>

<pb n="438"/>

<p><mls unit="MS folio" n="118a"/> Amargin coro thothlaigedsaide co Ath<ex>irne</ex> n&iacute; dia &eacute;icsi do thadbsin<!--</lb>--> d&oacute;ib. Is ed tothlug<ex>ud</ex> dorone Amairgin .i. tarb do thabairt is tech<!--</lb>--> dia marb<ex>ad</ex> do Ath<ex>ir</ex>ne. conid and atbert Ath<ex>irne</ex> oc tairmesc<!--</lb>--> marbtha in tairb. <lb n="13670"/></p>

<p><text type="poem"> <body>
<lg type="verse" n="1">
<l><mls unit="MS folio" n="118a 35"/> In tarban treballach<!--</lb>--></l>
<l>bailcerblach adircech<!--</lb>--></l>
<l>mer mothlach munelach.<!--</lb>--></l>
<l>Oinmit na immirgi<!--</lb>--></l>
<l>athair na n-innile <lb n="13675"/></l>
<l>tairrechtaid ce<ex>ch</ex>a tana in tarb. T.<!--</lb>--></l></lg></body></text></p>

<p>Doberar gamain is tech dia marb<ex>ad</ex> dar eis in tairb. conid and<!--</lb>--> atbert Ath<ex>irme</ex>.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="verse" n="1">
<l>Berach oach aircheltach<!--</lb>--></l>
<l>and elit i<ex>m</ex> beim buridach <lb n="13680"/></l>
<l>samrad sirfes i cein<!--</lb>--></l>
<l>dersaid bec beodartaid.<!--</lb>--></l>
<l>mani tugedar d'ilbiadaib<!--</lb>--></l>
<l><mls unit="MS folio" n="118a 40"/> nocho didnad dam.<!--</lb>--></l>
<l>nia bron d&iacute;an degduine <lb n="13685"/></l>
<l>dligesum dia b<ex>e</ex>rbud <!--</lb>--></l>
<l>manip biada ber. B.<!--</lb>--></l></lg></body></text></p>

<p>Diarberar iar sin caire is tech dia marb<ex>ad</ex>. Conid and atbert<!--</lb>--> Ath<ex>irne</ex>.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="verse" n="1">
<l>Cetnait chromm lomm lesc <lb n="13690"/></l>
<l>lintach liuntach lenamnach.<!--</lb>--></l>
<l>ni ecmai&ndot;ger cen andre &eacute;t.<!--</lb>--></l>
<l>esbadach aith iarna dith i<ex>m</ex>ma tlacht.<!--</lb>--></l>
<l>toeb toll tana tuidmide<!--</lb>--></l>
<l>tadbanar for sliastaib sn&iacute;m. <lb n="13695"/></l>
<l>sainemla beo bas.<!--</lb>--></l>
<l><mls unit="MS folio" n="118a 45"/> buaid di a llacht a ll&oacute;e.<!--</lb>--></l>
<l>uar aigide i &ndot;gabras airrbe<!--</lb>--></l>
<l>roilbe ruad rofes ona filedaib<!--</lb>--></l>
<l>cobarthach caich cet. C. <lb n="13700"/></l></lg></body></text></p>

<pb n="439"/>

<p><mls unit="MS folio" n="118a"/> Doberar muc is tech iar tain co n-erbailt Ath<ex>irne</ex> iar tain ic<!--</lb>-->
erail a mmarbtha.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="verse" n="1">
<l>Mo chen mata moaigth<ex>er</ex><!--</lb>--></l>
<l>do nach moaigth<ex>er</ex> miad.<!--</lb>--></l>
<l>airrechtach ce<ex>ch</ex>a debtha dure. <lb n="13705"/></l>
<l>ni ar d&aacute;naib dothiastar<!--</lb>--></l>
<l>acht dia letharthaib lai.<!--</lb>--></l>
<l><mls unit="MS folio" n="118a 50"/> lassamuin biad boligthe<!--</lb>--></l>
<l>riana laile bal don matai is mo chen. M.<!--</lb>--></l></lg></body></text></p>

<p>Ataigther tene trom trichemruad d&oacute; iar sin. Conid and atbert <lb n="13710"/> Ath<ex>irne</ex>. &#x2016;<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="verse" n="1">
<l><mls unit="MS folio" n="118b"/> Tene trom trichemr&uacute;ad<!--</lb>--></l>
<l>tairges uacht n-oinfir<!--</lb>--></l>
<l>erge lond. lassair lainderda.<!--</lb>--></l>
<l>iar li g<ex>re</ex>ne glan <lb n="13715"/></l>
<l>fri silliud s&uacute;la.<!--</lb>--></l>
<l>suillse in ca<ex>ch</ex> taig<!--</lb>--></l>
<l>tairges tene. T.<!--</lb>--></l></lg></body></text></p>
</div1>

<pb n="440"/>
<div1 n="8">
<head>Aided <sup resp="BBE">Cheltchair meic Uthechair</sup></head>

<p><mls unit="MS folio" n="118b 5"/> CId dia ta Aided Cheltchair m<ex>ei</ex>c Uth<ex>echair</ex>. Ni <ex>handsa</ex>. Fer <lb n="13720"/> amra ro bu&iacute; de Ul<ex>taib</ex> .i. Blai Briuga. Secht n-airgeda leis.<!--</lb>--> Secht fichit bo cecha argi. &ampersir; seisrech cecha hargi. Tech n-o&iacute;ged.<!--</lb>--> ferand<gap/> leis. Ba geiss do da<ex>no</ex> ben for damrud dochum<!--</lb>--> <mls unit="MS folio" n="118b 10"/> a thaigi cen &fdot;eiss dos<ex>o</ex>m lee meni beth a fer na farrad. Dolluid d&imacr;<!--</lb>--> Br&iacute;g Brethach ben Chelt<ex>chair</ex> for oigidecht dochum a thaigi. <lb n="13725"/> Ni maith a ndoronais a ben ar Blai Briuga. Is geiss damsa do<!--</lb>--> thuidecht chuc<ex>u</ex>m am<ex>al</ex> tancais. Is fer truag ar in ben loittes a.<!--</lb>--> <mls unit="MS folio" n="118b 15"/> gessi f&eacute;in. Is fir da<ex>no</ex> ar se. Foid lee in n-aidchisin. Adfiadar do<!--</lb>--> Chelt<ex>char</ex>. Dolluidside d'iarraid a mna. Luid Blai Briuga co<!--</lb>--> mbai et<ex>er</ex> Chonch<ex>obor</ex> &ampersir; Choin C<ex>ulaind</ex>. B&aacute;tar oc imb<ex>ir</ex>t &fdot;idchilli <lb n="13730"/> desciurd o Emuin Macha. Luid da<ex>no</ex> Cel<ex>tchar</ex> m<ex>ac</ex> Uth<ex>echair</ex><!--</lb>--> <mls unit="MS folio" n="118b 20"/> co <ex>m</ex>bui i com&fdot;ocus do. ro ba&iacute; bruinne ind &fdot;ir darsin fidchill.<!--</lb>--> no clannaCel<ex>tchar</ex> in l&uacute;in ind co mbui triana druim iar &ndot;dul<!--</lb>--> in gai triit. co ndechaid banna da &fdot;uil co mbu&iacute; forsin &fdot;ith<ex>chill</ex>.<!--</lb>--> Amein a Chu Ch<ex>ulaind</ex> ar Conch<ex>obor</ex>. Amein da<ex>no</ex> a Chonch<ex>obuir</ex> <lb n="13735"/> for Cu <ex>Chulaind</ex>. Ra tomsed on banda ille &ampersir; inund. dus cia dib<!--</lb>--> <mls unit="MS folio" n="118b 25"/> diarbo &fdot;oicsiu. Faicsiu in banna da<ex>no</ex> do Chonchob<ex>ur</ex>. Siade<!--</lb>--> cosin digail deirb. Atbath tra Blai Br<ex>iuga</ex>. Atrulla Cel<ex>tchar</ex> co<!--</lb>--> mbui isna Deisib Muman tess.<!--</lb>--></p>

<p>Is olc so a Chonch<ex>obuir</ex> ar Ul<ex>aid</ex>. Is tuiti<ex>m</ex> deisi a<ex>n</ex>d so. Ropo <lb n="13740"/> lor in fer marb diar n-esbuid. Ticed Cel<ex>tchar</ex> dia th&iacute;r. Ticed<!--</lb>--> <mls unit="MS folio" n="118b 30"/> da<ex>no</ex> ar Conch<ex>obor</ex>. &ampersir; eirged a m<ex>ac</ex> fora c<ex>h</ex>end. &ampersir; teiged i conimairge<!--</lb>--> fris. Ni geibthe da<ex>no</ex> <gap/> cin ind athar forin m<ex>a</ex>c. &#x026B; cin in<!--</lb>--> m<ex>ei</ex>c forsind athair. Luidside d&imacr; di gairm Chel<ex>tchair</ex> co mbo&iacute;<!--</lb>--> thess. <lb n="13745"/></p>


<pb n="441"/>

<p><mls unit="MS folio" n="118b"/> Cid dia tudchad ar Cel<ex>tchar</ex>. Meise ar in gilla. ro c<ex>u</ex>mrigset,<!--</lb>--> tar do geissu &ampersir; i commairge frit. Fir or se. Is seim in muin<!--</lb>--> <mls unit="MS folio" n="118b 35"/> doberat Ul<ex>aid</ex> ummumsa techt for muin mo m<ex>eic</ex>. Bid Seim a<!--</lb>--> ainm &ampersir; ainm a chen<ex>eoi</ex>l ar in drui. Ansu a gilla or se. &ampersir; ragatsa.<!--</lb>--> Dogn&iacute;th<ex>er</ex> &oacute;n. Is de ata Semuine na nD&eacute;si. <lb n="13750"/></p>

<p>Is &iacute; tra eraicc conattecht im Blai Br<ex>iugaid</ex> na tri fochaide ata<!--</lb>--> <mls unit="MS folio" n="118b 40"/> andsom ticfad la Ultu na remes do di&ndot;gbail d&iacute;b. Dolluid d&imacr;<!--</lb>--> Co&ndot;ganchnes m<ex>a</ex>c Dedad do digail a br<ex>athar</ex> for Ultu .i. Cu Ru&iacute;<!--</lb>--> m<ex>ac</ex> Daire m<ex>eic</ex> Dedad. Ro fasaigestar Ulto co mmor. Ni<!--</lb>--> &ndot;geibtis gai. &#x026B; chlaidib. acht no scendis ass am<ex>al</ex> de cho&ndot;gnu. <lb n="13755"/> <mls unit="MS folio" n="118b 45"/> Di&ndot;gaib din in fochaidseo a Chel<ex>tchair</ex> ar Conch<ex>obor</ex>. Maith &aacute;m<!--</lb>--> ar Cel<ex>tchar</ex><!--</lb>--></p>

<p>Luid dia acall<ex>aim</ex> in Cho&ndot;ganchnis laa and co tarat breic<!--</lb>--> i<ex>m</ex>me. Cor gell a ingin do .i. Niab ingen in Chel<ex>tchair</ex> &ampersir; praind<!--</lb>--> ceit dia tairiuc ce<ex>cha</ex> nona. Co tarat in ben breic imme co n-erbairt <lb n="13760"/> frie in n-innas no mairbfithe .i. bera iairn it eat derga tria mo<!--</lb>--> luirgnib &ampersir; im bonnab &#x2016; <!--</lb>--></p>
</div1>


<pb n="442"/>
<div1 n="9">
<head><sup resp="BBE">Brislech M&oacute;r Maige Muirthemni</sup></head>

<p><mls unit="MS folio" n="119a"/> <gap/><!--</lb>--> nad fordamarsa gol ban &ampersir; m<ex>a</ex>c cen etr&aacute;in forru cosindiu. La sin<!--</lb>--> doci&ndot;g in .l. banrigan ara chind &ampersir; tornochtait a c&iacute;che friss. Is<!--</lb>--> accu ro taiscelad ar t&uacute;s cichi ban do nochtad .i. forna m<ex>a</ex>cgnimradaib. <lb n="13765"/> <mls unit="MS folio" n="119a 5"/> &ampersir; oc fastud Chon Cul<ex>aind</ex> i nEmain M<ex>acha</ex>. &ampersir; dobretha na t&eacute;ora<!--</lb>--> dabcha us<ex>ci</ex> do d&iacute;bd&uacute;d a brotha. &ampersir; n&iacute; tarlaiced a llaasin dochum in<!--</lb>--> chatha.<!--</lb>--></p>

<p>Atchiu ni thic Cu C<ex>hulaind</ex> &uacute;aib indiu a maccu Cal<ex>atin</ex> tresin<!--</lb>--> ceird to&sdot;uigthi fil lib or Lug<ex>aid</ex>. Is cian dond &fdot;ir fil sund &oacute; D&uacute;n <lb n="13770"/> <mls unit="MS folio" n="119a 10"/> Chermnai &ampersir; o Belaib Con Glais. &ampersir; o Themair Lochra. &ampersir; o Chombur<!--</lb>--> T<ex>r</ex>i nUs<ex>ce</ex> beith fri Beolu Menbolg. Is olc in chelg to&sdot;uigthe file<!--</lb>--> lib. is cian cu tic Cu <ex>Chulaind</ex> or Lug<ex>aid</ex>. Ticfa uainne imbarach.<!--</lb>--> Ro b&aacute;tar and co arnabarach. &ampersir; dolbit cla<ex>nn</ex> Chal<ex>atin</ex> na sluaig<!--</lb>--> im Emain M<ex>acha</ex> combo oensm&uacute;it &fdot;orloiscthe in Macha uile. &ampersir; <lb n="13775"/> <mls unit="MS folio" n="119a 15"/> coro cuired Emuin M<ex>acha</ex> forsna sluagaib. &ampersir; co tor<ex>chratar</ex> na gascid<!--</lb>--> dia n-adlennaib. &ampersir; dobreth a mi&fdot;ocl<ex>ad</ex> do Choin Cul<ex>aind</ex>. Conid<!--</lb>--> and asbert Leb<ex>ar</ex>cham.<!--</lb>--></p>

<p>R. Atra&iacute; a Chu C<ex>hulaind</ex> comerig cob airthe Mag<!--</lb>--> M<ex>ur</ex>themne ar firu Galeoin a gein Loga soalta so&iacute; frit <lb n="13780"/> churad cathchlessu. A Chu <ex>Chulaind</ex> comerig co mburetar<!--</lb>--> <mls unit="MS folio" n="119a 20"/> basa lia indrid M<ex>ur</ex>themni. M&oacute;ra airdi &oacute;ic do n&iacute;th. nachit<!--</lb>--> Corm<ex>a</ex>c cotalgad Admuint<ex>ir</ex>e i c&eacute;in Chonch<ex>obuir</ex>. n&iacute; t&aacute;<!--</lb>--> Conall comnesam Corm<ex>ai</ex>c ar nin eroemaid ar ni tria gairi<!--</lb>--> cotobgn&iacute; Lug<ex>aid</ex> lanchlemnas goin frisgegna gn&iacute;m. Gaib <lb n="13785"/> immut a andremuig a hu&iacute; Chathbad com&eacute;rig. Atrai.<!--</lb>--> Conid and atbert Cu C<ex>hulaind</ex> .<!--</lb>--></p>


<pb n="443"/>

<p><mls unit="MS folio" n="119a"/> .R. An d&iacute;m a ingen. ni mm'&oacute;enur domiulsa Chonch<ex>obuir</ex><!--</lb>--> <mls unit="MS folio" n="119a 25"/> coiced ciabo bidbu imnedach n&iacute; imgen m'oenur ar is<!--</lb>--> diairle iarna sc&iacute;s mo sc&iacute;s. nidam eirr imtholtanach accobrach <lb n="13790"/> imgona indiu.<!--</lb>--></p>

<p>Is and atbert Niab ingen Chel<ex>tchair</ex> ben <ex>Con</ex>aill C<ex>hernaig</ex>.<!--</lb>--></p>

<p>.R. Deithb<ex>ir</ex> duitsiu &oacute;n a Chu <ex>Chulaind</ex> nit charpat Conaill<!--</lb>--> <mls unit="MS folio" n="119a 30"/> comathar ca&iacute;n r&oacute;g renar ar Ultaib i n-athaib buaderthaib<!--</lb>--> bith conid uanchend airm inid accid. ar n&iacute; imgonaid na <lb n="13795"/> aill ni gn&iacute;m n&iacute; chenae acht a &fdot;ithis m&oacute;ir m<ex>ei</ex>c Amairgin.<!--</lb>--></p>

<p>A ben em ar Cu C<ex>hulaind</ex> ciabam tr&uacute;sa nim tharraid cubes<!--</lb>--> <ex>con</ex>r&oacute;etar m'ainech nim &aacute;g archelad ni mmo guin immgabaim.<!--</lb>--></p>

<p><mls unit="MS folio" n="119a 35"/> Iar sin ro li&ndot;g Cu <ex>Chulaind</ex> fora gaisced. &ampersir; ro gab fathi immi.<!--</lb>--> In cetna fathi ro -.ab immi ro maid fair co tor<ex>chair</ex> a delg asa l&aacute;im. <lb n="13800"/> Conid and atbert Cu C<ex>hulaind</ex>.<!--</lb>--></p>

<p>.R. Ni bidba bratt b<ex>er</ex>es robud. is bidba delg athchummas<!--</lb>--> chness. co tuitt tria thraigid. sciath for scanfait<ex>er</ex> fuidb.<!--</lb>--> <mls unit="MS folio" n="119a 40"/> scarad faebuir. fri desl&aacute;im mo duirn mosbaim fuil anabaid<!--</lb>--> crechtnaigfit formnai fer. airchisfith<ex>er</ex> dia m&aacute;r des Maig <lb n="13805"/> Murthemni dimes.<!--</lb>--></p>

<p>Iar sin ro gab a &fdot;athi immi. &ampersir; ro gab a sciath co faebur chonduala<!--</lb>--> &fdot;air. Conid and atbert fri Loeg m<ex>a</ex>c R<ex>iangabra</ex>. Innill d&uacute;n a<!--</lb>--> <mls unit="MS folio" n="119a 45"/> phobba La&iacute;g in carp<ex>at</ex>. To&ndot;gu do dia a to&ndot;ges mo th&uacute;ath or<!--</lb>--> L&aacute;ech ciano beth coiced Conch<ex>obuir</ex> immon Liath M<ex>acha</ex> nis <lb n="13810"/> tibritis dochum in charp<ex>ait</ex>. N&iacute; erbart frit cosindiu. In m<ex>en</ex>ma<!--</lb>--> nom airfitiged do g<ex>r&eacute;</ex>s n&iacute; h&eacute; domriacht. Maso &aacute;il duit tair f&eacute;in<!--</lb>--> da acall<ex>aim</ex> ind Leith fadessin. Teite Cu <ex>Chulaind</ex> a dochum.<!--</lb>--> <mls unit="MS folio" n="119a 50"/> &ampersir; ro impa in t-ech a chl&eacute; friss fo thr&iacute;. &ampersir; ro sca&iacute;l in Morr&iacute;gu in carp<ex>at</ex><!--</lb>--> issind aidchi remi. ar nirbo ail l&eacute; a dul Con Cul<ex>aind</ex> dochum in <lb n="13815"/> chatha. ar rofit<ex>ir</ex> noco ricfad Emuin M<ex>acha</ex> af<ex>r</ex>ithisi. Conid de<!--</lb>--> asbert Cu C<ex>hulaind</ex> frisin Liath M<ex>acha</ex>.<!--</lb>--></p>

<p>.R. N&iacute;bu gn&aacute;th a Leith lithe for cl&eacute; frim fechuir f&iacute;ach<!--</lb>--> <mls unit="MS folio" n="119a 55"/> fonat gaibim gn&iacute;m donothlogmar &eacute;c. m thintla mo m<ex>en</ex>ma<!--</lb>--> <mls unit="MS folio" n="119b"/> i mmuige mag dianot imredinn ciana &eacute;ssi derga &#x2016; imch&iacute;ana <lb n="13820"/> eich sce&oacute; ruith scarad creta cu&ndot;gai fortche forsa suidm&iacute;s<!--</lb>--> suide suilig ro don bai Badb i nEmuin M<ex>acha</ex>. Nibu gnath.<!--</lb>--></p>

<p>La sodain dodechaid in Liath M<ex>acha</ex> co tarlaic .a bolgd&eacute;ra m&oacute;ra<!--</lb>--> fola fora dib traigthib. La ssi<ex>n</ex> ro ling Cu <ex>Chulaind</ex> i<ex>n</ex> carp<ex>at</ex>.<!--</lb>--> <mls unit="MS folio" n="119b 5"/> &ampersir; docuridar bedg de fodes iar Sligi Midluachra. Co n-accai in <lb n="13825"/> n-ingin ara chind .i. Lebarcham ingen Auae &ampersir; Adarci. .i. mug &ampersir;<!--</lb>--></p>


<pb n="444"/>

<p><mls unit="MS folio" n="119b"/> cumal ro bo&iacute; i tig Conch<ex>obuir</ex> .i. Auae &ampersir; Adarc. conid and asbert<!--</lb>--> L<ex>ebarcham</ex>.<!--</lb>--></p>

<p>.R. N&aacute;n f&aacute;caib n&aacute;n f&aacute;caib a Chu <ex>Chulaind</ex>. F&iacute;al do gn&uacute;is.<!--</lb>--> <mls unit="MS folio" n="119b 10"/> gartach do gr&uacute;ad. goirthech ca&iacute;ngn&uacute;is do gn&uacute;is cnedach <lb n="13830"/> ca&iacute;n in tocad. ardo d&iacute;th dubae dia mairgfem. mairrg<!--</lb>--> ar mn&aacute;. m<ex>airg</ex> ar maccu. m<ex>airg</ex> ar s&uacute;le sir do guba<!--</lb>--> muiche cichseo da<ex>no</ex> c&eacute;im rigairech don chath ara mbebad<!--</lb>--> airdde die m&oacute;r Maige Murthemne dit &eacute;is.<!--</lb>--></p>

<p>&ampersir; cumma asrubairtsi &ampersir; asbertatar na tri coicait ban ba&iacute; i nEmuin <lb n="13835"/> <mls unit="MS folio" n="119b 15"/> M<ex>acha</ex> o guth m&oacute;r.<!--</lb>--></p>

<p>Ba fer na f&aacute;cbaitis ar L&oacute;eg ar iss ed naro &sdot;&aacute;raigis cosindiu nert<!--</lb>--> ceniuil do m&aacute;thar. Acc amae ol Cu C<ex>hulaind</ex>. geib leic Lo&iacute;g.<!--</lb>--> la araid airitiud. la errid imdegail. la cunnid comairle. la firu<!--</lb>--> <mls unit="MS folio" n="119b 20"/> ferdacht. la mn&aacute; mifre. tair rium don chath. Na frithail in <lb n="13840"/> n-airchisecht nachit chobradar. Tossuither in carp<ex>at</ex> &eacute;is for<!--</lb>--> desel. La sin dobeir in banchuire g&aacute;ir guil. La sin dobeir in<!--</lb>--> banchuire gair guil &ampersir; golgaire &ampersir; bosschaire. Rofetatar n&iacute;con<!--</lb>--> ricfed co Emuin M<ex>acha</ex>.<!--</lb>--></p>
</div1>
<div1 n="10">
<head>Beochobra Con Cul<ex>aind</ex> isind l&oacute; f&uacute;air b&aacute;s.<lb n="13845"/></head>

<p><mls unit="MS folio" n="119b 25"/> IT br&oacute;naig banchuiri buidnib d&eacute;r. diar n-apthaib. di maigib<!--</lb>--> d&iacute;e dall fr&iacute;th fon&uacute;air fasciug<ex>r</ex>at ceirm co forci&ndot;gi dinn<!--</lb>--> risib rot bith mairg ro fathatar flathi fer i ar &mdot;buntaib bethaed<!--</lb>--> gamain &iacute;ath imderga essi. Ammiti tuathchaecha taircebat mo<!--</lb>--> <mls unit="MS folio" n="119b 30"/> milliud morulad atomchuinfet <ex>con</ex>cechalsat buada atmbelat <lb n="13850"/> eslabrai a baccaib r&aacute;th. Randfaider domun desl&aacute;maib dichra<!--</lb>--> aige eblas eirr &oacute;encharpait &eacute;t im th&uacute;aith teora forranu fonena<!--</lb>--> <mls unit="MS folio" n="119b 35"/> nithu. ni ciat s&uacute;li n&iacute; nad aiccet. Aithguba sirechtach sercfid<!--</lb>--> br&uacute; in churad o i&ndot;gnasaib. <ex>Con</ex>coillfither f&iacute;r fer forgoba<!--</lb>--> oin&fdot;er ecomluind ili et<ex>er</ex> da roth rosia dihal d&iacute;riuch. Lorg <lb n="13855"/> L&eacute;ith Macha mairg &eacute;t i ss&iacute;dib sies i&ndot;gantu add<ex>er</ex>ga uane<!--</lb>--> <mls unit="MS folio" n="119b 40"/> urchraide noes nibu thais arcuech n-aignech la dulu diluba<!--</lb>--> atabiusa fri ecraitiu aithb<ex>er</ex> aithb<ex>er</ex> iar<ex>u</ex>m dithi de lathe Mag<!--</lb>--> Murthemni atharda iba sr&uacute;aim sruthborr sl&aacute;n lam broind<!--</lb>--></p>


<pb n="445"/>

<p><mls unit="MS folio" n="119b"/> begdolb cr&uacute; iar feis nom &fdot;othraicfe Nith nemnech n&eacute;l sorcha <lb n="13860"/> somlas semide. fuile form chuirp cribsaite. cretta fuidbechta<!--</lb>--> <mls unit="MS folio" n="119b 45"/> fu&aacute;im tal<ex>man</ex> triuin torm<ex>aid</ex> &eacute;cnaithi adrainfet comarbae<!--</lb>--> cumachta. beca berthair ith amserdaib dith slabrae slab<!--</lb>--> comdetae. cluim cathu canis n-imarburt. Gand gein gignithar<!--</lb>--> gair ria ndomun d&iacute;th. bith daer a acille bid dorcha a amser. <lb n="13865"/> <mls unit="MS folio" n="119b 50"/> togaethfaid sochaide soifid iliu h&eacute; rofiastar i mbo cen athfir.<!--</lb>--> Riris go&iacute; cloifid fir fessair cathu. carcair airchind imdibe<!--</lb>--> ball brisiud cnama cumma tuinne tadlach sula saebrechta<!--</lb>--> &uacute;abair &oacute;r urraib. arget ar crannaib. gemma a lecaib linfait<!--</lb>--> <mls unit="MS folio" n="119b 55"/> saint sleibe glainithe. g<ex>re</ex>ssach taircsiu s&aacute;er diamlaid ar <lb n="13870"/> <mls unit="MS folio" n="120a"/> dofessammar fair i forciund a dala lathe &#x2016; dia mbaidfider<!--</lb>--> bith m&oacute;ras doine duib duile dia cennach. acht adraid in m<ex>a</ex>c<!--</lb>--> cona recht is ferr d&uacute;ib co fa &sdot;echt os m&eacute; im uabor immarordus<!--</lb>--> a leic dogenaind bad &fdot;err arom beth mad cet bith. It bronaig.<!--</lb>--></p>

<p><mls unit="MS folio" n="120a 5"/> Iar sin tuargabtar in banchuire gair guil &ampersir; golgaire ar rofetatar <lb n="13875"/> nach ricfad co Ulto Cu Ch<ex>ulaind</ex>.<!--</lb>--></p>

<p>Ro bo&iacute; tech a m<ex>u</ex>mme rod n-altsom ara chind forin t&sdot;ligid<!--</lb>--> taidledsom b&eacute;os in tan na theiged fora &eacute;rim secci fadess &ampersir; aness.<!--</lb>--> Lestar co ndig leesi ara chinds<ex>o</ex>m do g<ex>r&eacute;</ex>s. ibid dig. &ampersir; documlai ass<!--</lb>--> <mls unit="MS folio" n="120a 10"/> &ampersir; celebraid dia m<ex>u</ex>mmi. T&eacute;it ass iar Sligi Midluachra. iar Maig <lb n="13880"/> Mogna. Co n-accai n&iacute; na teora ammiti t&uacute;athchaecha ara chind<!--</lb>--> forin t&sdot;ligid. Orce co nemib &ampersir; epthaib fono&iacute;set for beraib cairthind.<!--</lb>--> Ba do gessib Con Cul<ex>aind</ex> cen adall fulachta dia chathim. Geiss<!--</lb>--> <mls unit="MS folio" n="120a 15"/> d&oacute; da<ex>no</ex> c&aacute;rna a chomanma do ithi. Rethid &ampersir; ba do dul seccu.<!--</lb>--> rufit<ex>ir</ex> n&iacute;bu 'c denam a lessa ro bass and. Conid de asbert friss <lb n="13885"/> ind ammait. Tadall latt a Chu <ex>Chulaind</ex>. Ni adliub &eacute;m ol Cu<!--</lb>--> C<ex>hulaind</ex>. At&eacute; in biad cu ol si. Diambad &fdot;ulocht m&oacute;r no beth<!--</lb>--> and or si ro adelta. &Uacute;air is bec fil and ni thaidle. Ni tualai&ndot;g<!--</lb>--> <mls unit="MS folio" n="120a 20"/> m&oacute;r nad &fdot;ulai&ndot;g &#x026B; nad geib in &mdot;bec. Ataellasom iarom. &ampersir; tonindnaig<!--</lb>--> ind ammait leithi in chon d&oacute; assa laim chl&iacute;. Adetha Cu C<ex>hulaind</ex> <lb n="13890"/> iarum assa l&aacute;im &ampersir; dambeir f&oacute; &sdot;liasait cl&iacute;. Ind l&aacute;m rod gab &ampersir; in<!--</lb>--> t&sdot;liasait fo tarat ro gabtha o chund co fond conna rabi a nnert<!--</lb>--> c&eacute;tna indib.<!--</lb>--></p>


<pb n="446"/>

<p><mls unit="MS folio" n="120a"/> Documlat ass iarum iar Sligi Midlua<ex>chra</ex> timchell Sleibe Fuait<!--</lb>--> <mls unit="MS folio" n="120a 25"/> fades. Conid and asbert Cu <ex>Chulaind</ex> fri Loeg. Cia &fdot;acca d&uacute;n <lb n="13895"/> a phopa Lo&iacute;g. Conid de asbert Loeg. Troich imda &ampersir; m&oacute;rchoscuir.<!--</lb>--> Fe amae ol Cu <ex>Chulaind</ex>. Fuaim immairic eich dubderga comrethi<!--</lb>--> cl&aacute;r cl&eacute; clithi remituit a rae ar mothuittet eich i fochluib. fe. cian<!--</lb>--> <mls unit="MS folio" n="120a 30"/> adraigsemar messchuriu fer &ndot;Her<ex>end</ex>. In tan doch&uacute;aid Cu<!--</lb>--> <ex>Chulaind</ex> for Sligid Midl<ex>uachra</ex> fodess co 'mmanaccai d&oacute; &ampersir; an dunad <lb n="13900"/> bo&iacute; i mMaig M<ex>ur</ex>themne. Is and asbert Erc m<ex>ac</ex> Car<ex>pri</ex>.<!--</lb>--></p>

<p>.R. Atchiusa sund carpat c&oacute;em crichid cumtachglan co<!--</lb>--> <mls unit="MS folio" n="120a 35"/> pupaill uanicda co m&oacute;rsaide do chlessaib cliss gascid i carp<ex>ut</ex><!--</lb>--> cha&iacute;n chlessamna colgatcha&iacute;n. Is amlaid at&aacute; in carpatsain<!--</lb>--> for da n-echaib cendbeca cruindbeca corrbeca cr&uacute; eich bedgaich <lb n="13905"/> bolg&sdot;r&oacute;in bolgroisc uchtlethnai brondlethnai. cidat cuibdi<!--</lb>--> comriata inn echradsin n&iacute;dat comdatha. indala ech d&iacute;b<!--</lb>--> <mls unit="MS folio" n="120a 40"/> lugl&iacute;ath lemnech maignech tair&ndot;gech torandchlessach stuagmar<!--</lb>--> f&oacute;tmar focursid. In t-ech aile i&mmacr; c&iacute;rdub cenand br&uacute;mar<!--</lb>--> co mbr&uacute;aib duba dorchaide. Da chui&ndot;g ardda fororda foraib. <lb n="13910"/> Fuil fer findcass foltlebor issin charp<ex>ut</ex>sin. Luinech derg<!--</lb>--> <mls unit="MS folio" n="120a 45"/> daigerda na l&aacute;im ar derglassad. enblaith etarluamnach<!--</lb>--> uasa erra oenchairpait. Folt d&uacute;al&aacute;ch tr&iacute; &ndot;datha fair .i. folt<!--</lb>--> dond ra tuind cind. folt croderg iar n-irmedon. mind orda<!--</lb>--> ra tuigedar dianechtair. Ca&iacute;n cocarus in chind &ampersir; ind &fdot;uiltsin <lb n="13915"/> co uirend teora im&sdot;rotha de immo chend. Comba samalta<!--</lb>--> <mls unit="MS folio" n="120a 50"/> ra t&eacute;taib &oacute;rsn&aacute;id dar or n-indeona fo l&aacute;im suad saincherda.<!--</lb>--> na ra buiderad ris taitni grian i llathi &sdot;amrata i mmed&oacute;n<!--</lb>--> m&iacute;s mai. taidlech ce<ex>cha</ex> &fdot;admainni d'&fdot;uilt ind &oacute;cla&iacute;gsin.<!--</lb>--></p>

<p>A &sdot;ein chucund m fersin a &fdot;iru Her<ex>end</ex> no frithalid. <lb n="13920"/></p>

<p><mls unit="MS folio" n="120a 55"/> Turgabad fert fotbaig fo Erc m<ex>a</ex>c Car<ex>pri</ex> in tansin. &ampersir; doringintea<!--</lb>--> <mls unit="MS folio" n="120b"/> lebend sciath imbe. &ampersir; dor&oacute;nta tri catha &#x2016; cr&oacute;da comch&oacute;ire do<!--</lb>--> &fdot;eraib Her<ex>end</ex> in tansin. &ampersir; atbert Erc. Frithalid a &fdot;iru Her<ex>end</ex><!--</lb>--> in fersin .i. Coin Cul<ex>aind</ex>. &ampersir; ro r&aacute;id na bri<ex>athr</ex>asa.<!--</lb>--></p>

<p>.R. Comergid a &fdot;iru Her<ex>end</ex>. atraigid fil sund Coin <lb n="13925"/> Cul<ex>aind</ex> costodach coscarach claidiubderg. iraichlid erachlid.<!--</lb>--> <mls unit="MS folio" n="120b 5"/> airegid. Iactbadir cind de sein ailfit<ex>ir</ex> aichthi cosc n-admait<!--</lb>--> ditnui taclaid ferg fair. &Oacute;enn&iacute; sin am&aacute;in m<ex>a</ex>c D&eacute; m<ex>a</ex>c duini.<!--</lb>--> mairg mind&oacute;ene mairg s&eacute;is mairg sreith mairg suthch<ex>er</ex>naid<!--</lb>--></p>

<pb n="447"/>

<p><mls unit="MS folio" n="120b"/> gen in flaith flaith findn&eacute;lach forn&eacute;lach fossad fichda f&iacute;rchlich <lb n="13930"/> <mls unit="MS folio" n="120b 10"/> feromail ra hart in domuin dedenaig. bo&iacute; da<ex>no</ex> no&iacute; m&iacute;s<!--</lb>--> fo chleith ingeni d&eacute;tlaind bunaid. machit Macha immanar<!--</lb>--> ne&oacute;il slecht mairc ro chaith slecht bud adbur anmich airchind<!--</lb>--> dian tic bacher Cua comergid. Com<ex>ergid</ex>.<!--</lb>--></p>

<p>Cinnas &fdot;uirechlem. Cinnas aurisfemmar clessu ol firu Her<ex>end</ex>. <lb n="13935"/> Ni <ex>handsa</ex>. Is &iacute; mo chomairlisi d&uacute;ib ol Erc na cethri chuicid.<!--</lb>--> <mls unit="MS folio" n="120b 15"/> filet sund di choicedaib Her<ex>end</ex> denid &oacute;enbuidin d&iacute;b &ampersir; &oacute;enchl&aacute;r<!--</lb>--> dona sciathaib immon &mdot;buidinsin an&uacute;as &ampersir; imma cuairt &ampersir; foraib. &ampersir;<!--</lb>--> tabraid triar ca<ex>ch</ex>a arda immon &mdot;budinsin. &ampersir; dias oc imessarcain<!--</lb>--> do neoch as tressiu don t&sdot;l&uacute;ag. &ampersir; cainte co culluaisc accu. Co rragbat <lb n="13940"/> <mls unit="MS folio" n="120b 20"/> algis dia gaibseom f&eacute;in .i. Blad ar Bladaib a ainmside. &ampersir; da<ex>no</ex><!--</lb>--> co rragbat algis dona gaib indlithib dolleicther fair beus. At&aacute;<!--</lb>--> i tair&ndot;gere dia gaiseom r&iacute; do marb<ex>ad</ex> de. mani gabthar algis de. &ampersir;<!--</lb>--> tabraid g&aacute;ir guil &ampersir; &eacute;igmi. ni geba in fer ara bruth &ampersir; forbruth na<!--</lb>--> <mls unit="MS folio" n="120b 25"/> n-ech. &ampersir; ni chunnecha c<ex>o</ex>mlund chucaib ani<ex>al</ex> ro chunnig oc T&aacute;nai <lb n="13945"/> b&oacute; C<ex>ualnge</ex>. Dognither an&iacute;sin am<ex>al</ex> ro r&aacute;di Erc.<!--</lb>--></p>

<p>Doth&aacute;et tra Cu <ex>Chulaind</ex> dochum na buidni. &ampersir; dorat na tr&iacute;<!--</lb>--> torandchless forsin carp<ex>at</ex> .i. tor<ex>andchless</ex> c<ex>et</ex> &ampersir; tor<ex>andchless</ex> tri<!--</lb>--> c<ex>et</ex> &ampersir; tor<ex>andchless</ex> tri n&oacute;nbur. do urscartad na sl&oacute;g di Maig<!--</lb>--> Mur<ex>themni</ex>. Tanic Cu <ex>Chulaind</ex> cusin &mdot;budin. &ampersir; gab<ex>aid</ex> gl&eacute;s <lb n="13950"/> <mls unit="MS folio" n="120b 30"/> n-immberta a airm forru. Is cumma no imbred na gai &ampersir; in sc&iacute;ath<!--</lb>--> &ampersir; in claideb &ampersir; na clessa. comtar lir gainem mara &ampersir; renna nime &ampersir;<!--</lb>--> drucht c&eacute;tamuin &ampersir; loa snechtai &ampersir; bommand ega. &ampersir; dulli for fidbaid.<!--</lb>--> &ampersir; budi for Bregmaig. &ampersir; f&eacute;r fo chossaib g<ex>re</ex>ga i ll&oacute; samraid a lleithchind<!--</lb>--> <mls unit="MS folio" n="120b 35"/> &ampersir; a llethchloicne &ampersir; a llethlama. &ampersir; a llethchossa. &ampersir; a cn&aacute;ma derga <lb n="13955"/> comsca&iacute;lte iarna n-esr&eacute;diud fo Mag Mur<ex>themni</ex>. &ampersir; ropo liath in<!--</lb>--> magsin dia n-inchinnib iarsin tress dib<ex>er</ex>gesin &ampersir; imberta arm<!--</lb>--> dorat Cu <ex>Chulaind</ex> forru.<!--</lb>--></p>

<p>Iar sin co n-acca in d&iacute;s ocond immessorgain cena n-etarscarad.<!--</lb>--> Is mebol duit a Chu <ex>Chulaind</ex> cen etargaire na dessise ar in cainte. <lb n="13960"/> <mls unit="MS folio" n="120b 40"/> La sin tr&aacute; ro thairli&ndot;g Cu <ex>Chulaind</ex> chucu. &ampersir; dob<ex>eir</ex> buille dia durn<!--</lb>--> i cend chechtar de co tanic a n-inchind dara cluasaib &ampersir; dara sr&oacute;naib<!--</lb>--> immach. Dar&oacute;nais a n-etargaire or in cainte. ni dr&oacute;nand nechtar<!--</lb>--> de olc ria cheile. Ni betis na tost tria impide forru ar Cu <ex>Chulaind</ex>.<!--</lb>--> <mls unit="MS folio" n="120b 45"/> In gaisin damsa a Chu <ex>Chulaind</ex> or in cainte. To&ndot;gimse a to&ndot;ges <lb n="13965"/> mo th&uacute;ath. nach m&oacute; a richtu a lessa duitseo andas damsa. Ataat fir<!--</lb>--> Her<ex>end</ex> form sund &ampersir; at&uacute; forro da<ex>no</ex>. Not airubsa da<ex>no</ex> mani thuca<!--</lb>--> ar in cainte. Nirom aeradsa da<ex>no</ex> riam i cinaid mo drochthidnacuil.<!--</lb>--></p>


<pb n="448"/>

<p><mls unit="MS folio" n="120b"/> &#x026B; mo dothch<ex>er</ex>nais. La sodain ro d&iacute;bairg in &ndot;gai d&oacute; 's a urlond<!--</lb>--> <mls unit="MS folio" n="120b 50"/> reme co ndechaid triana chend. &ampersir; coro marb nonbur friss anall. <lb n="13970"/> Dodechaid Cu <ex>Chulaind</ex> triasin &mdot;buidin co forcend. La sin<!--</lb>--> ro gab Lug<ex>aid</ex> m<ex>ac</ex> Con Ru&iacute; in tres &ndot;gai n-indlithe ro bo&iacute; oc maccaib<!--</lb>--> Calatin. Cr&aacute;et dofaeth don gaiseo a macc.u Cal<ex>atin</ex> ar Lug<ex>aid</ex>.<!--</lb>--> <mls unit="MS folio" n="120b 55"/> Dofaeth r&iacute; din gaisin or m<ex>ei</ex>c Cal<ex>atin</ex>. Iar sin ro theilg Lug<ex>aid</ex><!--</lb>--> <mls unit="MS folio" n="121a"/> in &ndot;gai &#x2016; forsin carp<ex>at co</ex> tarlai i lL&aacute;eg m<ex>ac</ex> Riangabra. <ex>co</ex> tarlaic <lb n="13975"/> a mbu&iacute; do innib ina med&oacute;n co rrabi for fortchi in charp<ex>ait</ex>. Is and<!--</lb>--> sin ro r&aacute;id L&aacute;eg. Goirt rom gaet. &ampersir;c<!--</lb>--></p>

<p>Iar sin tra dob<ex>eir</ex> Cu <ex>Chulaind</ex> in &ndot;gai ass. &ampersir; celebraid L&oacute;eg.<!--</lb>--> <mls unit="MS folio" n="121a 5"/> Conid and atbert Cu C<ex>hulaind</ex> bam eirrse &ampersir; bam ara isind lathiusa<!--</lb>--> indiu. In tan rosiacht Cu C<ex>hulaind</ex> co forcend na buidni. Co <lb n="13980"/> n-accai in diis oc imessorgain ara b&eacute;laib &ampersir; c&aacute;inte co cull&uacute;aisc oca.<!--</lb>--> Is mebul duit ol indala fer a Chu <ex>Chulaind</ex> cen etairgaire etruind.<!--</lb>--> La sin tarblaing Cu C<ex>hulaind</ex> chuccu &ampersir; sreith cechtar de a leth co<!--</lb>--> <mls unit="MS folio" n="121a 10"/> nderna brosnaig &ndot;diib immon carraic ro bo&iacute; ina &fdot;arrad. In gaisin<!--</lb>--> damsa a Chu <ex>Chulaind</ex> ol in cainte. To&ndot;gusa a to&ndot;ges mo th&uacute;ath <lb n="13985"/> n&iacute; m&oacute; richtain a lessa in gai duitsiu oldaas damsa. Cethri choicid<!--</lb>--> Her<ex>en d</ex> form l&aacute;im &ampersir; form gail &ampersir; form gaisced do aurscartad di Maig<!--</lb>--> <mls unit="MS folio" n="121a 15"/> Mur<ex>themni</ex> isind l&oacute;sa indiu. Nott a&iacute;rubsa ol in cainte. Ni dlegar<!--</lb>--> d&iacute;m acht oenailgis isind losa. &ampersir; da<ex>no</ex> ro &iacute;ccus do chind m'enig indiu<!--</lb>--> chena. A&iacute;rfatsa Ul<ex>tu</ex> it chinaidsiu ol in cainte. Nira aertha &eacute;m <lb n="13990"/> r&iacute;am ol se i cin mo d&iacute;bese. na<ex>ch</ex> mo dothch<ex>er</ex>nais. A mbec arath&aacute;<!--</lb>--> <mls unit="MS folio" n="121a 20"/> d&imacr; dom &sdot;aegulsa n&iacute; airfait<ex>her</ex> issind lathiusa indiu. Dobert Cu<!--</lb>--> <ex>Chulaind</ex> in gai d&oacute; ar urlaind co ndechaid triana chend &ampersir; coro<!--</lb>--> marb n&oacute;nbur ris an&iacute;ar. &ampersir; fethid triasin &mdot;buidin am<ex>al</ex> atrubramar<!--</lb>--> remaind. <lb n="13995"/></p>

<p>Ro gab Erc m<ex>a</ex>c Cairp<ex>ri</ex> in tres gae indlithi ro bo&iacute; oc maccaib<!--</lb>--> Cal<ex>atin</ex>. Cid bias din gaiseo a maccu Cal<ex>atin</ex> ar Erc m<ex>a</ex>c Car<ex>pri</ex>.<!--</lb>--> <mls unit="MS folio" n="121a 25"/> Ni <ex>handsa</ex>. Dofuit r&iacute; din gaisin ar m<ex>ei</ex>c Cal<ex>atin</ex>. Rochuala lib<!--</lb>--> dofa&iacute;thsad din gai o chianaib ro leici Lug<ex>aid</ex>. Is f&iacute;r on &eacute;m or m<ex>ei</ex>c<!--</lb>--> Cal<ex>atin</ex>. dorocli<ex>air</ex> r&iacute; arad Her<ex>end</ex> de .i. ara Con Cul<ex>aind</ex> .i. Laeg <lb n="14000"/> m<ex>ac</ex> R<ex>iangabra</ex>. To&ndot;gus a to&ndot;ges mo th&uacute;ath ni t&eacute;t ar guin r&iacute;g<!--</lb>--> <mls unit="MS folio" n="121a 30"/> rod mb&iacute;. La sin dolleici Erc in gai fair conid ecmai&ndot;g issin Liath<!--</lb>--> M<ex>acha</ex>. Gataid Cu C<ex>hulaind</ex> in &ndot;gai ass. &ampersir; celebrais c&aacute;ch dia<!--</lb>--> cheile d&iacute;b. La sodain leicthi in Liath M<ex>acha</ex> &ampersir; leth a chu&ndot;ga fo<!--</lb>--></p>


<pb n="449"/>

<p><mls unit="MS folio" n="121a"/> br&aacute;git co ndechaid i lLind L&eacute;ith i Sliab &Fdot;uait. Is ass dodechaid <lb n="14005"/> C<ex>on</ex> C<ex>u</ex>l<ex>aind</ex> is inti da<ex>no</ex> dochuaid iarna guin. Conid de asbert<!--</lb>--> <mls unit="MS folio" n="121a 35"/> Cu <ex>Chulaind</ex>. Rires t'ech &oacute;enchuing sunda indiu ol Cu <ex>Chulaind</ex>.<!--</lb>--> La sain ataig Cu <ex>Chulaind</ex> a lethchoiss fo chend inna cu&ndot;ga. &ampersir;<!--</lb>--> faidid tresin &mdot;budin in n-inas cetna. Co n-acca in d&iacute;s ocind<!--</lb>--> immesor<ex>gain</ex> ara chind. &ampersir; cainte co cullisc ocaib. Ros etarscar <lb n="14010"/> iarum. &ampersir; nirbo messu in t-etarscarad dorat forru andaas forsin<!--</lb>--> <mls unit="MS folio" n="121a 40"/> cethrur n-aile. In gaisin damsa a Chu <ex>Chulaind</ex> ol in cainte.<!--</lb>--> N&iacute; m&oacute; a richtain a lessa duit in gai and&aacute;s damsa. Not a&iacute;rubsa<!--</lb>--> ol in cainte. Ro &iacute;ccus dom inchaib indiu. ni dlegar dam acht<!--</lb>--> oenalgis isind lousa. A&iacute;rfatsa Ul<ex>tu</ex> it chinta. Ro iccus dia <lb n="14015"/> <mls unit="MS folio" n="121a 45"/> n-inchaib ol se. Airfatsa do chen<ex>e</ex>l or in cainte. T&iacute;r &eacute;m nad ranacsa<!--</lb>--> riam n&iacute; ricfat sc&eacute;la m'&eacute;cnaig remum. uair is bec at&aacute; dom saegul.<!--</lb>--> Dotheilg Cu C<ex>hulaind</ex> in ngai d&oacute; &ampersir; a urlond reme co ndechaid triana<!--</lb>--> chend &ampersir; tr&eacute; tr&iacute; nonboru aile. Is rath co feirg a Chu <ex>Chulaind</ex> ar<!--</lb>--> in c&aacute;<ex>n</ex>ti. <lb n="14020"/></p>

<p><mls unit="MS folio" n="121a 50"/> Iar sin tra luid Cu <ex>Chulaind</ex> aridisi tresin &mdot;buidin co forcend.<!--</lb>--> Iar sin da<ex>no</ex> ro gab Lug<ex>aid</ex> in tres gai indlithi ra bo&iacute; oc maccaib<!--</lb>--> Cal<ex>atin</ex>. Cid bias din gaiseo a maccu Cal<ex>atin</ex> Tuitfid r&iacute; de ar<!--</lb>--> m<ex>ei</ex>c Cal<ex>atin</ex>. Rochuala lib dof&aacute;ethsad din gai ro leci Erc<!--</lb>--> imbuaruch. Is fir &oacute;n or se daroch<ex>air</ex> r&iacute; ech Her<ex>end</ex> de .i. in Liath <lb n="14025"/> <mls unit="MS folio" n="121a 55"/> M<ex>acha</ex>. To&ndot;gusa a ton<ex>ges</ex> mo thuath n&iacute; ta&iacute;t ar guin r&iacute;g rod b&iacute;.<!--</lb>--> <mls unit="MS folio" n="121b"/> La ssin doll&eacute;ci &#x2016; Lug<ex>aid</ex> in &ndot;gai do Choin Cul<ex>aind</ex> co n-ecmoi&ndot;g<!--</lb>--> ind co tarlaic anro bu&iacute; ina broind co rrabi for fortchi in charp<ex>ait</ex>.<!--</lb>--> La sin dolluid in Dub Sai&ndot;glend &uacute;ad co lleith a chunga co lluid i<!--</lb>--> <mls unit="MS folio" n="121b 5"/> lLoch &ndot;Dub i cr&iacute;ch Muscraige T&iacute;re. Is ass dodechuid dochum <lb n="14030"/> Con Cul<ex>aind</ex>. Is and luid aridisi coro &fdot;ichi in loch la sodain.<!--</lb>--></p>

<p>Iar sain tra tarrasair in carp<ex>at</ex> a o&iacute;nur forsin maig. Iar sin<!--</lb>--> atbert Cu C<ex>hulaind</ex>. Rop ail damsa ol Cu <ex>Chulaind</ex> dul <ex>con</ex>nici<!--</lb>--> in loch ucut d'&oacute;l digi ass. Is cet lind ar iat acht co t&iacute;s chucund<!--</lb>--> <mls unit="MS folio" n="121b 10"/> aridisi. Forcongersa foruib or Cu <ex>Chulaind</ex> mani th&iacute;siursa f&eacute;in <lb n="14035"/> co tistaisi armo chend.<!--</lb>--></p>

<p>Iar sin tra ro theclaim inne a brond ina ucht. &ampersir; t&eacute;it ass dochum<!--</lb>--> ind locha. Am<ex>al</ex> ro n-&aacute;nic in loch ataig a l&aacute;im sethno a brond<!--</lb>--> co fargab anro bo&iacute; do indib ina broind. Ibid dig iarum &ampersir; fothruci<!--</lb>--> <mls unit="MS folio" n="121b 15"/> ass. Is de at&aacute; Loch L&aacute;mraith i mMaig Mur<ex>themni</ex>. Ainm aile <lb n="14040"/> d&oacute; da<ex>no</ex> Loch Tondchuil. Iar sin docuridar bedg ass. &ampersir; forco&ndot;gair<!--</lb>--> foraib co ndigsitis ara chend.<!--</lb>--></p>

<p>Dodechaid iarum cr&iacute;ch m&oacute;r ond loch s&iacute;ar. &ampersir; rucad a rosc airi. &ampersir;<!--</lb>--> <mls unit="MS folio" n="121b 30"/> t&eacute;it dochum coirthi cloiche file isin maig co tarat a choimchriss<!--</lb>--></p>


<pb n="450"/>

<p><mls unit="MS folio" n="121b"/> immi nar ablad na &sdot;uidiu na<ex>ch</ex> ina ligu. <ex>com</ex>bad ina &sdot;essam atbalad. <lb n="14045"/> Is iar sin dodechatar na fir imma cuairt immi &ampersir; niro lamsatar<!--</lb>--> dul a dochum. Andar leo ropo beo. Is mebol d&uacute;ib ol Erc m<ex>a</ex>c<!--</lb>--> <mls unit="MS folio" n="121b 25"/> Car<ex>pri</ex> cen chend ind &fdot;ir do thabairt lib i ndigail chind m'atharsa<!--</lb>--> rucad leis coro adnacht fri airsce Echdach Nia Fer. Rucad a<!--</lb>--> chend assaide co fil i S&iacute;d Nenta iar nUsciu. <lb n="14050"/></p>

<p>Iar sin tra dodechaid in L&iacute;ath M<ex>acha</ex> co Coin C<ex>ulaind</ex> dia imchom&eacute;t<!--</lb>--> i c&eacute;in ro bo&iacute; a anim and &ampersir; ro mair in lon l&aacute;ith assa &eacute;tun. Is iarum<!--</lb>--> <mls unit="MS folio" n="121b 30"/> b<ex>ir</ex>t in Liath M<ex>acha</ex> na tri dergruath<ex>ra</ex> immi ma cuairt. co tor<ex>chratar</ex><!--</lb>--> .l. leis cona &fdot;iaclaib. &ampersir; xxx. ca<ex>ch</ex> cru&iacute; d&oacute; iss <ex>ed</ex> ro marb don t&sdot;l&uacute;ag.<!--</lb>--> Conid de at&aacute; nitathe buadremm<ex>en</ex>d ind L&eacute;ith M<ex>acha</ex> iar marb<ex>ad</ex> <lb n="14055"/> Con Cul<ex>aind</ex>. Conid iar sin dolluid ind ennach fora gualaind.<!--</lb>--> Nirbo gn&aacute;th in corthe &uacute;t fo enaib ar Erc m<ex>ac</ex> Cor<ex>pri</ex>. Iar sin tra<!--</lb>--> <mls unit="MS folio" n="121b 35"/> ra choraig Lug<ex>aid</ex> a moi&ndot;g dara aiss. &ampersir; benaid a chend de. Iar<!--</lb>--> sin tra doroch<ex>air</ex> a chlaideb a llaim Con Cul<ex>aind</ex> co n-eccmoi&ndot;g a<!--</lb>--> l&aacute;im do&iacute; di Lug<ex>aid</ex> co rrabi for l&aacute;r. Benair a l&aacute;m do&iacute; da<ex>no</ex> di <lb n="14060"/> Choin Cul<ex>aind</ex> dia digail.<!--</lb>--></p>

<p>Doc<ex>u</ex>mlat ass iarum in t&sdot;l&uacute;aig &ampersir; doberat leo cend Con Cul<ex>aind</ex> &ampersir;<!--</lb>--> <mls unit="MS folio" n="121b 40"/> a laim d&oacute;i co tancatar Tem<ex>raig</ex>. Conid and at&aacute; otharlige a chind<!--</lb>--> &ampersir; a l&aacute;ime do&iacute;. &ampersir; l&aacute;n lainne a sc&eacute;ith di &uacute;ir. Conid de asbert<!--</lb>--> Ceiid Fael<ex>ad</ex> m<ex>ac</ex> Ail<ex>el</ex>la. i nAidedaib Ul<ex>ad</ex>. <lb n="14065"/></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l>Doceir Cu <ex>Chulaind</ex> ca&iacute;n tuir.<!--</lb>--></l>
<l>tr&eacute;n&fdot;er i nnAirbiu Ro&fdot;ir<!--</lb>--></l>
<l>reraig buidne ba m&oacute; clith.<!--</lb>--></l>
<l>for M<ex>a</ex>c Tri Con for Lugthig.<!--</lb>--></l></lg></body></text></p>

<p><text type="poem"> <body>
<lg type="couplet" n="1">
<l>l&iacute;n todforchair ferda &ndot;gl&eacute; <lb n="14070"/></l>
<l>nirbo thuttim midlaige.<!--</lb>--></l></lg></body></text></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l><mls unit="MS folio" n="121b 45"/> Cethri ochtair cethri deich.<!--</lb>--></l>
<l>cethri co&iacute;cait cain in treith;<!--</lb>--></l>
<l>cethri trichait tolgda r&iacute;m<!--</lb>--></l>
<l>cethri cethrachait cruaidgnim. <lb n="14075"/></l></lg></body></text></p>

<p><text type="poem"> <body>
<lg type="couplet" n="1">
<l>Cethri fichit fr&iacute;th co feib.<!--</lb>--></l>
<l>fosroirtib m<ex>ac</ex> Sualti<ex>n</ex>;<!--</lb>--></l></lg></body></text></p>

<pb n="451"/>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l><mls unit="MS folio" n="121b"/> Ro gaet i n-athgubu<!--</lb>--></l>
<l>tricha r&iacute;g di erchoraib.<!--</lb>--></l>
<l>im uii. fichtiu anchinne <lb n="14080"/></l>
<l>fosnacaib di erbonaib.<!--</lb>--></l></lg>

<lg n="2">
<l>Ata cend chonar do.<!--</lb>--></l>
<l>droneirr i n-ochtor Temro.<!--</lb>--></l>
<l>uaigthe iarom a forceth.<!--</lb>--></l>
<l>d'airsciu Cairp<ex>ri</ex> Niod Fer <lb n="14085"/></l></lg>

<lg n="3">
<l><mls unit="MS folio" n="121b 50"/> Ata cend Echdach indiu<!--</lb>--></l>
<l>i sS&iacute;d Nenta iar Usciu;<!--</lb>--></l>
<l>&Uacute;aigthe cend Corp<ex>ri</ex> ca&iacute;n r&iacute;<!--</lb>--></l>
<l>do airsciu Echdach i Tethbai.<!--</lb>--></l></lg></body></text></p>

<p>Iar sin documlat in t&sdot;l&uacute;aig ass fades co rancatar abaind Lifi. <lb n="14090"/> <mls unit="MS folio" n="122a"/> Am<ex>al</ex> rancatar in n-abaind &#x2016; asbert Lug<ex>aid</ex> fria araid. Is trom<!--</lb>--> lim mo chriss l&aacute;n immum ol se. Is &aacute;il dam mo &fdot;othruc<ex>ud</ex>.<!--</lb>--> Docuredar ass erchomuir in t&sdot;l&uacute;aig. Fothraicid iarum.<!--</lb>--> Documlaiset ass iar suidiu. Atetha &iacute;ach et<ex>er</ex>a da cholptha.<!--</lb>--> <mls unit="MS folio" n="122a 5"/> docuiredar suas dia araid. benaidside tenid dia urgnum fo chet&oacute;ir. <lb n="14095"/></p>

<p>Is iar sin documlat sl&uacute;aig Ulad at&uacute;aid o Emuin Macha dochum<!--</lb>--> Sleibe Fuait iar cur a cessa d&iacute;b. Ro bo&iacute; cinniud tria chomb&aacute;ig<!--</lb>--> iarum et<ex>er</ex> Choin Cul<ex>aind</ex> &ampersir; <ex>Con</ex>all C<ex>ernach</ex> .i. ciped chia d&iacute;b no<!--</lb>--> <mls unit="MS folio" n="122a 10"/> marbtha ar t&uacute;s a digail dia cheiliu. &ampersir; mad misse marbthair ar<!--</lb>--> t&uacute;s ar C&uacute; <ex>Chulaind</ex> cia luathe nom d&iacute;gela. A lla not gentar ar <lb n="14100"/> Conall C<ex>ernach</ex> do digai; damsa resin fescursin. &ampersir; mad misse<!--</lb>--> marb<ex>thair</ex> and or Conall. cia luathe nom dig&eacute;la. Nipa &uacute;ar th'&fdot;uilsiu<!--</lb>--> limsa for tal<ex>main</ex> ol Cu <ex>Chulaind</ex> in tan not dig&eacute;l.<!--</lb>--></p>

<p><mls unit="MS folio" n="122a 15"/> In tan iarum dodechaid Conall C<ex>ernach</ex> resin sl&uacute;ag ina charp<ex>ut</ex><!--</lb>--> co comarnic frisin Liath M<ex>acha</ex> &ampersir; a thoesca fola tr&iacute;&iacute;t oc dul do Lind <lb n="14105"/> L&eacute;ith. Conid and asbert Conall C<ex>ernach</ex>.<!--</lb>--></p>

<p>.R. Ni c<ex>u</ex>mgid cui&ndot;ge co lLind L&eacute;ith co rrega co fuilib<!--</lb>--> fonnaide fo chollaib cl&iacute; co fuidlechtaib fuili fir sceo eich im<!--</lb>--> <mls unit="MS folio" n="122a 20"/> l&aacute;im do&iacute; Lug<ex>dach</ex>. Lug<ex>aid</ex> m<ex>ac</ex> Con Ru&iacute; m<ex>eic</ex> Dare iss e ro<!--</lb>--> marb mo chomaltsa Coin Cul<ex>aind</ex>. <lb n="14110"/></p>


<pb n="452"/>

<p><mls unit="MS folio" n="122a"/> Luid &iacute;ar sin Conall C<ex>ernach</ex> &ampersir; in Liath M<ex>acha</ex> reme coro l&aacute; cuairt<!--</lb>--> sinn arbaig. Co n-accatar Coin Cul<ex>aind</ex> immon corthe. Luid<!--</lb>--> da<ex>no</ex> in L&iacute;ath M<ex>acha</ex> co tarat a chend for brunnib Con Cul<ex>aind</ex>. Is<!--</lb>--> dethitiu don Liath M<ex>acha</ex> in corp &uacute;t ar Conall. T&eacute;it tra Conall<!--</lb>--> <mls unit="MS folio" n="122a 25"/> iar tain. &ampersir; ataig a thraig fri airrbe. To&ndot;gusa a to&ndot;ges mo th&uacute;ath. <lb n="14115"/> ar se. rop airrbe ro&fdot;ir in so. Ro batsis ainm dond inud ol in dru&iacute;.<!--</lb>--> Bid ed ainm in tiriseo co br&aacute;th. Airrbe Ro&fdot;ir.<!--</lb>--></p>

<p>Tocumla&iacute; iarum i ndegaid in t&sdot;l&uacute;aig. Is and ro bo&iacute; Lug<ex>aid</ex><!--</lb>--> oca &fdot;oth<ex>rucud</ex>. Decce d&uacute;n a mmag ol Lug<ex>aid</ex> fria araid na tistar<!--</lb>--> <mls unit="MS folio" n="122a 30"/> chucund cen aicsin. Dof&eacute;ccai secha in t-ara. Dofil oenmarcach <lb n="14120"/> sund chucund or se. &ampersir; is m&oacute;r a. gripe &ampersir; a luas dothet. indar lat is<!--</lb>--> feochuine Her<ex>end</ex> fil uasa. Indar lat it loa snectai breccait a<!--</lb>--> mmag fris anair. N&iacute; inmain in marcach dothaet and ar Lug<ex>aid</ex><!--</lb>--> <mls unit="MS folio" n="122a 35"/> .i. Conall C<ex>ernach</ex> in sin forsin Deirg Druchtais. Na eoin<!--</lb>--> atchonnarcais uasu. na f&oacute;it a cruib ind eichsin. na loa snechtai <lb n="14125"/> atchon<ex>narcais</ex> do breccad in maige friss anair. uanbach a b&eacute;laib<!--</lb>--> ind eichsin. &ampersir; a gglomraib in t&sdot;r&eacute;in. F&eacute;g darisse ar Lug<ex>aid</ex> cisi<!--</lb>--> chonar doth&aacute;et. Doth&aacute;et dochum ind atha ar in t-ara .i. in chonar<!--</lb>--> <mls unit="MS folio" n="122a 40"/> dodechaid in sl&uacute;ag. Doll&eacute;ic sechund in t-echsin ar Lug<ex>aid</ex> n&iacute;<!--</lb>--> &aacute;il d&uacute;n comrac fris. <lb n="14130"/></p>

<p>In tan iarum rosiacht Conall C<ex>ernach</ex> co med&oacute;n ind &aacute;tha dof&eacute;ccai<!--</lb>--> secha d<ex>&eacute;</ex> de araid sucut ar se. Dofeccai secha in tres fecht. D&eacute;<!--</lb>--> de rig s&uacute;t ar se. Is ferr damsa a adall. Adella cuccu. Is fo-<!--</lb>--> <mls unit="MS folio" n="122a 45"/> chen aged &fdot;&eacute;cheman. ol Conall C<ex>ernach</ex>. Int&iacute; da<ex>no</ex> dia ndligi<!--</lb>--> &fdot;iachu dosfothlaig fair. Dligim d&iacute;tsu ar Conall C<ex>ernach</ex> .i. marbad <lb n="14135"/> mo chomcheili Con Cul<ex>aind</ex> &ampersir; it&uacute; ic triall a acrai &fdot;ort. N&iacute; c&oacute;ir<!--</lb>--> &oacute;n or Lug<ex>aid</ex> ar n&iacute; armide ar laechdacht duitsiu comrac frimsa<!--</lb>--> sund co rr&iacute; b&uacute;aid mo choscair lim t&iacute;r Muman. Dog&eacute;naindse mani<!--</lb>--> <mls unit="MS folio" n="122a 50"/> beth techt d&uacute;n for oenchonair &ampersir; i comlabrai &ampersir; i cotchennas or<!--</lb>--> Conall C<ex>ernach</ex>. Nipa hansa a mbia di &sdot;udiu or Lug<ex>aid</ex>. Regatsa <lb n="14140"/> amne for Bel<ex>ach</ex> Gabr&uacute;ain co ndechus for Belach Smechuin.<!--</lb>--> Airgsiu amne for Gabuir for Mairg Lagen co comairsem i mMaig<!--</lb>--> Argetrois. Lug<ex>aid</ex> is &eacute; cetaranic. Tanic a cheile ina diaid .i.<!--</lb>--> <mls unit="MS folio" n="122b"/> Conall C<ex>ernach</ex>. Tarlaic urchor fair &#x2016; dia &sdot;lig. &ampersir; a choss frisin<!--</lb>--> coirthe fil i mMaig Argetrois <ex>co n</ex>decmaing i lLug<ex>aid</ex> conid de <lb n="14145"/> at&aacute; Corthe Lug<ex>dach</ex> i mMaig Argetrois.<!--</lb>--></p>


<pb n="453"/>

<p><mls unit="MS folio" n="122b"/> Luid iarum iarna ch&eacute;tguiniu co mbo&iacute; oc Fertai Lug<ex>dach</ex> i nDroictib<!--</lb>--> <mls unit="MS folio" n="122b 5"/> Ossairge. Conid and immanarraid d&oacute;ib. Rop &aacute;il damsa or Lug<ex>aid</ex><!--</lb>--> conum rabad fir fer &uacute;aitsiu. Cid &oacute;n or Conall C<ex>ernach</ex>. Connacham<!--</lb>--> thised &uacute;ait acht oenl&aacute;m. ar n&iacute; &fdot;il acht oenl&aacute;m lim. Rot bia or <lb n="14150"/> Conall C<ex>ernach</ex>. Ce&ndot;galtar a l&aacute;m iar<ex>u</ex>m dia th&oacute;eb co suanemnaib.<!--</lb>--> Ro batar ind sin et<ex>er</ex> da thr&aacute;th din l&oacute;. &ampersir; ni &fdot;uair nechtar de eill<!--</lb>--> <mls unit="MS folio" n="122b 10"/> fora cheile. In tan nad &fdot;&uacute;air Conall C<ex>ernach</ex> eill fair dofeccai<!--</lb>--> secha a gabuir .i. in Deirg &ndot;Druchtaig. Cend con furris<ex>id</ex>e. for-<!--</lb>--> dibad na firu isna cathaib &ampersir; isna irgalaib. La sin donic in gabuir <lb n="14155"/> chuci corra gaib m&iacute;r assa tho&iacute;b co tarlaic inna raba ina broind<!--</lb>--> <mls unit="MS folio" n="122b 15"/> co rraba imma chossa. Fe amae or Lug<ex>aid</ex> n&iacute; f&iacute;r fer an&iacute;sin a<!--</lb>--> Chon<ex>aill</ex> C<ex>hernaig</ex>. Ni tharddusa duitsiu or Conall C<ex>ernach</ex> act<!--</lb>--> darmo chend f&eacute;in. Ni tharddus i&mmacr; duit dar cend na robb &ampersir; na<!--</lb>--> n-ecodnach. Ro&fdot;et<ex>ur</ex>sa tra or Lug<ex>aid</ex> nad ragasu co rruca mo <lb n="14160"/> chendsa latt. uair dofucsamni cend Con Cul<ex>aind</ex>. Co tardda<!--</lb>--> <mls unit="MS folio" n="122b 20"/> tr&aacute; ar se mo chendsa ar do chend &ampersir; co n-erbara mo r&iacute;gise fordo<!--</lb>--> r&iacute;ge. &ampersir; mo gaisced fordo gaisced. Ar is ferr limsa combad t&uacute;<!--</lb>--> laech bad dech no beth i nHer<ex>ind</ex>. La ssin b<ex>en</ex>aid Conall C<ex>ernach</ex><!--</lb>--> a chend de. <lb n="14165"/></p>

<p>Tocumlai ass iarum cosin cend leiss. Co comarnic fri Ulto i<!--</lb>--> rRoirind hi tirib Lagen. Forruimther a cend forsin chloich &ampersir; ro<!--</lb>--> <mls unit="MS folio" n="122b 25"/> dermatad and. Co rrancatar Gris. Is and sin imchoemnacair<!--</lb>--> Conall C<ex>ernach</ex>. in tuc nech uaib a cend ar se. Ni thucsam ar<!--</lb>--> c&aacute;ch. Is and asbert Conall C<ex>ernach</ex>. To&ndot;gusa a to&ndot;ges mo th&uacute;ath <lb n="14170"/> or se n&iacute; midbine in sin. Is de at&aacute; Midbine oc Roirind. Tintaiset<!--</lb>--> <mls unit="MS folio" n="122b 30"/> dochum in chind arise. Co n-accas n&iacute; ro b<ex>er</ex>bai in cend in cloich<!--</lb>--> co ndechaid treithe. Niro damsat Ul<ex>aid</ex> co mbuaid choscair do<!--</lb>--> Emuin M<ex>acha</ex> in t&sdot;echtmainsin. Ro damastar i&mmacr; anim Con Cul<ex>aind</ex><!--</lb>--> <ex>co</ex> tarf&aacute;d don .l. r&iacute;gan ro &sdot;araigestar a llaa re tuidecht don chath. <lb n="14175"/> Co n-accas n&iacute; Cu <ex>Chulaind</ex> ina &sdot;iaburcharp<ex>ut</ex> isind ae&oacute;r os Emuin<!--</lb>--> M<ex>acha</ex>. Conid and ro chan Cu <ex>Chulaind</ex> d&oacute;ib co n-erbairt iarna<!--</lb>--> eistecht.<!--</lb>--></p>

<p><mls unit="MS folio" n="122b 35"/> Eomuin Eomuin. oll olleith. tan r&eacute; Talcind trebfait iathu<!--</lb>--> Emna. ticfat de Eoraip Elpae. di usciu ethar domuin <lb n="14180"/> dobn&iacute;m co sluagaib Succet sailiu gil gigsit co rr&iacute;g n-ardnime<!--</lb>--> alchel coton Sion suidigthe leis raigma do lathiu lanbratha.<!--</lb>--> <mls unit="MS folio" n="122b 40"/> Fer cain co&ndot;geba frim anair isind o&iacute;nmaig. maith in sin co<!--</lb>--> comairsem a Emain.<!--</lb>--></p>
</div1>


<pb n="454"/>
<div1 n="11">
<head><mls unit="MS folio" n="122b"/> Siaburchobra Con Cul<ex>aind</ex> i llathiu a &eacute;itsechta.<lb n="14185"/></head>

<p>&Uacute;aine ortae a Eomuin. Ditiu ortae Eomuin. ar cleith<!--</lb>--> doclast a Eomuin. Docer i cath a Eomuin. ciab oen<!--</lb>--> <mls unit="MS folio" n="122b 45"/> fri iliu. do loeg dofuart firu. Uaine ortae Eomuin. dofias m&oacute;r<!--</lb>--> fer mar fer mart. forriadam r&eacute;im n-erch&iacute;an ar ba rom ron<!--</lb>--> traethad. Toret im g&aacute;ir &ndot;gubae. Cain aindrae dun subae. Setu <lb n="14190"/> finna. forcu Decht<ex>ir</ex>e. duin deme. dimemed art uasal.<!--</lb>--> mad arg n-erred. rissed do fius m&aacute;r fer mart. Mad oen fri<!--</lb>--> oen n-uathad admuind findm<ex>a</ex>c nEithnend. Ca<ex>ch</ex> cruth<!--</lb>--> <mls unit="MS folio" n="122b 50"/> ca<ex>ch</ex> leth robae ro fertad fer Aife. Atbath Loeg iruilled<!--</lb>--> nach bad tr<ex>u</ex>mmu t<ex>ur</ex>baid to&mmacr; mo chaurchobraid Conall <lb n="14195"/> cono&iacute; lui&ndot;g l&uacute;ath o Ul<ex>taib</ex> echraid echlaig dilind duib a<!--</lb>--> mMuig Eo i mMaig Cride. U.<!--</lb>--></p>
</div1>
<div1 n="12">
<head>Cu <ex>Chulaind</ex> atbert. De aduentu Chr<ex>ist</ex>i.<!--</lb>--></head>

<p><mls unit="MS folio" n="122b 55"/> CR<ex>ist</ex> cetar&eacute;t iathu &eacute;cmacht n-anf&oacute;t frecnairc &#x2016; <!--</lb>--> <mls unit="MS folio" n="123a"/> fallnabthair ar chen<ex>e</ex>l fechid. ar chel coemr&iacute; Comdiu <lb n="14200"/> &iacute;sund &uacute;asund athardae domoin do imd&uacute;n duin fri nelbruig<!--</lb>--> nia do&iacute;ne ticfa a recht ca<ex>ch</ex> leth linfaid. lenfaid. do thoga&iacute;s.<!--</lb>--> troethfaid Isu iffern. imergib &aacute;il &Aacute;daim i flaith forbais fol&aacute;im<!--</lb>--> <mls unit="MS folio" n="123a 5"/> fris mbet formdig ingair fris failtniget fris raidfet recht nime.<!--</lb>--> cia riseo cia tuili. dia n-ep<ex>er</ex>at arbuir in r&iacute; ro &iacute;cc talmain ar <lb n="14205"/> flaith fordonosd&aacute;. ar r&iacute;chid natesba&iacute; do foirm nert nime la<!--</lb>--> forlinad suide s&eacute;is for dindaib flatha. in r&iacute; iar &mdot;b&uacute;aid chatha.<!--</lb>--> <mls unit="MS folio" n="123a 10"/> oenaib. dedaib tredaib tria chumachta nat <ex>er</ex>glond. nad<!--</lb>--> ecgut<ex>h</ex>. nad erbur. Dall taidbsiu do do&iacute;nib. robud ria. mb&aacute;s.<!--</lb>--> bias renna nime. Fochroithfet. grian gel inderg dithsir r&eacute;im <lb n="14210"/> &ndot;glas rotha resair esce foleth luigther in luachthaidiu<!--</lb>--> amser tria. torromu. &Iacute;su as uasliu. as isliu tria erscartad<!--</lb>--></p>


<pb n="455"/>

<p><mls unit="MS folio" n="123a"/> iff<ex>ir</ex>n. tria &sdot;uidigud suide tria thuaslucud flatha. tria lanarbur<!--</lb>--> <mls unit="MS folio" n="123a 15"/> catha. tria lanchumacta nime im nimib. im doine im duile<!--</lb>--> im bethu tria bithu. Cr<ex>ist</ex>. <lb n="14215"/></p>

<p>Luid in Liath M<ex>acha</ex> do chelebrad do Emir. Co tara a chend<!--</lb>--> ina hucht. &ampersir; dochuaid ina dessel fo thr&iacute;. &ampersir; desel D&uacute;in Imrid. &ampersir;<!--</lb>--> Duin Delga.<!--</lb>--></p>
</div1>
<div1 n="13">
<head>Nuallguba Emire in so.<!--</lb>--></head>

<p><mls unit="MS folio" n="123a 20"/> A Leith M<ex>acha</ex> m&oacute;r n-essad. m&oacute;r &ndot;dirsan. m&oacute;r &ndot;galgat. <lb n="14220"/> . m&oacute;r mairg. nodat d&eacute;cai immuddidnad nachitoisci<!--</lb>--> cotuteilged eirr chain chumachtach cathbuadach uas do chl&iacute;u<!--</lb>--> nad chliss c<ex>r</ex>ichbrugi Macha m<ex>eic</ex> hui Nendr&uacute;aid. n&eacute;l find<!--</lb>--> for&eacute;tis r&iacute;g side seol n-&oacute;ir uas dindaib. ar thuathaib ilib imgonad<!--</lb>--> <mls unit="MS folio" n="123a 25"/> gein &oacute;ir uas t'anail ar faebraib fechaid f<ex>or</ex>r&uacute;air dubu Delgae <lb n="14225"/> dilachtai. Torreith rig eirr sceo b&aacute;s r&iacute; ech uas echaib. uas<!--</lb>--> be<ex>m</ex>m<ex>en</ex>naib oc buadaib oc foromnaib for &eacute;naib. Nit ecmai&ndot;g<!--</lb>--> fleisc na urlond. na urchor. nit ecmaing fein cl&iacute; congaibed<!--</lb>--> ferna aurdloctai. nit ecmoi&ndot;g dess dia mbenad bidbadu.<!--</lb>--> <mls unit="MS folio" n="123a 30"/> fordombenad a bunad imm<ex>u</ex>mdiched a ur&uacute;ath nam biathad a <lb n="14230"/> aruit. ardum cetmunt<ex>er</ex> ca&iacute;n cathbuadach. ciallastar iar dun<!--</lb>--> chath chruaid. n-oenguine. Atambebai ecomlund i c&eacute;taine. i<!--</lb>--> c&eacute;tlathiu &fdot;ogomuir eirr broga M<ex>ur</ex>themni millsit ammaiti<!--</lb>--> dichimmid n-etain. granne genite. cruan cern Con C<ex>u</ex>l<ex>aind</ex><!--</lb>--> <mls unit="MS folio" n="123a 35"/> cathbuadaig. Car in mete nasad mo miad no m&eacute;t no gal no <lb n="14235"/> gart no gr&aacute;d. no gn&iacute;m. inid Cu Ch<ex>ulaind</ex> cathbuadach ocona<!--</lb>--> ragaib r&eacute;. Rol&aacute; &aacute;r do Galianaib fri Her<ex>nu</ex>. Ros mb&iacute;<!--</lb>--> Eraind arid &mdot;bebsat b&aacute;s. Ar rofit<ex>ir</ex> eirr cha&iacute;n chumachtach<!--</lb>--> chathbuadach co ng<ex>re</ex>ssed grissaib cl&oacute;itis riana gail gabais<!--</lb>--> <mls unit="MS folio" n="123a 40"/> immi ec&oacute;ir ara torchair a sc&iacute;ath. ara n-imgaib a ech. <lb n="14240"/> athc<ex>u</ex>mmai a delg. Dolluid adollus ara thethraig a nert<!--</lb>--> nach &ndot;derbai dia ch&eacute;im. Co farnaic ammaiti tuathchaecha<!--</lb>--> ara chind. cu glas fonoiset fri tindell a cliu do cossecht.<!--</lb>--> foa ur&sdot;eilb oa bund coa mullach corbo marb a leth laith gaile.<!--</lb>--> <mls unit="MS folio" n="123a 45"/> friasa comarnic. co torchair a ech ainmem. Liath leggur <lb n="14245"/> Dub Aiglend. olc lige adbul sluag doceir ciarbo oenchossid<!--</lb>--> oenl&aacute;maid dithrachtai dia oenuch.<!--</lb>--></p>


<pb n="456"/>

<p>Ro marb Cu <ex>Chulaind</ex> .uiii. L&aacute;ith. uiii. N&iacute;aith .uiii. Feci .uiii.<!--</lb>--> nOengusa .uiii. Fiachaig .uiii. Fergusa .uiii. Faelgusa .x. &mdot;Brudi<!--</lb>--> <mls unit="MS folio" n="123a 50"/> .x. &mdot;Br&oacute;in .x. &mdot;Brenaind .x. Corp<ex>ri</ex> .x. Crimthaind .x. Conaire <lb n="14250"/> .x. Conaill .ix. truich .ix. &ndot;druid. ix. &ndot;Doelgusa .ix. Saergusa .ix.<!--</lb>--> nIllaind. x&#x026B;. arad .x&#x026B;. brolach .xl. brugad. c&eacute;t mulach .c. &ndot;d&iacute;bergach<!--</lb>--> .c. sen. c. n-&oacute;c .c. midais .xx. r&iacute;g. xx. colomon. xx. eirred &aacute;n. xx.<!--</lb>--> <mls unit="MS folio" n="123a 55"/> olloman. im ocht c&eacute;t lam &ndot;dess do imdibe. Im ocht c&eacute;t s&uacute;le cl&eacute;<!--</lb>--> do chaechad co fargaib in sluagsin uile fo anim dia &eacute;is issind <lb n="14255"/> oenl&oacute;., &#x2016;<!--</lb>--></p>

<p><mls unit="MS folio" n="123b"/> Apraind a L&eacute;ith M<ex>acha</ex> nabu d&iacute;b n-echaib commaib fo<!--</lb>--> charp<ex>ut</ex> ba sodursan. napu d&iacute;b lamaib coml&aacute;naib comarnic.<!--</lb>--> Apraind na<ex>ch</ex> Conchob<ex>or</ex> claidebruad comairlestar. Dursan<!--</lb>--> <mls unit="MS folio" n="123b 5"/> nad Eirrge Echbel arnic. Apraind nach Sencha Sobe&oacute;il <lb n="14260"/> rosiacht. D<ex>ursan</ex> na<ex>ch</ex> Fiacha Foltlebor fallnastar. A<ex>praind</ex><!--</lb>--> nach Eogan Alaind acillestar. D<ex>ursan</ex> na<ex>ch</ex> Fergna m<ex>ac</ex><!--</lb>--> Findchaeme forcmastar. A<ex>praind</ex> nach Fergus m<ex>ac</ex> Lete<!--</lb>--> luid. A<ex>praind</ex> na<ex>ch</ex> Feidlimid Faeborderg forca<ex>ch</ex>ai. D<ex>ursan</ex><!--</lb>--> na<ex>ch</ex> Munremur morglonnach miadaigestar. A<ex>praind</ex> na<ex>ch</ex> <lb n="14265"/> <mls unit="MS folio" n="123b 10"/> Amargin urdairc aigestar. D<ex>ursan</ex> na<ex>ch</ex> Rochad Rigderg<!--</lb>--> rathaigestar. A<ex>praind</ex> nad b&aacute;tar errid Ul<ex>ad</ex> uile ocond airm<!--</lb>--> i torchair i n-&eacute;comlund. ar no reidedsom a chorp &ndot;gel chrechtach<!--</lb>--> ar Ultu fri iltuathu ilairbriu. D<ex>ursan</ex> na<ex>ch</ex> Conall C<ex>ernach</ex><!--</lb>--> <mls unit="MS folio" n="123b 15"/> cobrastar. Ap<ex>raind</ex> nach Celtchair comrach cuala. D<ex>ursan</ex> <lb n="14270"/> na<ex>ch</ex> Loegaire Buadach b&aacute;igestar. A<ex>praind</ex> na<ex>ch</ex> Fergus<!--</lb>--> m<ex>ac</ex> Rossa roacht. D<ex>ursan</ex> nad batar Ul<ex>aid</ex> uile imme airm<!--</lb>--> i torchair.<!--</lb>--></p>

<p>Domchommart a chuma. cotomessart a d&iacute;th. Rom dithracht<!--</lb>--> a d&iacute;bad. Am d&iacute;main dia &eacute;is. ar nimda ni iarum. Ba meite <lb n="14275"/> ca<ex>ch</ex> cride rod car <ex>con</ex> bossad. ba meite ce<ex>ch</ex> cluas rodcuala<!--</lb>--> <mls unit="MS folio" n="123b 20"/> co br&aacute;th noco ndermanad. B<ex>a meite</ex> ca<ex>ch</ex> d&eacute;r no c&iacute;the co<!--</lb>--> br&aacute;th ba dia bithcho&iacute;niud. Ba meite ca<ex>ch</ex> rosc at<ex>con</ex>nairc<!--</lb>--> no ciad frassaib fola. ar is dered fo dubai in domain dia eis.<!--</lb>--> Ar niba fri ceili aile iarum nom accfither. Nibat g&aacute;rechtaig <lb n="14280"/> <mls unit="MS folio" n="123b 25"/> aiscedaig fergn&uacute;si ocom urnaidm. Ar n&iacute; fugeb c&eacute;li fri Coin<!--</lb>--> Cul<ex>aind</ex> cosmail.<!--</lb>--></p>

<p>Bit bronaig delguin dilactai. nibat failti buad bantrochta<!--</lb>--> dobeba Mis Gegra gnimrathu. rogn&iacute; mord&iacute;gail. Adrulaid lumg<!--</lb>--> mossad morgnima i mMaig &Sdot;iamrach ro sephaid Conall iar Corm<ex>a</ex>c <lb n="14285"/> <mls unit="MS folio" n="123b 30"/> comaitecht conderaig a daltae digairsi m&oacute;r gein ro gabai ar<!--</lb>--> galaib oen&fdot;ir iar &mdot;breth ban side siachtum m&oacute;rthochmarc<!--</lb>--></p>


<pb n="457"/>

<p><mls unit="MS folio" n="123b"/> m<ex>ei</ex>c dea Dechtiri derbad Soaltim. sainaltram Loga imr&eacute;ith<!--</lb>--> fri mind rotha Scaithchi scelaige. eochraide inna nUlad<!--</lb>--> <mls unit="MS folio" n="123b 35"/> n-&uacute;ath oa n-athaib. teist ro &fdot;ersur r&eacute; siabordai ina urchomair <lb n="14290"/> s&eacute; mbl<ex>iadna</ex> d&eacute;c dlegma scur. saetha sechmai morthuatha.<!--</lb>--> alch&eacute;l cach uand dia &eacute;ol immaciam. immaca&iacute;nem.<!--</lb>--> immanairchisem. Is truag in bith at&aacute;thar and. ar ni<!--</lb>--> chomraicfeni nach laithiu aile. a Leith., A Leith. Finit.<!--</lb>--> Am<ex>en</ex>. <lb n="14295"/></p>
</div1>


<pb n="458"/>
<div1 n="14">
<head><mls unit="MS folio" n="123b 40"/>.Aided Choncob<ex>uir</ex>.<!--</lb>--></head>

<p>BAi mesca m&oacute;r for Ulto fecht n-and i nEmain M<ex>acha</ex>. Docuridar<!--</lb>--> d&imacr; immarbaga m&oacute;ra &ampersir; comrama et<ex>ur</ex>ro .i. et<ex>er</ex> Chonall &ampersir; Coin<!--</lb>--> Cul<ex>aind</ex> &ampersir; Loegaire. Tucaid damsa ar Conall inchind Mess<!--</lb>--> <mls unit="MS folio" n="123b 45"/> G<ex>egra</ex> coro acilliur &oacute;cu na co<ex>m</ex>ram. Ba bes d'Ultaib ind inbaidsin <lb n="14300"/> ca<ex>ch</ex> curaid no marbdais ar galaib oen&fdot;ir no gatta a n-inchind assa<!--</lb>--> cendaib &ampersir; commesctha ael airthib co ndenad liathroite cruade d&iacute;b.<!--</lb>--> &ampersir; in tan no b&iacute;tis i n-immarbaig no chomramaib dob<ex>er</ex>tis d&oacute;ib co<!--</lb>--> <mls unit="MS folio" n="123b 50"/> mb&iacute;tis inna lamaib.<!--</lb>--></p>

<p>Maith a Chonch<ex>obuir</ex> ar Conall naco ndernat oic na comram <lb n="14305"/> echt fon innasa ar gala<ex>m</ex> o&iacute;n&fdot;ir. nidat tual&ndot;gi comram frimsa.<!--</lb>--> Is fir &oacute;n ar Conch<ex>obor</ex>. Doratad iarum forsin forud fora mbid<!--</lb>--> do g<ex>r&eacute;</ex>s ind inchind. Luid c&aacute;ch a lethi arnabarach dia cluchiu.<!--</lb>--> <mls unit="MS folio" n="123b 55"/> Dolluid da<ex>no</ex> Cet m<ex>ac</ex> Matach do chuairt ect<ex>r</ex>a la Ulto. Beist<!--</lb>--> <mls unit="MS folio" n="124a"/> ass andsam ro bo&iacute; i nHer<ex>ind</ex> &#x2016; in Cet. Is <ex>ed</ex> dolluids<ex>id</ex>e dar <lb n="14310"/> faidchi na hEmna &ampersir; tri laechcind leis do Ultaib. In tan b&aacute;tar na<!--</lb>--> &oacute;nmite co cluchiu do inchind Mes G<ex>egra</ex>. Iss <ex>ed</ex> atbert ind &oacute;nmit<!--</lb>--> <mls unit="MS folio" n="124a 5"/> fri araile. Rocluinedar Cet an&iacute;sin. Ethaidside in n-inchind a<!--</lb>--> ll&aacute;im indala n-a&iacute; &ampersir; berid leis. O rofit<ex>ir</ex> Cet ro bo&iacute; i tar&ndot;gere do<!--</lb>--> Mess G<ex>egra</ex> a digail iarna &eacute;caib. Ca<ex>ch</ex> cath &ampersir; ca<ex>ch</ex> irga no b&iacute;d <lb n="14315"/> do Chon<ex>nachtaib</ex> fri Ulto dobered Cet in n-inchind inna chriss d&uacute;s<!--</lb>--> in tetarthad &eacute;cht n-amra d'Ultaib do marb<ex>ad</ex> di.<!--</lb>--></p>

<p><mls unit="MS folio" n="124a 10"/> Fecht and d&imacr; dolluidseom int&iacute; Cet sair co tuc t&aacute;nai &mdot;b&oacute; a Feraib<!--</lb>--> Ross. Donarraid i n-iarmoracht Ul<ex>aid</ex> ina diaid. Doriachtatar<!--</lb>--> da<ex>no</ex> Connachtai dond leith aile dia thessaircainseom. Fechair <lb n="14320"/> cath et<ex>ur</ex>ro. Dolluid Conch<ex>obor</ex> f&eacute;in issin cath. Conid and sin<!--</lb>--> <mls unit="MS folio" n="124a 15"/> gadatar mna Connacht do Chonch<ex>obur</ex> tuidecht for leith do descin<!--</lb>--> a delba d&oacute;ib. Fo b&iacute;th ni rabi for tal<ex>main</ex> delb duini am<ex>al</ex> deilb<!--</lb>--></p>


<pb n="459"/>

<p><mls unit="MS folio" n="124a"/> Conch<ex>obuir</ex> .i. et<ex>er</ex> chruth &ampersir; deilb &ampersir; dechelt. et<ex>er</ex> m&eacute;t &ampersir; c&oacute;re &ampersir;<!--</lb>--> cutr<ex>u</ex>mmae. et<ex>er</ex> rosc &ampersir; &fdot;olt &ampersir; gile. et<ex>er</ex> ga&iacute;s. &ampersir; alaig. &ampersir; erlabra. et<ex>er</ex> <lb n="14325"/> <mls unit="MS folio" n="124a 20"/> erriud &ampersir; &aacute;ne &ampersir; &eacute;cosc. et<ex>er</ex> arm &ampersir; immad &ampersir; orddan. et<ex>er</ex> gnais &ampersir; gaisced<!--</lb>--> &ampersir; chen<ex>e</ex>l. Nirbo lochtach tr&aacute; int&iacute; Conch<ex>obor</ex>. A comairli i&mmacr; in<!--</lb>--> Cheit ro gabsat na mn&aacute; ailgis do Chonch<ex>obur</ex>. Luid iar<ex>u</ex>m for<!--</lb>--> leth a o&iacute;nur dia descin dona mnaib.<!--</lb>--></p>

<p>Dolluid Cet i&mmacr; co mbu&iacute; et<ex>er</ex> na mn&aacute; i mmed&oacute;n. Nos indlethar <lb n="13430"/> <mls unit="MS folio" n="124a 25"/> Cet inchind Mes G<ex>egra</ex> isin t&aacute;baill. &ampersir; nos teilc conid tarla i mmullach<!--</lb>--> Conch<ex>obuir</ex> co mb&aacute;tar a da trian inna chind &ampersir; co tor<ex>chair</ex>seom isa<!--</lb>--> cend co tarla fri l&aacute;r. Focherddat Ul<ex>aid</ex> chuci conid rucsat o<!--</lb>--> Chet. For br&uacute; &Aacute;tha Daire da B&aacute;eth is and doroch<ex>air</ex> Conch<ex>obor</ex>.<!--</lb>--> <mls unit="MS folio" n="124a 30"/> At&aacute; a lige and baile i tor<ex>chair</ex> &ampersir; corthe fria chend &ampersir; corthe fria <lb n="14335"/> chossa.<!--</lb>--></p>

<p>Maidid tra for Connachta co Sciaid Aird na Con. Dobertar<!--</lb>--> Ul<ex>aid</ex> sair doridisi co &Aacute;th Daire Da B&aacute;eth. Mo brithse ass ar<!--</lb>--> Conch<ex>obor</ex>. Dob<ex>&eacute;r</ex> r&iacute;ge nUl<ex>ad</ex> do neoch nom b&eacute;ra <ex>con</ex>nici mo<!--</lb>--> thech. Not bersa ar Cend B<ex>er</ex>raide ar a gilla fad&eacute;in. Dob<ex>eir</ex>side <lb n="14340"/> <mls unit="MS folio" n="124a 35"/> lomain imme &ampersir; no mbeir fora muin co Arddachad Slebe F&uacute;ait.<!--</lb>--> Maidid a chride isin gillu. Conid desin at&aacute; r&iacute;ge Cind B<ex>er</ex>raide<!--</lb>--> for Ul<ex>taib</ex> .i. in r&iacute; fora muin leth ind la&iacute;. Con&oacute;cbad tr&aacute; in debaid<!--</lb>--> on tr&aacute;th co araile dar &eacute;is in r&iacute;g. Co raimid for Ulto iar sin.<!--</lb>--></p>

<p><mls unit="MS folio" n="124a 40"/> Doberar tra a liaig co Conch<ex>obor</ex> .i. Fingen. Iss es<ex>id</ex>e no &fdot;innad <lb n="14345"/> don diaid no theiged don tig. in l&iacute;n no b&iacute;d i &ndot;galur sin tig. &ampersir; ce<ex>ch</ex><!--</lb>--> galar no b&iacute;d and. Maith or Fingen dia taltar in chloch asdo chind<!--</lb>--> <mls unit="MS folio" n="124a 45"/> biat marb fo chet&oacute;ir. Mani tucthar ass i&mmacr; not &iacute;cfaind. &ampersir; bid athis<!--</lb>--> duit. Is asso d&uacute;n ar Ul<ex>aid</ex> ind athis old&aacute;s a &eacute;csom.<!--</lb>--></p>

<p>Ro iccad iar<ex>u</ex>m a chend &ampersir; ro fuaged co sn&aacute;th &oacute;ir ar ba cumma <lb n="14350"/> dath fuilt <ex>Con</ex>ch<ex>obuir</ex> &ampersir; dath inn &oacute;ir. &ampersir; asbert in liaig fri Conch<ex>obor</ex><!--</lb>--> co mbeth i fomtin .i. arna t&iacute;sad a &fdot;erg d&oacute; &ampersir; na digsed for ech &ampersir; na<!--</lb>--> <mls unit="MS folio" n="124a 50"/> etraiged mnai co anfeta &ampersir; na rethed.<!--</lb>--></p>

<p>Ro bo&iacute; da<ex>no</ex> isin chuntabairtsin c&eacute;in robo beo .i. uii. &mdot;bl<ex>iadna</ex><!--</lb>--> &ampersir; nirbo e&ndot;gnamaid acht a airisium inna &sdot;uidi namma .i. naco cuala <lb n="14355"/> Cr<ex>ist</ex> do chrochad do Iudaidib. Tanic and<ex>sid</ex>e crith m&oacute;r forsna<!--</lb>--> d&uacute;li &ampersir; ro chrithnaig nem &ampersir; tal<ex>am</ex> la m&eacute;t in gn&iacute;ma dar&oacute;nad and<!--</lb>--> <mls unit="MS folio" n="124b"/> .i. &Iacute;su Cr<ex>ist</ex> m<ex>a</ex>c D&eacute; b&iacute; do chrochad. &#x2016; cen chinaid. Craet so ar<!--</lb>--> Conch<ex>obor</ex> fria druid. Cia olc m&oacute;r dognith<ex>er</ex> isind lathiusa indiu.<!--</lb>--> Is f&iacute;r on &eacute;m ar in dru&iacute;. Is m&oacute;r in gn&iacute;msin ar Conch<ex>obor</ex>. In <lb n="14360"/> fersin da<ex>no</ex> ar in dru&iacute; i n-oenaidchi ro gein &ampersir; rogenisiu .i. in .uiii.<!--</lb>--> k&#x026B; en<ex>air</ex> cencop inund bli<ex>adain</ex>.<!--</lb>--></p>

<p><mls unit="MS folio" n="124b 5"/> Is and sin ro chreiti Conch<ex>obor</ex>. &ampersir; iss &eacute;sin indara fer ro chreti<!--</lb>--></p>


<pb n="460"/>

<p><mls unit="MS folio" n="124b"/> do Dia i nHer<ex>ind</ex> ria tiachtain creitmi &eacute; .i. Morand in fer aile.<!--</lb>--> Maith tra ar Conch<ex>obor</ex>. <lb n="14365"/></p>

<p>.R. Ba hapraind na d&aacute;il cu ardr&iacute;g. nar nagg atumbeoir<!--</lb>--> i rricht chruadchurad cichtis cichtis mo beoil <ex>con</ex>cichlais<!--</lb>--> <mls unit="MS folio" n="124b 10"/> cr&uacute;as m&oacute;r miled. maidm nitha m&uacute;aid nim&sdot;l&oacute;ig serbairlech.<!--</lb>--> sordnifed soerchobair la Cr<ex>ist</ex> co&ndot;genaind. gair b&aacute;eth barul&eacute;im<!--</lb>--> for leth ain lan Chomded lansc&eacute;l c&eacute; chointir crochad r&iacute;g <lb n="14370"/> ba moo coirp a r&iacute; ardrach adamrai. tumcichthe in gn&iacute;m<!--</lb>--> i tinol tairisem tre&oacute;in uasal i Coimded coimthecht co&ndot;gnam<!--</lb>--> <mls unit="MS folio" n="124b 15"/> ca&iacute;n b&eacute; la Dia dilgadach dia chobair. ca&iacute;n forlund f&oacute;b<ex>er</ex>aind.<!--</lb>--> ca&iacute;n comlund crothfind Cr<ex>ist</ex> ar nemthuir. nipu sc&iacute;th ce<!--</lb>--> ch&eacute;ssait&iacute;s coirp chriad. ciarbo ar Cr<ex>ist</ex> c&aacute;id cumachtach cia <lb n="14375"/> d&uacute; d&uacute;n nad rochem r&aacute;d d&uacute;r derchointe ru n-ortar inarmen<!--</lb>--> <mls unit="MS folio" n="124b 20"/> mona miad nad r&iacute;g roachtmar ron cr&aacute;idi crochad Cr<ex>ist</ex> ma<!--</lb>--> chot&oacute;cbaimmis ba hassu nad bemmis iar n-ardrach ecomnart<!--</lb>--> uasal r&iacute; ro c&eacute;s croich cruaid ar doine digmaig dia r&aacute;ith<!--</lb>--> ragaindse b&aacute;s achtu flaith for leccaind fochil n-&eacute;ca nabu n&iacute; <lb n="14380"/> nemthuir necht remiteised do choimrid mo chride cl&uacute;as in<!--</lb>--> <mls unit="MS folio" n="124b 25"/> ardrach &ndot;guba armu Dia indscib nad r&iacute;g roacht co f&iacute;r fortacht<!--</lb>--> fritumth&aacute; br&oacute;n b&aacute;is conatbiur ar omun dom dul druib. cen<!--</lb>--> Dulemain digail.<!--</lb>--></p>

<p>Is and doringni Conch<ex>obor</ex> in rethoricse diaro innis Bachrach <lb n="14385"/> dru&iacute; de Lagnib do Chonch<ex>obur</ex> Cr<ex>ist</ex> do chrochad. Diara iarfaig<!--</lb>--> <mls unit="MS folio" n="124b 30"/> Conch<ex>obor</ex> ciata airde i&ndot;gantacha so. &ampersir;c. &#x026B; da<ex>no</ex> combad &eacute; Altus<!--</lb>--> in consul dodechaid o Ochtauin do chungid in chisa co Gaedelaib<!--</lb>--> no innised do Chonch<ex>obur</ex> Cr<ex>idt</ex> do chrochad.,<!--</lb>--></p>
</div1>

<pb n="461"/>
<div1 n="15">
<head><mls unit="MS folio" n="124b"/>Aided Meidbe.<lb n="14390"/></head>

<p><mls unit="MS folio" n="124b 35"/> CID dia t&aacute; aided Meidbe ingine Echdach Feidlig a Tem<ex>raig</ex>.<!--</lb>--> Tr&iacute; m<ex>ei</ex>c &Fdot;ind .i. Conall Anglonnach &ampersir; Eoch<ex>aid</ex> Find &ampersir; Eoch<ex>aid</ex><!--</lb>--> Feidl<ex>ech</ex>. Tri m<ex>ei</ex>c da<ex>no</ex> la Eoch<ex>aid</ex> Feidl<ex>ech</ex> &ampersir; tri ingena.<!--</lb>--> Na tri m<ex>ei</ex>c. Bres &ampersir; N&aacute;r &ampersir; Lothur .i. na Tr&iacute; Find Emna. Na<!--</lb>--> tri ingena .i. Eithni Uathach &ampersir; Medb Crua<ex>chan</ex> &ampersir; Clothro Crua<ex>chan</ex> <lb n="14395"/> dia n-ebrad.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l>Teora ingena Ech<ex>dach</ex> Feidl<ex>ig</ex></l>
<l>fuaim iar fochlu.<!--</lb>--></l>
<l>Eithni Uathach. Medb Chruachan</l>
<l>&ampersir; Clothru.<!--</lb>--></l></lg></body></text></p>
<mls unit="MS folio" n="124b 40"/> 
 
<p>In Chlothru da<ex>no</ex> is s&iacute; banr&iacute;gan i Cruachain riasiu no gabad<!--</lb>--> Medb flathius ar ecin &oacute;n o Ech<ex>daig</ex>. Batar tri m<ex>ei</ex>c Ech<ex>dach</ex> oc <lb n="14400"/> triall r&iacute;ge do gait ara n-athair. Dolluid Clothru dia tairmesc &ampersir;<!--</lb>--> <mls unit="MS folio" n="124b 45"/> dia codnugud. Araisom da<ex>no</ex> dofocrait cath for Eoch<ex>aid</ex>. Dolluid<!--</lb>--> Clothro ara cind. In do &sdot;&aacute;rgud far n-athar duib ar si. Is anf&iacute;r<!--</lb>--> m&oacute;r cia dognether. Is ecen tra ar ind oic. In facbaid iartaigi<!--</lb>--> et<ex>ir</ex> ar in ben. N&iacute; morithir or ind oic. Is doich tuittim d&uacute;ib <lb n="14405"/> <mls unit="MS folio" n="124b 50"/> trianafar n-anf&iacute;r. Ta&iacute;t chucumsa ar si or is inbaid comperta<!--</lb>--> dam. d&uacute;s in faicfid iartaige lim. Dognither on. Luid ca<ex>ch</ex> fer<!--</lb>--> ar n-&uacute;air d&iacute;b cucci. co mba&iacute; maith de .i. Lug<ex>aid</ex> Riab &ndot;Derg m<ex>a</ex>c<!--</lb>--> na Tri Find Emna. Na ta&iacute;t a fectsa ar sisi i n-agid f<ex>or</ex> n-athar.<!--</lb>--> Is l&oacute;r d'anf&iacute;r d&uacute;ib comrac riafar siair cenco tisaid do chath ria- <lb n="14410"/> <mls unit="MS folio" n="125a"/> far n-athair. Iss <ex>ed</ex> tra sin ro thairmisc &#x2016; iat de choscur in chatha.<!--</lb>--> Is and d&imacr; domeled Clothru dligeda Connacht i n-Inis Clothrand<!--</lb>--> for Loch R&iacute;. Asberatsum tra is Medb ros marbsi. &ampersir; is triana<!--</lb>--> ta&iacute;b tucsat na claidib in Furbaide m<ex>a</ex>c Conch<ex>obuir</ex>. Gabais ind&iacute;<!--</lb>--> <mls unit="MS folio" n="125a 5"/> Medb rige Connacht iar tain &ampersir; dobert Ail<ex>il</ex>l i flaithemnas chuci. <lb n="14415"/> &ampersir; is i nInis Clothrand domeledsi dligeda Connacht. &ampersir; ba geis<!--</lb>--> dissi cena fothrucud ce<ex>cha</ex> maitni assin tiprait ar dorus na indsi.<!--</lb>--></p>


<pb n="462"/>

<p><mls unit="MS folio" n="125a"/> Luid d&imacr; Furbaide fecht and co hInis Clothrand. &ampersir; saidid cualli<!--</lb>--> forsind licc forsa ndenad Medb a fothruc<ex>ud</ex>. &ampersir; ro che&ndot;gail<!--</lb>--> <mls unit="MS folio" n="125a 10"/> suanemain do chind in chualli .i. cualli ba comard ri Meidb. <lb n="14420"/> &ampersir; s&iacute;nid in suanemain dar Loch R&iacute; s&iacute;ar &ampersir; sair. Berid leis in suanemain<!--</lb>--> dia thaig. In tan iar<ex>u</ex>m no bitis m<ex>a</ex>crad Ul<ex>ad</ex> oca cluchi ba &eacute;<!--</lb>--> cluchi Furbaide no &sdot;&iacute;ned a &sdot;uanemain et<ex>er</ex> da chualli &ampersir; no bid oc<!--</lb>--> <mls unit="MS folio" n="125a 15"/> d&iacute;burgud et<ex>ur</ex>ro &ampersir; ni anad co n-ermaised in ubull no b&iacute;d for<!--</lb>--> cind in chualli. <lb n="14425"/></p>

<p>Fecht and di bo&iacute; d&aacute;l m&oacute;r et<ex>er</ex> Connachtu &ampersir; Ultu im Loch R&iacute;<!--</lb>--> an&iacute;ar &ampersir; anair. &ampersir; dorala Medb oca fothruc<ex>ud</ex> matain moch assin<!--</lb>--> tiprait osin loch cetna. Is alaind in delb &uacute;t or c&aacute;ch. Cia sin ar<!--</lb>--> Fur<ex>baide</ex>. Si&uacute;r do m&aacute;thar or c&aacute;ch. Bo&iacute;seom oc ithi blogi do<!--</lb>--> <mls unit="MS folio" n="125a 20"/> thanaig. Niro ans<ex>o</ex>m d&imacr; ri cungid clochi. Dobeir in &mdot;bloig <lb n="14430"/> isin tabaill. Oro bo&iacute; a hetan Meidbi friu. dosleici in &mdot;bloig conid<!--</lb>--> n-ecmai&ndot;g ina mullach. Conid romarb dond &oacute;enurchur i ndigail<!--</lb>--> a mathar.<!--</lb>--></p>

<p>Aided Meidbe in sin.,<!--</lb>--></p>
</div1>

<pb n="463"/>
<div1 n="16">
<head><sup resp="BBE">Aided Derb &Fdot;orgaill</sup></head>

<p><mls unit="MS folio" n="125a 25"/>Derb &Fdot;orgaill ingen r&iacute;g Lochlainne ro charastar Coin Cul<ex>aind</ex> <lb n="14435"/> ara urscelaib. Dolluid anair i rricht da g&eacute;ise &ampersir; a hinailt co<!--</lb>--> mb&aacute;tar for Loch Cuan &ampersir; rond &oacute;ir et<ex>ur</ex>ru. Am<ex>al</ex> ro bo&iacute; da<ex>no</ex><!--</lb>--> Cu Ch<ex>ulaind</ex> &ampersir; Lug<ex>aid</ex> a dalta .i. m<ex>a</ex>c na Tri Find Emna laa and<!--</lb>--> la to&iacute;b ind locha co n-accatar na heonu. Dibairg na heonu or<!--</lb>--> <mls unit="MS folio" n="125a 30"/> Lug<ex>aid</ex>. Dolleici Cu C<ex>hulaind</ex> cloich forru co ndechaid et<ex>er</ex>a hasna <lb n="14440"/> co mbo&iacute; ina broind. B&aacute;tar da deilb duine issin tracht fo chet&oacute;ir.<!--</lb>--> olc rob&aacute; rim ar ind ingen. &ampersir; is t&uacute; doroacht. Is f&iacute;r ar Cu <ex>Chulaind</ex>.<!--</lb>--> Ro &sdot;&uacute;gi iarum a t&oacute;eb na ingine in cloich co mbu&iacute; ina beolu cosin<!--</lb>--> loim chr&oacute; robo&iacute; impe. Is dot insaigid t&aacute;nacsa tra or si. Nath&oacute;<!--</lb>--> <mls unit="MS folio" n="125a 35"/> a ingen or se. In t&oacute;eb ro &sdot;&uacute;giusa or se n&iacute; chomraiciubsa riss. <lb n="14445"/> Domb&eacute;raso da<ex>no</ex> do neoch bas maith let. Is maith limsa &eacute;m or<!--</lb>--> se dul duitsiu cosin m<ex>a</ex>c as so&iacute;riu fil i nHer<ex>ind</ex> .i. Lug<ex>aid</ex> Riab<!--</lb>--> &ndot;D<ex>er</ex>g. Maith lim or si acht conot accur do g<ex>r&eacute;</ex>s. Luid iarum<!--</lb>--> co Lug<ex>aid</ex> co rruc claind d&oacute;.<!--</lb>--></p>

<p><mls unit="MS folio" n="125a 40"/> Laa and d&imacr; i nderiud gemrid. snecta m&oacute;r and. Doniat na <lb n="14450"/> fir corthe m&oacute;r don t&sdot;nechtu. Lotar na mna forna corthe. Ba<!--</lb>--> he a tuscurnud. Tabram ar m&uacute;n isin coirthe d&uacute;s cia as sia ragas<!--</lb>--> ind. In ben o r&iacute;a triit is &iacute; as &fdot;err co&ndot;gaib &uacute;an. Ni roacht d&imacr;<!--</lb>--> uadib. Co&ndot;gairther D<ex>erb</ex> Forgaill uadib. Nirbo &aacute;ill lea or nirbo<!--</lb>--> <mls unit="MS folio" n="125a 45"/> baeth. T&eacute;it arai forsin corthe ro selaig uade co tala<ex>m</ex>. Dia <lb n="14455"/> fessatar tr&aacute; ind &fdot;ir so n&iacute;con gr&aacute;daigfider i fail na o&iacute;nmn&aacute;. Gatair<!--</lb>--> a s&uacute;ile assa cind. &ampersir; a sr&oacute;na &ampersir; a da n-&oacute; &ampersir; a trilis. Niba soaccobraite<!--</lb>--> &oacute;n. Dognither a pianad amlaidsin. &ampersir; berair iar tain da tig. Batar<!--</lb>--> <mls unit="MS folio" n="125a 50"/> ind &fdot;ir is tilaig i nd&aacute;il os Emain. Is i&ndot;gnad lem a Lug<ex>aid</ex> ar Cu<!--</lb>--> <ex>Chulaind</ex> snechta for taig Derb Forgaill. Is i n-&eacute;caib at&aacute;si d&imacr; ar <lb n="14460"/> Lug<ex>aid</ex>. Tiagait for comluath dochum in taige. Am<ex>al</ex> rochualasi<!--</lb>--> &oacute;n dunaid a tech furri. Oslaic ar Cu <ex>Chulaind</ex>. Ca&iacute;n bl&aacute;th <ex>f</ex>orro<!--</lb>--> scarsam or si. Is and asbert.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l><mls unit="MS folio" n="125a 55"/> Celebraid Cu <ex>Chulaind</ex> dam<!--</lb>--></l>
<l>domriacht om &iacute;athaib i&uacute;il <lb n="14465"/></l>
<l>&ampersir; Lug<ex>aid</ex> luth la b<ex>eir</ex>t.<!--</lb>--> </l>
<l>dia tartus seirc n&aacute;chim chi&uacute;il. &#x2016;<!--</lb>--></l></lg>

<pb n="464"/>

<lg n="2">
<l><mls unit="MS folio" n="125b"/> Isim &eacute;icen dul i c&iacute;an.<!--</lb>--></l>
<l>n&iacute; fo fechta nodam &eacute;t<!--</lb>--></l>
<l>scarad friu bid d&aacute;l &eacute;icne <lb n="14470"/></l>
<l>menim thistais &eacute;cne &eacute;c.<!--</lb>--></l></lg>

<lg n="3">
<l>La Coin Cul<ex>aind</ex> la Lug<ex>aid</ex>.<!--</lb>--></l>
<l>risnarom &uacute;ath na h&oacute;mon.<!--</lb>--></l>
<l>m<ex>en</ex>bad athb<ex>er</ex> co n-athlech<!--</lb>--></l>
<l>nibad aithrech ar comol. <lb n="14475"/></l></lg>

<lg n="4">
<l>Comul scartha fri Riab &ndot;Derg.<!--</lb>--></l>
<l><mls unit="MS folio" n="125b 5"/> is delg i cridi cr&oacute; cnis.<!--</lb>--></l>
<l>Cu <ex>Chulaind</ex> do bith i n-i&ndot;gnais.<!--</lb>--></l>
<l>dirsan m<ex>en</ex>bad leca lis.<!--</lb>--></l></lg>

<lg n="5">
<l>Menbad leca lis Lug<ex>dach</ex> <lb n="14480"/></l>
<l>lasa r<ex>u</ex>mnad ca<ex>ch</ex> &ndot;derba;<!--</lb>--></l>
<l>ba romoch ar n-&eacute;tarba<!--</lb>--></l>
<l>fri m<ex>a</ex>c na Tri Find Emna.<!--</lb>--></l></lg>

<lg n="6">
<l>Nach accimse Coin Cul<ex>aind</ex><!--</lb>--></l>
<l>domringne d&eacute;rach dubach. <lb n="14485"/></l>
<l>d&iacute;thre mo th&uacute;ath truag amar<!--</lb>--></l>
<l>&ampersir; scarad fri Lug<ex>aid</ex>.<!--</lb>--></l></lg>

<lg n="7">
<l><mls unit="MS folio" n="125b 10"/> Nim rumartsa mo &fdot;ianchara.<!--</lb>--></l>
<l>Cu <ex>Chu</ex>l<ex>aind</ex> caraid buafad.<!--</lb>--></l>
<l>ba&iacute; dam ceile soer subaid <lb n="14490"/></l>
<l>Lug<ex>aid</ex> m<ex>ac</ex> Clothrand Cruachan.<!--</lb>--></l></lg>

<lg n="8">
<l>Buaid gaile buaid clis ria c&aacute;ch<!--</lb>--></l>
<l>do Choin Cul<ex>aind</ex> cruth rod n-a&iacute;.<!--</lb>--></l>
<l>b<ex>uaid</ex> &ndot;gaiscid do Lug<ex>aid</ex> l&uacute;ath<!--</lb>--></l>
<l>b<ex>uaid</ex> mo chrotha sech ce<ex>ch</ex> mna&iacute;. <lb n="14495"/></l></lg>

<lg n="9">
<l>Ca<ex>ch</ex> buaid dimb&uacute;aid iar tain<!--</lb>--></l>
<l>cipia frisa ferthar tn&uacute;;<!--</lb>--></l>
<l>ca<ex>ch</ex> indbass bid indles n-&uacute;ag<!--</lb>--></l>
<l>c<ex>ach</ex> tr&eacute;n bid truag &#x026B; bid tr&uacute;.<!--</lb>--></l></lg>

<pb n="465"/>

<lg n="10">
<l><mls unit="MS folio" n="125b"/> Sirechtach d&aacute;l in bith c&eacute;. <lb n="14500"/></l>
<l><mls unit="MS folio" n="125b 15"/> ni s&eacute;t fris nem nech dogn&iacute;;<!--</lb>--></l>
<l>torbais d&aacute;l b&aacute;is sech ce<ex>ch</ex> &ndot;d&uacute;is<!--</lb>--></l>
<l>gn&uacute;is cha&iacute;n cid alaind a l&iacute;.<!--</lb>--></l></lg>

<lg n="11">
<l>Nimda genair cridi cr&uacute;aid<!--</lb>--></l>
<l>dob<ex>eir</ex> t&aacute;eb fri aileth&uacute;aith. <lb n="14505"/></l>
<l>ara mence &sdot;oas gn&eacute;<!--</lb>--></l>
<l>a gnuis ri &uacute;air &ndot;dochraite.<!--</lb>--></l></lg>

<lg n="12">
<l>In tan imreidmis Emain<!--</lb>--></l>
<l>a Temair n&iacute;rbo drochband.<!--</lb>--></l>
<l><mls unit="MS folio" n="125b 20"/> Cu <ex>Chulaind</ex> and ba subaid <lb n="14510"/></l>
<l>&ampersir; Lug<ex>aid</ex> m<ex>a</ex>c Clothrand.<!--</lb>--></l></lg>

<lg n="13">
<l>Cu <ex>Chulaind</ex> dam d'acallaim<!--</lb>--></l>
<l>co ngn&iacute;maib danaib Dubthaig.<!--</lb>--></l>
<l>iss <ex>ed</ex> ba sl&aacute;n lam chride<!--</lb>--></l>
<l>&ampersir; lige la Lug<ex>aid</ex>. <lb n="14515"/></l></lg>

<lg n="14">
<l>Ro scarsam friar n-amalla<!--</lb>--></l>
<l>oca mbimm&iacute;s fri ca<ex>ch</ex> sel<!--</lb>--></l>
<l>b&eacute;s no comairsem nach tai<!--</lb>--></l>
<l>ro delbad dam dul ar cel. C.<!--</lb>--></l></lg></body></text></p>
		
<p><mls unit="MS folio" n="125b 25"/> Iss <ex>ed</ex> atberatsom n&iacute; ba&iacute; a hanim intisi in tan tancatars<ex>o</ex>m <lb n="14520"/> is tech innund. Asberat da<ex>no</ex> ba marb Lug<ex>aid</ex> a chetoir oca descin .<!--</lb>--> Luid i&mmacr; Cu <ex>Chulaind</ex> isa tech cosna mn&aacute; co tarat a tech forthu<!--</lb>--> conna tudchid fer na ben i mbethaid assin tigsin .i. dona tri coicdaib<!--</lb>--> rigan. acht ros marb uile. Is and asbert Cu <ex>Chulaind</ex>.<!--</lb>--></p>

<p><text type="poem"> <body>
<lg type="quatrain" n="1">
<l><mls unit="MS folio" n="125b 30"/>Derb Forgaill bruinne gel b&aacute;n <lb n="14525"/></l>
<l>domriacht dar srotha s&aacute;l.<!--</lb>--></l>
<l>ba rath carat ro dam f&iacute;r.<!--</lb>--></l>
<l>ingen rig de Lochlaind l&aacute;n.<!--</lb>--></l></lg>

<lg n="2">
<l>Oro bo&iacute; et<ex>er</ex> da &fdot;ert.<!--</lb>--></l>
<l>dogn&iacute; mert mo chride cr&oacute;. <lb n="14530"/></l>
<l>gn&uacute;is Derb &Fdot;or<ex>gaill</ex> fo licce leirg.<!--</lb>--></l>
<l>Lug<ex>aid</ex> Riab &ndot;Derg dirsan d&oacute;.<!--</lb>--></l></lg>

<pb n="466"/>

<lg n="3">
<l><mls unit="MS folio" n="125b"/> Ba hallud m&oacute;r do Lug<ex>aid</ex><!--</lb>--></l>
<l>bo&iacute; fora chrannaib glee.<!--</lb>--></l>
<l><mls unit="MS folio" n="125b 35"/> co&iacute;ca cetguine cen d&aacute;il <lb n="14535"/></l>
<l>la hannud cach ree.<!--</lb>--></l></lg>

<lg n="4">
<l>Derb For<ex>gail</ex> cl&uacute; co n-&aacute;ne<!--</lb>--></l>
<l>co &ndot;genus &ampersir; &fdot;&eacute;le.<!--</lb>--></l>
<l>noco rala cor n-uabair<!--</lb>--></l>
<l>gnuis dar gualaind a ceile. <lb n="14540"/></l></lg>

<lg n="5">
<l>Tri coicait ban i nEmain<!--</lb>--></l>
<l>is me doruid a n-orgain;<!--</lb>--></l>
<l>cia fogelmais r&iacute;g na t&uacute;ath<!--</lb>--></l>
<l>ba luag d&oacute;ib Derb F<ex>orgaill</ex>.<!--</lb>--></l></lg></body></text></p>

<p><mls unit="MS folio" n="125b 40"/> D<ex>erb</ex> .i. D&eacute;r ingen Forgaill rig Loch<ex>lainne</ex>. Rolad a fert &ampersir; a <lb n="14545"/> llia la Coin Cul<ex>aind</ex>.<!--</lb>--></p>
</div1>

<pb n="467"/>
<div1 n="17">
<head><sup resp="BBE">Noenden Ulad &ampersir; Emuin Macha</sup></head>

<p>NOinden Ul<ex>ad</ex> cid dia t&aacute;. Ni <ex>handsa</ex>. Crunniuc m<ex>ac</ex> Agno<ex>main</ex><!--</lb>--> di Ultaib briuga cetach atacomnaic. Ba&iacute; i ndithrub &ampersir; i<!--</lb>--> rroilbib &ampersir; m<ex>ei</ex>c imda leis. Ba marb iarum a ben. Tan bu&iacute;<!--</lb>--> <mls unit="MS folio" n="125b 45"/> lathe and ina thig a o&iacute;nur. co n-accai in mnai chuce ina thech. <lb n="14550"/> Ba cuchtach leis innas na mn&aacute;. Fecaid in ben fo chet&oacute;ir. o dofessid<!--</lb>--> for ergnam do denam. am<ex>al</ex> bid is taig no beth riam. O thanic<!--</lb>--> co aithchi donairbir in munt<ex>ir</ex> cen athchomarc. Foaid la Crunniuc<!--</lb>--> <mls unit="MS folio" n="125b 50"/> isind aidchi. Ba&iacute; oca amser m&aacute;r iar sin &ampersir; ni bu&iacute; n&iacute; ba t<ex>er</ex>c d&oacute;ib<!--</lb>--> leesi di ca<ex>ch</ex> thorud et<ex>er</ex> biad &ampersir; etach &ampersir; indbass. Nib&aacute; cian iar sin <lb n="14555"/> ferthair oenach la Ul<ex>tu</ex>. No thegtis Ul<ex>aid</ex> dond oenuch. fiur mnai<!--</lb>--> m<ex>a</ex>c ingin. Farruma da<ex>no</ex> Crun<ex>niuc</ex> la cach dond oenuch. Etach<!--</lb>--> maith immi. bl&aacute;th maith fair. Is tacair duit tr&aacute; ol a ben friss ni<!--</lb>--> <mls unit="MS folio" n="126a"/> &fdot;orbara anf&oacute;t do r&aacute;d. Is decmai&ndot;g &oacute;n ol seseom. &#x2016; Curthir a<!--</lb>--> n-oenach. doberar carp<ex>at</ex> ind r&iacute;g forsin &mdot;blai deod la&iacute;. Dobert <lb n="14560"/> b&uacute;aid in carp<ex>at</ex> cona echaib. Asbert in sluag ni fuil n&iacute; as l&uacute;athiu<!--</lb>--> and&aacute;it na eichseo. Asbert Crunniuc is luathiu mo bensa ol seseom.<!--</lb>--> <mls unit="MS folio" n="126a 5"/> Airgaibthersom lasin r&iacute;g fo chet&oacute;ir. Adfiadar don mnai an&iacute;sin. Is<!--</lb>--> t<ex>ur</ex>baid &eacute;m damsa ol si dul dia &fdot;uaslucuds<ex>o</ex>m &ampersir; m&eacute; alacht. Cid<!--</lb>--> t<ex>ur</ex>baid ol in tectaire mairfithirsium meni risiu. <lb n="14565"/></p>

<p>Tolluidsi dond oenuch iarum. et ros gabat idain. Tomforidse<!--</lb>--> ol si risin sluag or is m<ex>athai</ex>r ruc c&aacute;ch uaib. Anaid frim coro<!--</lb>--> <mls unit="MS folio" n="126a 10"/> lamnar. Ro &fdot;&eacute;mid uadib. Maith tra ol si biaid olc bas m&oacute; de.<!--</lb>--> &ampersir; biaid for Ultaib uile re m&oacute;r. Cia th'ainmsiu ol in r&iacute;. Iss <ex>ed</ex> mo<!--</lb>--> ainmse ol si &ampersir; ainm mo gene bias arin oenuchsa co br&aacute;th. Macha <lb n="14570"/> ingen Sainrith m<ex>eic</ex> Imbaith m'ainmse ol si. Comluid iarum<!--</lb>--> <mls unit="MS folio" n="126a 15"/> frisin carp<ex>at</ex>. &ampersir; in tan roanic in carp<ex>at</ex> cend na blae ro sc&aacute;ich a<!--</lb>--> asaitsi ara chind. co mbert emun .i. m<ex>a</ex>c &ampersir; ingen. Is de at&aacute; Emuin<!--</lb>--> Machae in sin. Iactaidsi da<ex>n</ex>o lia hasait. nach duine rodach&uacute;ala<!--</lb>--> son foscerded i cess. c&oacute;ic laa &ampersir; cethri a&iacute;dche. Fir Ulad uili ro <lb n="14575"/> <mls unit="MS folio" n="126a 20"/> batar and dosniced uili do g<ex>r&eacute;</ex>s ind ellsin. fri saegul n&oacute;nbair o ca<ex>ch</ex><!--</lb>--> &fdot;iur ro ba&iacute; and. C&oacute;ic laa &ampersir; cethri aidche. &#x026B; coic aidche &ampersir; cethri<!--</lb>--> laa. iss <ex>ed</ex> sin ro bo&iacute; noinden Ulad. Nert mna si&uacute;il ba hed no b&iacute;d<!--</lb>--></p>

<pb n="468"/>

<p><mls unit="MS folio" n="126a"/> la ce<ex>ch</ex> fer di Ultaib fri saegul nonbair. isind noe<ex>n</ex>den. Treide<!--</lb>--> <mls unit="MS folio" n="126a 25"/> forna b&iacute;d noenden di Ultaib .i. m<ex>ei</ex>c &ampersir; mnaa Ul<ex>ad</ex> &ampersir; Cu <ex>Chulaind</ex>. <lb n="14580"/> Iss <ex>ed</ex> heret ro mba&iacute; for <ex>U</ex>ltaib. &oacute; amsir Cruincon m<ex>ei</ex>c A<ex>gn</ex>o<ex>main</ex><!--</lb>--> m<ex>eic</ex> Curir Ulad m<ex>eic</ex> &Fdot;iatach m<ex>eic</ex> Urmi. conice amsir &Fdot;orco<!--</lb>--> m<ex>eic</ex> Dall&aacute;in m<ex>eic</ex> Mainich m<ex>eic</ex> Lugdach. &ampersir;c. Curir Ulad is de<!--</lb>--> dogairt<ex>er</ex> Ulaid.<!--</lb>--></p>

<p>Is desin tra at&aacute; Noenden Ul<ex>ad</ex> &ampersir; Emuin M<ex>acha</ex>. <lb n="14585"/></p></div1>

<pb n="469"/>
<div1 n="18">
<head><sup resp="BBE">Tr&eacute;ide C&eacute;tna Labratar Iarna Genemain</sup></head>

<p><mls unit="MS folio" n="126a 30"/>CIA treide cetna labratar iarna genemain f&oacute; ch&eacute;toir &ampersir; cid ro<!--</lb>--> labraiset. Ni <ex>handsa</ex>. A&iacute; m<ex>a</ex>c Olloman m<ex>ei</ex>c Delb<ex>aith</ex>. &ampersir;<!--</lb>--> Morand m<ex>a</ex>c Cairp<ex>ri</ex> Chind Chaitt. &ampersir; Noinniu No&iacute;brethach. Is<!--</lb>--> de chetus ro labrastar &Oacute;e m<ex>a</ex>cc Oll<ex>oman</ex> .i. Ba&iacute; Fiachu m<ex>ac</ex> Delb<ex>aith</ex><!--</lb>--> <mls unit="MS folio" n="126a 35"/> r&iacute; Her<ex>end</ex> for cuairt r&iacute;g &ampersir; a br&aacute;thair na &fdot;arrad .i. Olloni m<ex>a</ex>c <lb n="14590"/> Delb<ex>aith</ex>. Batar laa and ic tomailt i nInis Tige i n-iarth<ex>ur</ex> Her<ex>end</ex><!--</lb>--> .i. in r&iacute; Fiachu &ampersir; a brathair Oll<ex>om</ex>. Leth in tige oc cechtar de. A<!--</lb>--> dru&iacute; da<ex>no</ex> for belaib ind r&iacute;g .i. Fiachach. Oro b&aacute;tar oc tomailt a<!--</lb>--> <mls unit="MS folio" n="126a 40"/> fessi dothaet athach gaethe m&oacute;re tarsin tech. conos tarat uile i socht<!--</lb>--> m&oacute;r ni&eacute;t in delma. Cid forcanas ind athach ar Fiach<ex>u</ex> frisin druid. <lb n="14595"/> Iss <ex>ed</ex> &fdot;orcanas or in dru&iacute; d&aacute;n i&ndot;gnad do thurcbail i nHer<ex>ind</ex>.<!--</lb>--> Cinnas dana &oacute;n or in r&iacute; &ampersir; cia &oacute; ngenend &ampersir; cia bale i &ndot;genfe. D&aacute;n<!--</lb>--> bas chomgr&aacute;id frit gr&aacute;dso ol in dru&iacute;. &ampersir; bid is tigseo genfes. &ampersir; bid<!--</lb>--> <mls unit="MS folio" n="126a 45"/> &oacute;n mnai &uacute;t tall do brath<ex>ar</ex> genfes. Is torrach &ampersir; b<ex>er</ex>aid m<ex>a</ex>c innossa<!--</lb>--> &ampersir; bid comgr&aacute;id fritso. &ampersir; ticfa gr&aacute;d amra aile and bas &uacute;asliu dia <lb n="14600"/> fogenat f<ex>or</ex> &ndot;gradasi .i. grad ecalsi.<!--</lb>--></p>

<p>Ra firad tr&aacute; uili an&iacute;sin Ra genair in m<ex>a</ex>c fo chet&oacute;ir. &ampersir; ro thr&iacute;all<!--</lb>--> <mls unit="MS folio" n="126a 50"/> in r&iacute; a marb<ex>ad</ex> in m<ex>ei</ex>c. coro thairmisc a ath<ex>air</ex> .i. Ollom ar n&iacute;ba<!--</lb>--> lia in r&iacute; is taig andas<ex>id</ex>e. In tan ro bas ocond imr&aacute;dud imme co<!--</lb>--> cualatar in m<ex>a</ex>c oca r&aacute;d. Domurcbaid s&uacute;as coro acilliur in r&iacute;g. <lb n="14605"/> Turggbair suas iar sin. N&iacute; damsa dot inchaib a &Fdot;iachrai or se.<!--</lb>--> Cid dober duit ar in r&iacute;. Ni <ex>handsa</ex>. Mo bruig mo l&aacute;namuin<!--</lb>--> <mls unit="MS folio" n="126b"/> lonchore co ndabaig dandlugae tucthar om r&iacute;g mucra escra. &#x2016; cuach<!--</lb>--> carp<ex>at</ex> calg tricha b&oacute; br&oacute; f&iacute;ann fiacho. O &Fdot;iachna damsa insin<!--</lb>--> uile ar in m<ex>a</ex>c. Dob<ex>er</ex>thar ar Fiachu. Cia ainm regas arin m<ex>a</ex>csa <lb n="14610"/> i fectsa. Tabar A&iacute; fair ar in drui. Conid assain tr&aacute; ro ainmniged<!--</lb>--> <mls unit="MS folio" n="126b 5"/> a&iacute; airchetail .i. &oacute; A&iacute; m<ex>a</ex>c Oll<ex>oman</ex>. &ampersir; is s&iacute; sein a&iacute; cetaerbairt A&iacute; m<ex>ac</ex><!--</lb>--> Oll<ex>oman</ex>.<!--</lb>--></p>

<p>Morand i&mmacr; m<ex>a</ex>c Carp<ex>ri</ex> Chind Chait. Is de ro labrastarsede .i.<!--</lb>--> ro marbtha lasin Corp<ex>re</ex> h&iacute;sin ce<ex>ch</ex> soerchland ro bo&iacute; i nHer<ex>ind</ex>. <lb n="14615"/> Ar ba di athechthuathaib Her<ex>end</ex> d&oacute;. &ampersir; ro gab rige &ndot;Her<ex>end</ex> ar<!--</lb>--> ecin. &ampersir; rap olc a rige ar n&iacute; b&iacute;d acht &oacute;engranne i cind ce<ex>ch</ex>a d&eacute;si.<!--</lb>--> <mls unit="MS folio" n="126b 10"/> &ampersir; oendircu a ccind na c<ex>us</ex>lindi. &ampersir; oendircu i mmulluch na darach<!--</lb>--> ina re. Ructha tri m<ex>ei</ex>c don Chairp<ex>riu</ex> h&iacute;sin. &ampersir; ro b&aacute;did&iacute;s leis fo<!--</lb>--></p>

<pb n="470"/>

<p><mls unit="MS folio" n="126b"/> chetoir. ar ba doig ropd&iacute;s torathair. Fo b&iacute;thin no bitis a cathbairr <lb n="14620"/> fo cennaib. In tres m<ex>a</ex>c rucad d&oacute; .i. Morand. Ro thriall in c&eacute;tna<!--</lb>--> <mls unit="MS folio" n="126b 15"/> do denam fris .i. a b&aacute;dud. Ro h<ex>er</ex>bad da oclach leis da chur i<!--</lb>--> mbeolu na tuinne. Ora laiset uadib &eacute; i tuind mara brissis in tond<!--</lb>--> in cathbarr &ampersir; t&oacute;cbaid in tond uasa in m<ex>a</ex>c co n-accatar a gn&uacute;is<!--</lb>--> for barr na tuinne. Is and asbertsom. Garg b&eacute; tond ar in m<ex>a</ex>c. <lb n="14625"/> <mls unit="MS folio" n="126b 20"/> Fole&ndot;gat chuce na ocl&aacute;ig &ampersir; dofocbat s&uacute;as. Nacham t<ex>ur</ex>cbaid ar<!--</lb>--> seseom. &Uacute;ar b&eacute; g&aacute;eth. Cid dogenam din m<ex>a</ex>csa ar indara fer.<!--</lb>--> Dogenam ar in fer aile facbam &eacute; i t&eacute;ig ar beind chloche i ndorus<!--</lb>--> tige na cerda .i. M&aacute;en a ainms<ex>id</ex>e cerd ind r&iacute;g. &ampersir; com&eacute;tam in m<ex>a</ex>c<!--</lb>--> d&uacute;s in lessaigfe in cerd &eacute;. O dochuaids<ex>id</ex>e assa thig co n-acca in <lb n="14630"/> <mls unit="MS folio" n="126b 25"/> m<ex>a</ex>c isin t&eacute;ig. &ampersir; no mbeir leis isin tech. Fursain caindel a ben ar<!--</lb>--> se. co n-acther in frithisea fuarusa. Tucad cucu iar sin caindel<!--</lb>--> conid and atbert Morand. Solus b&eacute; caindell. Ro alt in m<ex>a</ex>c la<!--</lb>--> Moen iar sin fora &sdot;eilb f&eacute;in. Rofetatar i&mmacr; na oclaig &uacute;t narbo<!--</lb>--> lesseom in m<ex>a</ex>c. <lb n="14635"/></p>

<p><mls unit="MS folio" n="126b 30"/> Fecht and iarum dolluid Carp<ex>re</ex> do &oacute;l lenna do thig Mo&iacute;n. In<!--</lb>--> tr&aacute;th rop &aacute;niu doib oc &oacute;l. luid in m<ex>a</ex>c as cach ucht i n-araile co<!--</lb>--> ndechaid i n-ucht Chairp<ex>ri</ex>. Ro mainigth<ex>er</ex> in gein ar Carp<ex>re</ex>.<!--</lb>--> C&oacute;ich in m<ex>a</ex>csa la osnaid m&oacute;ir do chur. Focheird da<ex>no</ex> a m&aacute;thair<!--</lb>--> in m<ex>ei</ex>c .i. ben Charp<ex>ri</ex> osnaid aile. Cid it&aacute;id ar M&oacute;en. in format <lb n="14640"/> <mls unit="MS folio" n="126b 35"/> nofar geib. Cid inmain lemsa in m<ex>a</ex>c &ampersir; cid m<ex>a</ex>c dam ropad &fdot;err<!--</lb>--> lem combad libsi &eacute;. ara m&eacute;t far serce lim. &ampersir; ara riachtain a lessa<!--</lb>--> duib. Ni tharla tra an&iacute; h&iacute;sein d&uacute;inni ar Carp<ex>re</ex>. Maith &eacute;m a<!--</lb>--> Chorp<ex>ri</ex> ar in dias oclach &uacute;t ropad maith a l&uacute;ag neich dob&eacute;rad<!--</lb>--> <mls unit="MS folio" n="126b 40"/> duit m<ex>a</ex>c amlaid. Ropad maith im&mmacr; ar Car<ex>pre</ex>. Ro beraind a <lb n="14645"/> chomthrom de argut dara chend. &ampersir; ropad trian de &oacute;r. Acht ni<!--</lb>--> tarba a r&aacute;d ar is erlabra d&iacute;ma&iacute;n a ndogn&iacute;d. Am<ex>al</ex> bid oca no<!--</lb>--> bemm&iacute;s ar na ocl&aacute;ech fonaiscth<ex>er</ex> fort so. Fonaiscth<ex>er</ex> fair. Oro<!--</lb>--> <mls unit="MS folio" n="126b 45"/> naidmed fair fole&ndot;gat na &oacute;claig cuce co tucsat in m<ex>a</ex>c ina ucht. &ampersir;<!--</lb>--> coro dilsigset d&oacute;. Is &eacute; in m<ex>a</ex>csa ar siat rucsam uait dia b&aacute;dud. <lb n="14650"/> &ampersir; iss ed so daronsam de. Is f&iacute;r uile ar in cerd. Is desin tra ro<!--</lb>--> bai m<ex>a</ex>c Main fairseom. &ampersir; it e sin teora bria<ex>thra</ex> toesecha ro<!--</lb>--> r&aacute;id Mor<ex>and</ex> iarna genemain fo chet&oacute;ir .i. garg b&eacute; tond. &uacute;ar b&eacute;<!--</lb>--> gaeth. Solus b&eacute; caindel.<!--</lb>--></p>

<p><mls unit="MS folio" n="126b 50"/> Gabais tra Mor<ex>and</ex> ardbrithemnacht Her<ex>end</ex> iar sin. &ampersir; ba <lb n="14655"/> marb a athairseom .i. Cairp<ex>re</ex>. &ampersir; ro &fdot;aidseom a m<ex>a</ex>c co Feradach<!--</lb>--> Find F<ex>echtnach</ex> i cr&iacute;ch nAlban dia th&oacute;curiud i rr&iacute;ge &ndot;Her<ex>end</ex> ar<!--</lb>--> ro theichs<ex>id</ex>e ria Corp<ex>riu</ex> dar muir innund arnaro marbtha leiss. Co<!--</lb>--> <mls unit="MS folio" n="126b 55"/> tanics<ex>id</ex>e fo gairmseom. &ampersir; corra gab ardr&iacute;ge Her<ex>end</ex> Ocus Mor<ex>and</ex><!--</lb>--> i n-ardbrith<ex>emnacht</ex> Herend. &ampersir; &#x2016; <lb n="14660"/></p></div1>
</div0>
</body>
</text>
</TEI.2>